{
"abseil":"a German loanword for descending on a rope (US rappel)",
"accountancy":"keeping financial accounts; the related profession (US accounting)",
"accounting":"explanation for oneself or one's actions; to give such explanations (US accountability; giving an account)",
"Action Man":"the action figure toy sold in the US as G.I. Joe.",
"advert":"a contraction of advertisement that is more common in British than American English, although British English also employs the American ad",
"agony aunt or uncle":"(informal) the author of an agony column (US advice columnist or Dear Abby)",
"agony column":"(informal) a newspaper or magazine column providing advice to readers' personal problems (US advice column)",
"all change":"the public-transportation announcement for the last stop (US All out)",
"amongst":"a synonym of among acceptable in British English while seeming old fashioned or pretentious in American English",
"answerphone":"an automated telephone-answering machine, from the trademark Ansafone (US & UK answering machine)",
"anti-clockwise":"the direction opposite of clockwise (US counterclockwise).",
"approved school":"(informal) a reform school for juvenile delinquents, from their pre-1969 designation; juvenile detention centres, whether Secure Training Centres for 15- to 18-year-olds or Young Offender Institutions for 18- to 21-year-olds (US juvie)",
"argy-bargy":"(informal) a noisy disagreement ranging from a verbal dispute to pushing-and-shoving or outright fighting.",
"arse":"buttocks, backside or anus (more vulgar than US ass)",
"arse over tit":"(vulgar) to fall head over heels",
"arsed":"(informal) to be made to get off one's arse, usually as a negative or conditional (US be bothered to)",
"artic":"an abbreviation of \"articulated lorry\" (US semi)",
"Auntie or Auntie Beeb":"(affectionate) the BBC",
"autocue":"an automated system for providing scripts to actors and orators, from a genericised trademark (US teleprompter)",
"balls-up":"(vulgar, though possibly not in origin) error, mistake, SNAFU. See also cock-up. (US: fuck up, screw up, mess up)",
"bap":"soft bread roll or a sandwich made from it (this itself is a regional usage in the UK rather than a universal one); in plural, breasts (vulgar slang e.g. \"get your baps out love\"); a person's head (Northern Ireland).",
"barmaid , barman":"a woman or man who serves drinks in a bar. Barman and the originally American bartender appeared within a year of each other (1837 and 1836); barmaid is almost two centuries older (circa 1658).",
"barmy":"crazy, unbalanced (US: balmy)",
"barney":"a noisy quarrel, origin unknown.",
"barrister":"In England, Wales and Northern Ireland, this used to be the only type of lawyer qualified to argue a case in both higher and lower law courts; contrasts with solicitor. For Scotland, see Advocate. Occasionally used in the US, but not to define any particular type of lawyer.",
"bedsit":"one-room flat that serves as a living room, kitchen and bedroom and with shared bathroom facilities (US: see SRO; compare studio apartment (in British English a studio apartment - sometimes 'studio flat' - would have a self-contained bathroom)' efficiency)",
"Beeb, the Beeb":"(affectionate slang) the BBC (British Broadcasting Corporation). See also 'Auntie' (above). The British band Queen released an album called At the Beeb in the UK and it had to be called \"At the BBC\" for US release.",
"Belisha beacon":"orange ball containing a flashing light mounted on a post at each end of a zebra crossing (q.v.); named after the UK Minister of Transport Leslie Hore-Belisha who introduced them in 1934.",
"bell-end":"the glans penis, (slang, vulgar) a male orientated insult.",
"berk, burk or burke":"a mildly derogatory term for a fool or stupid person. An abbreviation of either 'Berkshire Hunt' or 'Berkeley Hunt', rhyming slang for cunt.",
"bevvy":"an alcoholic beverage",
"biccie, bicky, bikky":"a biscuit (US: \"cookie\")",
"big girl's blouse":"a man or a boy who behaves in a way which other men think is how a woman would behave, especially if they show they are frightened of something",
"bint":"a condescending and sometimes derogatory term for a woman (from the Arabic for 'daughter'). Usage varies with a range of harshness from 'bitch', referring to a disagreeable and domineering woman, to only a slightly derogatory term for a young woman.",
"biro":"/ˈbaɪəroʊ/ a ballpoint pen. Named after its Hungarian inventor László Bíró and the eponymous company which first marketed them.",
"bits and bobs":"sundry items to purchase, pick up, et cetera (e.g. whilst grocery shopping) (Britain and US: odds and ends)",
"black pudding":"(US: blood sausage)",
"blag":"(slang) to obtain or achieve by deception and/or ill preparation, to bluff, to scrounge, to rob, to wing it. A scam, tall story or deception. Derived from the French word blague.",
"bleeder":"derogatory term used in place of bloke (\"what's that stupid bleeder done now?\"); use has declined in recent years.",
"blimey":"(informal) an exclamation of surprise. (Originally gor blimey, a euphemism for God blind me, but has generally lost this connotation.)",
"bloke":"(informal) man, fellow. e.g. Terry is a top bloke. Also common in Australia and New Zealand. (US and UK also: guy).",
"blower":"telephone",
"blues and twos":"(slang) emergency vehicle with lights and sirens (emergency services in the UK generally use blue flashing lights and formerly used a two-tone siren) (US: lights and sirens or code)",
"bobby":"police officer, named after Sir Robert Peel, the instigator of the world's first organised police force. The word 'peeler' of similar origin, is used in Northern Ireland.",
"Bob's your uncle":"there you go, it's that simple. (Some areas of US have the phrase Bob's your uncle; Fanny's your aunt)",
"bodge":"a cheap or poor (repair) job, can range from inelegant but effective to outright failure. e.g. You properly bodged that up (you really made a mess of that). (US: botch or cob, shortened form of cobble) See Bodger.",
"boffin":"an expert, such as a scientist or engineer",
"bog roll":"(roll of) toilet (\"bog\") paper (slang).",
"bog-standard":"completely ordinary, run-of-the-mill, unadulterated, unmodified. (US vanilla, garden-variety).",
"boiled sweet":"type of confection (US: hard candy)",
"bollocks":"(vulgar; originally ballocks, colloquially also spelled as bollox) testicles; verbal rubbish (as in \"you're talking bollocks\") (US: bullshit). The somewhat similar bollix is found in American English, but without the anatomical connotations or vulgar sense meaning 'mess up'. The twin pulley blocks at the top of a ship's mast are also known as bollocks, and in the 18th century priests' sermons were colloquially referred to as bollocks; it was by claiming this last usage that the Sex Pistols prevented their album Never Mind the Bollocks from being banned under British obscenity laws. Related phrases include bollocksed, which means either tired (\"I'm bollocksed!\") or broken beyond repair; bollocks up, meaning to mess up (\"He really bollocksed that up\"); and bollocking, meaning a stern telling off. Compare dog's bollocks, below",
"bone-idle":"lazy",
"botty, bot":"a person's bottom (informal or childish)",
"bowler":"a type of men's hat (US: derby)",
"brass monkeys":"cold – from \"cold enough to freeze the balls off a brass monkey\". According to a popular folk etymology, this phrase derives from cannonballs stowed on a brass triangle named after a \"powder monkey\" (a boy who runs gunpowder to the ship's guns) spilling owing to the frame's contraction in cold weather. (This is however incorrect for several physical and linguistic reasons.) The phrase is a 20th-century variant of earlier expressions referring to other body parts, especially the nose and tail, indicating that the brass monkey took the form of a real monkey.",
"brekkie, brekky":"(slang) synonym of breakfast",
"breve":"(musical) a note of two bars' length (or a count of 8) in 4/4 time (US: double whole note)",
"bristols":"(vulgar, rhyming slang) breasts; from football team Bristol City = titty",
"brolly":"(informal) umbrella",
"brown bread":"(rhyming slang) dead; \"You're brown bread, mate!\"",
"browned off":"Fed up, annoyed or out of patience.",
"bubble and squeak":"dish of cooked cabbage fried with cooked potatoes and other vegetables. Often made from the remains of the Sunday roast trimmings.",
"buggered":"(vulgar, literally a synonym for 'sodomised') worn out; broken; thwarted, undermined, in a predicament, e.g. 'If we miss the last bus home, we're buggered' (US: screwed). Also used to indicated lack of motivation as in \"I can't be buggered\". (US: \"I can't be bothered.\")",
"bugger all":"little or nothing at all; \"I asked for a pay rise and they gave me bugger all\"; \"I know bugger all about plants\"; damn all. US: zip, jack or (offensive) jack shit. Usage is rare in the US.",
"building society":"an institution, owned by its depositors rather than shareholders, that provides mortgage loans and other financial services (US equivalent: savings and loan association)",
"bum bag":"a bag worn on a strap around the waist (US: fanny pack)",
"bumble":"to wander aimlessly or stroll/walk without urgency to a destination; usually synonymous with amble when used in the US.",
"bumf, bumph":"useless paperwork or documentation (from \"bum fodder\", toilet paper)",
"bunce":"a windfall; profit; bonus",
"bureau de change":"an office where money can be exchanged (US: currency exchange)",
"burgle":"(originally colloquial, back-formation from burglar) to commit burglary (in the US, burglarize is overwhelmingly preferred, although burgle is occasionally found).",
"butty":"a sandwich (esp. 'chip butty' or 'bacon butty').",
"by-election":"(US: special election)",
"cack":"(slang) faeces (feces); nonsense or rubbish: \"what a load of cack\" could equally be used to describe someone talking nonsense or as a criticism of something of poor quality. Also spelt \"kak\" as used in Dutch. Derived from an ancient Indo-European word, kakkos, cognate with German word Kacke, Welsh word \"cach\" and the Irish and Scottish Gaelic word \"cac\" which all mean 'shit'.",
"cack-handed":"(informal) clumsy ; left-handed. Derived from cack, meaning \"fæces (feces)\", with reference to the tradition that only the left hand should be used for cleaning the 'unclean' part of the human body (i.e. below the waist).",
"cafetière":"device for making coffee (US: French press)",
"caff":"abbreviation for a café; now used mainly for the old-fashioned establishment (\"there's a proper caff up that side road\") to distinguish from chain cafés.",
"cagoule":"type of lightweight hooded waterproof clothing (US: windbreaker)",
"call minder":"(rare) telephone message recorder (US and UK also: answering machine; voicemail machine)",
"candidature":"synonymous with candidacy",
"candy floss":"spun sugar confection (US: cotton candy)",
"caravan park":"area where caravans are parked (US: Trailer park for near-permanently-installed mobile homes, RV park or campground for areas intended for short term recreational vehicle parking. Trailer parks are typically low-income permanent residencies; RV parks/campgrounds are a holiday (vacation) destination.)",
"car boot":"storage area of car (US: trunk). Can also mean car boot sale.",
"car hire":"car rental",
"car park":"area where cars are parked (US usually parking lot if outdoor, parking garage if indoor).",
"carer":"a person who cares for another, such as a child, elderly, or disabled person. (US: caregiver)",
"carriageway":"the part of a road that carries the traffic; see also dual carriageway (US and UK also: lane)",
"cash machine":"automated teller machine.",
"cashpoint":"automated teller machine. Originally a brand name for Lloyds TSB ATMs, now genericized.",
"cats eye":"reflector used to mark lane divisions and edges of roads, also written cat's-eye, genericised from the trademark Catseye (US: raised pavement marker; Botts' dots are similar)",
"central heating boiler":"(US: furnace)",
"central reservation":"physical barrier dividing oncoming carriageways (only on dual-carriageways or motorways) (US: median strip)",
"chancer":"(slang) an opportunist",
"char, cha":"(informal) tea. From the Mandarin.",
"char":"(informal) see charwoman",
"charlady":"see charwoman",
"Chartered Accountant":"one authorised to certify financial statements; the equivalent of an American CPA (Certified Public Accountant)",
"charwoman":"(dated) a woman employed as a cleaner, especially as an office cleaner",
"chat up":"talk flirtatiously with. Similar to American \"come on to (someone)\".",
"chav":"(slang, often derogatory, used primarily in England) typically a nouveau riche or working class person of most of the time lowish intelligence who wears designer label (e.g. Burberry) copies, fake gold bling, and is a trouble-maker. \"Chav\" is used nationally, though \"charv\" or \"charva\" was originally used in the northeast of England, deriving from the Roma (people) word charva, meaning disreputable youth. The closest US equivalents to the chav stereotype are arguably wiggers, although the cultural differences are existent.",
"cheeky":"impertinent; noun form, cheek, impertinence; a child answering back to an adult might be told \"don't give me any of your cheek\" (also there is the expression \"cheeky monkey!\" in reaction to a cheeky remark).",
"cheerio!":"(informal, friendly) exclamation of farewell (similar to 'seeya!' and 'ta-ra!'). No connection to the breakfast cereal Cheerios.",
"cheers":"(informal, interjection) Thank you. Can also be used to say goodbye .",
"Chesterfield sofa":"a deep buttoned sofa, with arms and back of the same height. It is usually made from leather and the term Chesterfield in British English is only applied to this type of sofa.",
"child-minder":"(babysitter) a person who looks after babies and young children (usually in the person's own home) while the baby's parents are working. Childminders are a more professional type of babysitter, and in England are required to be registered with Ofsted, the government-sanctioned education regulation body. They must also possess at least a Level 2 qualification in childcare. A babysitter does not require these qualifications. Babysitter is more common in the UK.",
"chimney pot":"smoke-stack atop a house. But refers to the cylindrical topmost part. The part below is the chimney or chimney stack.",
"chinagraph pencil":"pencil designed to write on china, glass etc. (US: grease pencil, china marker)",
"chip shop":"(informal) fish-and-chip shop (parts of Scotland, Ire: chipper), also chippy (see also List of words having different meanings in British and American English)",
"chinwag":"(slang) chat",
"chuffed":"(informal, becoming somewhat archaic, originally Liverpudlian) proud, satisfied, pleased. Sometimes intensified as well chuffed; cf. made up",
"chunder":"vomit",
"chunter":"(sometimes chunner) to mutter, to grumble, to talk continuously; \"What's he chuntering on about?\"",
"clanger":"(informal) a big mistake, blunder, bad joke or faux pas ('to drop a clanger') (US: lay an egg)",
"clapped out":"(informal) worn out (said of an object)",
"cleg":"horse fly",
"clingfilm":"thin plastic film for wrapping food (US: plastic wrap, Saran wrap)",
"cobblers":"shoe repairers ; (slang) a weaker version of bollocks, meaning 'nonsense' (often \"a load of old cobblers\"), from rhyming slang 'cobbler's awls' = balls",
"cock-up, cockup":"(mildly vulgar) error, mistake.",
"codswallop , codd's wallop":"You're talking codswallop. Sometimes said to be named after Hiram Codd, the inventor of the Codd bottle, which was commonly used in the late 19th Century for fizzy drinks (Codd's wallop), though this derivation is thought to be an example of false etymology. (US: You're talking garbage)",
"communication cord":"near obsolete term for the emergency brake on a train. Is nowadays an alarm handle connected to a PA system which alerts the driver.",
"community payback":"court-mandated sentence of community service either in addition to or as a substitute for incarceration",
"compère":"(French) master of ceremonies, MC",
"compulsory purchase":"the power of the governmental authority to take private property for public use (similar to US: eminent domain)",
"conservatoire":"music school (US usually conservatory)",
"cool box":"box for keeping food and liquids cool (US and UK also: cooler)",
"cop off with":"(slang) to successfully engage the company of a potential sexual partner, to \"pull\"; to copulate (have sexual intercourse) with.",
"Cor Blimey":"see Gor Blimey",
"coster, costermonger":"a seller of fruit and vegetables",
"cotton bud":"wad of cotton wool fixed to a small stick, used for cleaning (US: cotton swab, Q-Tip)",
"cotton wool":"Spun cotton, used for cleaning wounds or make-up (US: Absorbent cotton, cotton ball)",
"council house/flat, also council housing or estate":"public housing. In Scotland the term housing scheme, or simply scheme is more commonly used. (US: projects)",
"counterfoil":"stub of a cheque, ticket etc. (US: stub)",
"counterpane":"a decorative cloth used to cover a bed when it is not in use (US: bedspread)",
"courgette":"(French) the plant Cucurbita pepo (US: zucchini, from the Italian).",
"cowl":"a wind deflector fitted to a chimney top.",
"crack on(-to)":"whereas \"crack on\" may be used in a generalised sense as \" get on with\" (often, a task), to \"crack on to\" indicates one was, or planned to, engage in flirtation, to varying degrees",
"crikey":"exclamation of surprise (once a euphemism for Christ's keys or perhaps Christ Kill Me. Popularized in the US by late Australian herpetologist Steve Irwin)",
"crisps":"very thinly sliced fried potatoes, often flavoured, eaten cold as a snack (US: potato chips)",
"crotchet":"a musical note with a duration of one count in a time signature of 4/4 (common time) (US: quarter note; see Note value)",
"cuddly toy":"soft toy (sometimes used in the US; also stuffed animal, plush toy). Occurs as the title of the Monkee's song \"Cuddly Toy\", written by Nilsson.",
"cuppa":"tea (never coffee or other beverage)",
"current account":"personal bank account used for everyday transactions (US: checking account)",
"daft":"odd, mad, eccentric, daffy, crazy – often with the implication of it being amusingly so. \"Don't be daft\" and \"don't be silly\" are approximately synonymous.",
"dekko":"(informal) a look, reconnoître \"I'll take a dekko at it later.\" – British military slang derived from the Hindustani dhek/dekho meaning \"to see\". Also less commonly decco, deccie, deek, deeks.",
"dene":"wooded valley or seaside dune (mainly S W England)",
"div, divvy":"(slang) a fool or idiot; adjective form, divvy, foolish or idiotic.",
"doddle":"something accomplished easily - \"It's a doddle\", meaning \"it's easy\".",
"dodgems":"funfair or fairground bumper cars",
"dodgy":"unsound, unstable, and unreliable (US: sketchy). 'That bloke over there looks a bit dodgy'",
"dogsbody":"someone who carries out menial tasks on another's behalf; a drudge (US: grunt)",
"the dog's bollocks":"(vulgar) something excellent or top quality, the \"bee's knees\" (the business), the \"cat's whiskers\". Sometimes just \"the bollocks.\" (US: the shit). In polite company this phrase may be toned down to \"The mutt's nuts\", or the phrase \"The bee's knees\" (the business) may be used as a polite substitute. The etymology of this expression is said by some to derive from printers' slang for the punctuation symbol ':-' when printing involved the use of carved metal blocks to form typesetting.",
"dole":"(informal) welfare, specifically unemployment benefit. Sometimes used in the US, esp. older generation",
"door furniture":"(US: door hardware)",
"donkey's years":"a very long time.",
"dosh":"(slang) money (US: dough) \"how much dosh you got on ya?\"",
"doss":"to be lazy, \"I've been dossing all day\", also can mean to truant, \"dossing off\" (similar to bunking off). Additionally it can informally take the form of a noun (i.e. \"that lesson was a doss\", meaning that lesson was easy, or good (primarily central Scotland). Also \"dosser\", a lazy person, or a tramp (US bum); \"to doss down\", to find a place to sleep, to sleep on some substitute for a bed such as a sofa, the floor, or a park bench; \"doss-house\", temporary accommodation for tramps or homeless people, cheap dilapidated rented accommodation with low standards of cleanliness (US: flophouse)",
"double first":"an undergraduate degree where the candidate has gained First-Class Honours in two separate subjects, or alternatively in the same subject in subsequent examinations (see British undergraduate degree classification)",
"draper":"a dealer in drapery (i.e. clothing, textiles, etc.) (US: dry goods)",
"draughts":"the board game (US: checkers)",
"drawing pin":"pin with a large, flat head, used for fixing notices to noticeboards etc. (US: thumbtack)",
"dress circle":"the seats in the first balcony of a theatre (US: balcony or loge although dress circle is used in a few very large opera houses that have many levels of balconies)",
"drink-driving":"operating a motor vehicle under the influence of alcohol (US: drunk driving; DUI; DWI; OWI)",
"driving licence":"document authorising the holder to drive a vehicle (US: driver's license, driver license)",
"dual carriageway":"road, usually a major one, with each direction of travel separated from the opposing one by a traffic-free, and usually slightly raised, central reservation. Each direction of travel (carriageway) comprises two or more 'lanes'. (US: divided highway)",
"dustbin":"(sometimes used in the US) receptacle for rubbish, very often shortened to 'bin'. (US: trash can; wastebasket)",
"dustbin man or dustman":"rubbish collector (US: garbage man; trash man; sanitation engineer)",
"dustcart":"rubbish/refuse collecting vehicle (US: garbage truck; trash truck)",
"economy class":"the cheapest class of passenger airline travel (US: coach or coach class)",
"earth, earthed":"connected to an electric common return (including but not limited to the physical earth), (US: ground, grounded)",
"Elastoplast":"an adhesive bandage placed on a minor cut or scrape (UK also: sticking/sticky plaster; US: Adhesive bandage, Band-Aid)",
"electric fire":"domestic electric heater (US: space heater)",
"engaged tone":"tone indicating a telephone line in use, (US: busy signal)",
"estate agent":"a person who sells property for others (US: realtor, real estate agent)",
"estate car":"a station wagon",
"ex-directory":"(of a telephone number) unlisted; also informally of a person \"he's ex-directory\", meaning his telephone number is unlisted",
"extension lead":"Extension cable typically refers to mains power but may refer to other cables like telephones, (US and UK also: extension cord)",
"faff":"to dither, futz, waste time, be ineffectual, “I spent the day faffing about in my room”. Also related noun (\"That's too much of a faff\").",
"fag end":"cigarette butt; also used as in 'the fag end of the day' i.e. the last part of the working day",
"fairing":"a gift, particularly one given or bought at a fair (obsolete); type of cookie (biscuit) made in Cornwall",
"fairy cake":"a small sponge cake (US and UK also: cupcake)",
"fairy lights":"Christmas lights",
"feck":"(vulgar) mild expletive employed as an attenuated alternative to fuck (including fecker, fecking, etc.) (originally Hiberno English and popularized by the television series Father Ted). (Similar to US frick/fricking, freak/freaking, eff/effing)",
"fiddly":"requiring dexterity to operate (\"the buttons on the tiny mobile phone were too fiddly\")",
"fire brigade":"fire department",
"fiscal":"short for Procurator Fiscal, name of the public prosecutor in Scotland (US: District Attorney, state prosecutor etc.)",
"fish fingers":"(US: fish sticks)",
"fiver":"five pound note (bill)",
"fizzy drink":"carbonated soft drink (US: soda, pop, coke, tonic (New England) depending on the region)",
"flex":"electrical lead (UK); electrical cord (US)",
"flight lieutenant":"an Air Force officer rank (US: captain)",
"flypast":"ceremonial flight of aircraft (US: flyby)",
"footie":"(slang) football (US: soccer)",
"fortnight":"a period of 14 days (and nights) or two weeks",
"freephone":"a telephone number where the caller is not charged for the call (US: toll-free number)",
"French letter":"(slang) condom",
"funfair":"a travelling fair with amusements, stalls, rides etc. (US: carnival or traveling carnival)",
"gaff":"(slang) house, home. Also any other place: cheap music hall, theatre, pub, club, shop, hangout",
"gaffer":"(informal) old man; (informal) boss; football manager (US: soccer coach); Also in US: (professional) chief electrician on a theatrical or film set.",
"gangway":"a path between the rows of seats in a theatre or elsewhere (US aisle; gangway is a naval command to make a path for an officer)",
"gaol":"A prison, mostly historical (US: jail)",
"G clamp":"A metal screw clamp (US: C clamp).",
"gearbox":"system of gears in a vehicle or other machinery (US transmission). In the UK transmission typically refers to drive shafts.",
"gear-lever / gearstick":"handle for changing gears in a vehicle or other machinery (US gearshift)",
"gen":"(informal) information, info (short for \"intelligence\") (US: intel)",
"get off with":"(colloquial) to begin a sexual relationship",
"Geordie":"a person from Newcastle upon Tyne, or used as an adjective to describe the accent or culture of the surrounding Tyne and Wear region of England.",
"gherkin":"a pickled cucumber (US: \"pickle\")",
"git":"(derogatory) scumbag, idiot, annoying person (originally meaning illegitimate; from archaic form \"get\", bastard, which is still used to mean \"git\" in Northern dialects)",
"giro":"(slang), social security benefit payment (US: welfare), is derived from the largely obsolete Girobank payment system that was once used in Britain for benefit and state pension payments.",
"glandular fever":"mononucleosis",
"gobby":"loudmouthed and offensive",
"gob-shite":"(vulgar)(insult) slang term for a person who is being mouthy about something or someone",
"gobsmacked":"(slang) utterly astonished, open-mouthed",
"go pear-shaped":"see pear-shaped",
"goolies":"(slang), (British) The testicles, from goli Hindi for ball.",
"gor blimey":"exclamation of surprise, also cor blimey (originally from \"God blind me\")",
"Gordon Bennett!":"expression of surprise, contempt, outrage, disgust, frustration.",
"gormless":"stupid or clumsy",
"go-slow":"a protest in which workers deliberately work slowly (US: slowdown or work to rule)",
"green fingers":"talent for growing plants (US: green thumb)",
"greengrocer":"a retail trader in fruit and vegetables",
"gritter":"a truck that spreads sand or salt on roads when they are covered with ice (US: salt truck, salt spreader)",
"grotty":"disgusting, dirty, poor quality (originally from grotesque, though now rarely used with quite that meaning). In a scene from the 1964 film A Hard Day's Night, George Harrison has to explain the meaning and origin of the word; the impression is given that it was then considered modern slang, known only to trendy youngsters (this is no longer the case). George Harrison would have been familiar with the word as well-established Liverpool slang.",
"group captain":"an Air Force officer rank (US: colonel)",
"Guard's Van":"(n.) (also known as a Brake Van or a Driving Van Trailer) the leading or trailing carriage on a train nowadays used for luggage storage (US: Caboose)",
"gumption":"initiative, common sense, or courage",
"gutties":"running shoes, tennis shoes, maybe from \"gutta percha\" old source of natural rubber",
"guv":"(slang) A contraction of \"governor\", used to describe a person in a managerial position e.g. \"Sorry mate, can't come to the pub, my guv'nor's got me working late tonight\". Heard mostly in London.",
"half-":"meaning thirty minutes past the hour (Standard English and US: \"Half past\").",
"hand brake":"Parking brake operated by a hand control, usually a lever (US: Emergency brake. In the US, the traditional \"hand brake\" is more often to be found on a bicycle or motorcycle as opposed to a car as in the UK.); handbrake turn, a stunt where the handbrake is used to lock the rear wheels and the resulting oversteer enables the car to be turned rapidly in a small space (US related: J-turn, bootleg turn, U-turn.)",
"ha'penny":"(pronounced \"HAY-penny\" or \"HAYP-nee\") half a penny; a coin of this denomination belonging to the predecimal coinage which is no longer in circulation. There was also a half penny in the decimal coinage introduced in 1971 which was 1/200 of a pound. Ha'pennies stopped being legal tender in 1985 and were removed from circulation.",
"ha'porth":"(pronounced \"HAY-puth\") halfpennyworth.",
"hash sign":"the symbol \"#\" (US: number sign, pound sign)",
"headmaster, headmistress, headteacher, head":"the person in charge of a school (US: principal; headmaster and the like are usually used for private schools)",
"Heath Robinson":"(of a machine or contraption) absurdly complex (see Rube Goldberg machine).",
"high street":"primary business and shopping street (US: main street)",
"hire purchase":"a credit system by which debts for purchased articles are paid in installments (US: installment plan or layaway if the item is kept at the store until the final payment is made)",
"hoarding":"a panel used to display outdoor advertisements, such as on the sides of buildings, or alongside highways (US billboard)",
"hold-all":"a bag (US: duffel bag)",
"holidaymaker":"person on holiday (US: vacationer)",
"hols":"(informal) short for holidays",
"hoover":"vacuum, to vacuum (archaic in the US) (genericised trademark, from The Hoover Company, the first main manufacturer of vacuum cleaners)",
"hot up":"to become more exciting (US: heating up).",
"hundreds-and-thousands":"coloured sugar sprinkles used for dessert decoration (US: sprinkles, non-pareils, jimmies)",
"ice lolly":"frozen fruit juice on a stick; ice pop (US: Popsicle),",
"icing sugar":"(US: powdered sugar)",
"industrial action":"(see article; US: job action)",
"inverted commas":"quotation marks (see also American and British English differences – Punctuation)",
"invigilator":"person who monitors an examination (US: proctor)",
"ironmongery":"ironware, hardware; hardware store",
"identity parade":"police lineup",
"jacket potato":"baked potato",
"jam sandwich":"(slang) police car. So called as, in the past, most UK police vehicles were white with a horizontal yellow-edged red fluorescent stripe along the entire length of their sides, giving a certain resemblance to a white bread sandwich with a coloured jam (jelly) filling. The majority of marked vehicle operated by the Metropolitan Police Service retain this livery, albeit the cars are now (mostly) silver. Some older vehicles are still in white, while the Diplomatic Protection Group (DPG) use red vehicles. (US: black-and-white. In many cities of the US, police cars are painted black at the hood and trunk and white on the doors and roof.)",
"jammy (git, cow)":"(slang) lucky (person, woman)",
"JCB":"generic name for a mechanical excavator or backhoe loader, based on the eponymously named company which manufactures such devices.",
"jemmy":"To break into a lock, from the tool that is used in such an occasion as burglary (US: jimmy)",
"jerry":"(slang) pejorative term for a German or Germans",
"jerrybuilt or jerry-built":"An improvised or unsafe building or piece of infrastructure (e.g. an electrical installation), probably in contravention of safety legislation; (US: jerry-rigged).",
"jiggery-pokery":"Expertly tinker with something in a way that a non-expert or casual observer is unlikely to comprehend.",
"jimmy":"(Rhyming slang) urinate, as in jimmy riddle - piddle",
"jobsworth":"(slang) Originally a minor clerical/government worker who refuses to be flexible in the application of rules to help clients or customers (as in \"it will cost me more than my job's worth to bend the rules\"). Also used more broadly to apply to anyone who uses their job description in a deliberately obstructive way.",
"johnny":"(slang) a condom (US: rubber, Jimmy-hat)",
"John Thomas":"Better known as slang for penis or \"dick\" (US: cock, dick, or johnson) From the novel Lady Chatterley's Lover",
"Joey":"Term of abuse used of someone perceived to be foolish, stupid, incompetent, clumsy, uncoordinated, ridiculous, idiotic. Originated with the appearances of cerebral palsy sufferer Joey Deacon on children's TV programme Blue Peter; still a popular insult among adults who saw the programmes as children.",
"jumble sale":"(see article; US: rummage sale)",
"jump leads":"booster cables used to jump-start a car (US: jumper cables)",
"Karno's Army":"a chaotic, ineffective team (usually: Fred Karno's Army) (related US: Keystone Kops, Gang That Couldn't Shoot Straight)",
"kecks":"(informal, also spelt keks) trousers or underpants",
"kerfuffle":"a disorderly outburst, disturbance or tumult; from Scots carfuffle",
"kazi":"(slang) lavatory (numerous alternative spellings are seen, such as khazi, karzy, karsey, carzey etc.)",
"kip":"(slang) sleep.",
"kirby grip":"hair grip. (US : bobby pin)",
"kitchen roll":"paper towels",
"knackered":"(slang) exhausted, broken, originally 'sexually exhausted', derived from an old use of the verb meaning 'to kill or castrate'",
"knacker's yard":"premises where superannuated livestock are sent for rendering, etc. (glue factory). Sometimes refers to the same for vehicles, a scrapyard (US: junkyard)",
"knackers":"(slang) testicles",
"ladybird":"red and black flying insect (US: ladybug)",
"launderette":"self-service laundry (US: laundromat, from an expired Westinghouse trademark )",
"lav":"(informal) lavatory, toilet; also, lavvy (in the US, airplane restrooms are typically called lavatories)",
"lead (electrical, as on an appliance or musical instrument, microphone etc.)":"electrical cord (US)",
"learnt":"past tense of \"learn\" (US: learned)",
"legacy accounts":"funds left in a budget (US: funds remaining)",
"legless":"extremely drunk",
"lessons":"classes (class used more common in US English)",
"let-out":"(n.) a means of evading or avoiding something",
"letter box":"1. a slot in a wall or door through which incoming post is delivered (US: mail slot, mailbox)",
"2. (less common) a box in the street for receiving outgoing letters and other mail (more usually called a postbox or pillar box) (US: mailbox)":"See also Letterbox (US & UK): a film display format taking its name from the shape of a letter-box slot",
"life assurance":"also described as life insurance regardless of coverage (US : life insurance)",
"lock-in":"illegal gathering in a pub at night to drink after the pub is supposed to have stopped serving alcohol, where the landlord \"locks in\" his guests to avoid being caught by police. Unless the landlord charges for the drinks at the time, the people in the pub are considered his personal guests; if money is exchanged beforehand or afterwards then it is considered a gift from the guest to the landlord for the hospitality. Since the introduction of the smoking ban in England and Wales in 2007, a \"lock in\" can now mean a landlord locking the pub doors and allowing smoking inside the premises. (US: may refer to a large and highly chaperoned \"sleep over\" at a church, school, etc.)",
"lodger":"tenant renting a room rather than an entire property; typically lives with the renter and his/her family",
"lollipop lady":"a school crossing guard who uses a circular stop sign",
"loo":"toilet (usually the room, not just the plumbing device) (US: bathroom, restroom)",
"lorry":"a large goods-carrying motor vehicle (US and UK also: truck)",
"loudhailer":"megaphone (US: bullhorn)",
"lower ground":"In houses, a floor below ground level but not fully underground, typically under a raised ground floor which has steps up from ground level to the main entrance. In offices and shops, a basement.",
"lurgy":"(hard 'G', originally spelled \"lurgi\") 1. An imaginary illness allegedly passed on by touch—used as an excuse to avoid someone. (c.f. US: cooties) From an episode of the Goon Show. 2. (slang) A fictitious, yet highly infectious disease; often used in the phrase \"the dreaded lurgy\", sometimes as a reference to flu-like symptoms. Can also be used when informing someone you are unwell but you either do not know or do not want to say what the illness is.",
"main":"pipe that carries gas or water. \"The water main has burst!\" (US: line: e.g. gas line, water line etc.)",
"the mains":"230-250V (Typically denoted on domestic electricals as the rounded 240V standard) AC electric current, provided by the electricity grid to homes and businesses; also attrib. (\"mains cable\") (US: 120 volts AC, variously called: line power, grid power, AC power, household electricity, etc.)",
"managing director":"equivalent of US CEO (Chief Executive Officer), also used in the UK",
"manky":"(slang) feeling ill, rough, out of sorts; filthy, dirty, rotten. (of uncertain origin, poss. from French \"manqué\" - missed, wasted or faulty)",
"mardy":"(derogatory, mainly Northern and Central England) describes someone who is in a bad mood, or more generally a crybaby or whiner or \"grumpy, difficult, unpredictable\". Used, for example, by children in the rhyme \"Mardy, mardy mustard...\", and in the title of the Arctic Monkeys song \"Mardy Bum\". The verb to throw a mardy means to display an outburst of anger.",
"maths":"mathematics (US: math)",
"MD":"equivalent of US CEO (Chief Executive Officer), also used in the UK",
"Mexican wave":"simply called The Wave in the US",
"mentioned in despatches":"identified for valour or gallantry in action (US: decorated)",
"milliard":"one thousand million, or 1,000,000,000 (US: billion or 1,000,000,000) Now superseded by the short scale usage of billion (1,000,000,000).",
"mince":"1. ground meat, especially beef (US: ground beef, hamburger meat, mince typically describes a chopping style); 2. Walk daintily or effeminately; 3. Mince your words -- to obfuscate or conceal (or use euphemisms) when talking or writing (US: \"He/She doesn't mince words.\")",
"minge":"(vulgar) (rhymes with singe) female genitals or pubic hair",
"minger":"(from Scots language ming \"to smell strongly and unpleasantly\", rhymes with singer) someone who is unattractive",
"minim":"a musical note with the duration of two counts in a time signature of 4/4 (US: half note; see Note value)",
"mobile phone":"(US: cell phone)",
"moggie, moggy":"(informal) non-pedigree cat; alley cat; any cat regardless of pedigree; Morris Minor car; Morgan car",
"Mole grips":"trade name for (US: Vise-Grips).",
"mong":"(slang) disgusting, dirty, foul, idiotic person, possible derivation from mongoloid, now obsolete term for someone with Down's syndrome",
"monged":"(slang) being incapable of constructive activity due to drug use, alcohol consumption or extreme tiredness",
"MOT":"(pronounced emm'oh'tee) mandatory annual safety and roadworthiness test for motor vehicles over 3 years old (from \"Ministry of Transport\", now renamed \"Department for Transport\")",
"motorway":"A controlled-access highway, the largest class of road on the British road network, designed for fast, high volume traffic. Abbreviated to M, as in M25 or M1. (US: equivalent to freeway)",
"mouthing off":"shouting, ranting or swearing a lot about something or someone. e.g.: \"that guy was just mouthing off about something\" (US: backtalk; often shortened to mouth)",
"move house":"to move out of one's house or other residence into a new residence (US: move, move out)",
"munter":"an ugly woman (rarely, man); similar to minger",
"muppet":"an incompetent or foolish person",
"naff":"(slang) lame, tacky, cheap, low quality (origin uncertain – numerous suggestions include backslang for fan, an old term for a vagina), also gay slang for a straight man (said to mean \"Not Available For Fucking\")",
"naff off":"(dated slang) shove it, get lost, go away – a much less offensive alternative to \"fuck off\" (originally obscure Polari slang, made popular by prison sitcom Porridge and famously used by Princess Anne)",
"nail varnish":"a varnish applied to nails to enhance strength and glossiness. (US: nail polish)",
"nark":"1. (v.) (informal) irritate; also narked, the adjective; 2. (n.) (slang) police informer (US: narc, derived from narcotics agent, but often used in a general sense)",
"National Insurance":"compulsory payments made to the Government from earnings to pay for welfare benefits, the National Health Service (see below) and the state pension fund.",
"never-never":"(slang) hire purchase (see above). Often used in the media as a derogatory term to describe credit or debt.",
"newsagent":"strictly a shop owner or shop that sells newspapers, usu. refers to a small shop, e.g. corner shop, convenience store, newsstand, or similar (US: newsdealer)",
"newsreader":"someone who reads the news on TV or radio. See news presenter for a description of the different roles of a newscaster, a British newsreader and an American news anchor.",
"nice one":"(slang) a way of thanking someone, or congratulating them.",
"2. (n.) a police station or prison":"nicked",
"arrested (\"you're nicked\") - related to \"the nick\", above (US: up the river, busted)":"nicker",
"(colloquial) 1 pound, maintains singular form when used in a plural context (\"it cost me 2 nicker\"), rarely used in the singular":"niff",
"an unpleasant smell":"Nissen hut",
"hemicylindrical building of corrugated metal. Named for the designer. (US: Quonset hut, named for the place of US manufacture)":"NHS",
"the National Health Service, the state run healthcare system within the United Kingdom":"nob",
"1. head":"2. a person of wealth or social standing",
"nobble":"(v.) to sabotage, attempt to hinder in some way. E.g. \"Danny nobbled my chances at the pub quiz by getting Gary to defect to his team.\"",
"nosh":"1. food, meal; also \"nosh up\", a big satisfying meal (\"I could do with a good nosh up\") Cf US usage, where nosh means \"snack\" or \"to eat\" as in the original Yiddish (i.e., \"He's noshing on the shrimp cocktail.\")",
"nosy (or nosey) parker":"a busybody (similar to US: butt-in, buttinski, nosy)",
"nous":"Good sense; shrewdness: \"Hillela had the nous to take up with the General when he was on the up-and-up again\" (Nadine Gordimer). Rhymes with \"mouse\" or \"moose\".",
"nowt":"nothing; not anything. \"I've got nowt to do later.\" Northern English. (see also 'owt' - anything; as in the phrase \"you can't get owt for nowt\" or \"you can't get anything for nothing\")",
"number plate":"vehicle registration plate (sometimes used in the US; also license plate or license tag)",
"numpty":"(originally Scottish, now more widespread) a stupid person",
"nutter":"(informal) a crazy or insane person, often violent; also used as a more light-hearted term of reproach (\"Oi nutter!\") (occasionally used in the US) (US and UK also: nut, nutcase)",
"OAP":"Old Age Pensioner (US senior citizen)",
"off-licence / offie":"a store for alcoholic beverages which must be imbibed elsewhere (US liquor store)",
"off-the-peg":"of clothes etc., ready-made rather than made to order (US: off-the-rack)",
"offal":"the entrails and internal organs of a butchered animal.",
"oi":"coarse exclamation to gain attention, roughly equivalent to \"hey\" (\"Oi, you!\" = \"Hey you!\")",
"the Old Bill":"(slang) The police - specifically the Metropolitan Police in London, but use of the term has spread elsewhere in England",
"one-off":"something that happens only once; limited to one occasion (as an adjective, a shared synonym is one-shot; as a noun)",
"on the back foot":"outclassed; outmaneuvered by a competitor or opponent",
"on the piss":"(vulgar) drinking heavily; going out for the purpose of drinking heavily; at a slight angle, said of an object that should be vertical",
"orientate":"less common alternative to orient, deprecated by some as an unnecessary back-formation from orientation",
"Other ranks":"members of the military who are not commissioned officers. (US: Enlisted ranks)",
"oughtn't":"A contraction of ought not (US shouldn't, ought not)",
"overdraft":"money used on a bank account making a debit balance; the amount of the debit balance, an 'overdraft facility' is permission from a bank to draw to a certain debit balance.",
"overleaf":"on the other side of the page (US: reverse)",
"owt":"anything. Northern English. \"Why aren't you saying owt?\" See also 'nowt' - as in the phrase \"can't get owt for nowt\" meaning \"can't get anything for nothing.\"",
"oy":"See \"oi\".",
"P45":"a form issued upon severance of employment stating an employee's tax code. (US: pink slip) The idiom to get your P45 is often used in Britain as a metonym for being fired or RIF'd. The alternate phrases to get your cards, or get your books are often used - dependent on region.",
"package holiday":"a holiday whose transport, accommodation, itinerary etc. is organised by a travel company (US and UK less frequently: package tour). Cf holiday",
"Page Three":"a feature found in some tabloid newspapers consisting of a large photograph of a topless female glamour models",
"Paki":"a Pakistani person; often loosely applied to anyone from South Asia, or of perceived South Asian origin. Now considered racist.",
"Paki shop":"a newsagents or general corner shop run by a person of Pakistani or other South Asian origin. No longer considered an acceptable term. Not to be confused with \"packie\", used in some areas of the US such as New England, short for \"package store\", meaning \"liquor store\". As with some other terms (cf. fanny pack), this is a case where innocent US use of a term may be unintentionally offensive in the UK.",
"panda car":"(informal) police car. Small police car used for transport, as opposed to a patrol or area car (analogous to US: black-and-white) Derives from a period in the 1970s when UK police cars resembled those of their US counterparts, only with blue replacing black.",
"paper round":"(the job of making) a regular series of newspaper deliveries (US: paper route)",
"paracetamol":"a common and widely available drug for the treatment of headaches, fever and other minor aches and pains (US: acetaminophen, Tylenol)",
"parkie":"(informal) park-keeper",
"parky":"(informal) cold, usually used in reference to the weather",
"pasty, Cornish pasty":"hard pastry case filled with meat and vegetables served as a main course, particularly in Cornwall and in the north of England",
"pear-shaped":"usually in the phrase \"to go pear-shaped\", meaning to go drastically or dramatically wrong (possibly from the idea of a ball deflating). cf tits-up",
"peeler":"in Northern Ireland, colloquial word for 'policeman' Similar to 'bobby', q.v.",
"pelican crossing":"pedestrian crossing with traffic lights operated by pedestrians (formed from Pedestrian Light-Controlled)",
"people mover or people carrier":"a minivan or other passenger van",
"pernickety":"fastidious, precise or over-precise (US: persnickety)",
"Perspex":"Trade name for Poly(methyl methacrylate) (PMMA), a transparent thermoplastic sometimes called \"acrylic glass\" (US: Plexiglass®; earlier form dated in the US)",
"petrol":"refined mixture of hydrocarbons, used esp. to fuel motor vehicles (short for petroleum spirit, or from French essence de pétrole) (US: gasoline, gas). Also variously known as motor spirit (old-fashioned), motor gasoline, mogas, aviation gasoline and avgas (the last two being a slightly heavier type designed for light aircraft)",
"petrolhead":"someone with a strong interest in cars (especially high performance cars) and motor racing (US: gearhead or motorhead).",
"phone box":"payphone, public phone. See also \"telephone kiosk\" (infra) (US: phone booth)",
"pikey":"a pejorative slang term, used originally to refer to Irish Travellers. Now refers to anyone whose lifestyle is characterised by itinerancy, theft, illicit land occupancy with destruction of amenities, and disregard for authority, without reference to ethnic or national origin.",
"pillar box":"box in the street for receiving outgoing mail, in Britain traditionally in the form of a free-standing red pillar; also called postbox or, less commonly, letter box (US: mailbox); See also Pillar box (film): an aspect ratio named for a supposed resemblance to the dimensions of the slot found on a pillar box.",
"pillar-box red":"the traditional bright red colour of a British pillar box (US: fire engine red or candy apple red)",
"pillock":"(slang, derogatory) foolish person, used esp. in northern England but also common elsewhere. Derived from the Northern English term pillicock, a dialect term for penis, although the connection is rarely made in general use.",
"pinch":"to steal.",
"pisshead":"(vulgar) someone who regularly gets heavily drunk (cf. BrE meaning of pissed).",
"pissing it down":"(slang, mildly vulgar) raining very hard (sometimes \"pissing down\" is used in the US, as in \"It's pissing down out there.\") Also \"pissing it down the drain\" or \"pissing it away\" meaning to waste something.",
"plait":"braid, as in hair",
"plasterboard":"Drywall",
"pleb":"(derogatory) person of lower class, from plebs; similar to townie. Also commonly used to mean idiot.",
"plectrum":"(US and UK: guitar pick)",
"plod":"policeman - from PC Plod in Enid Blyton's Noddy books.",
"plonk":"a disparaging term for cheap wine, especially cheap red wine, is now widely known in the UK and also to a lesser extent in the USA. Derives from French vin blanc and came into English use on the western front in World War I.",
"plonker":"(very mildly derogatory) fool . Used esp. in the south-east of England, although not unknown elsewhere (probably popularised in the rest of the UK by Only Fools and Horses). Derived from a slang term for penis, and sometimes used in this fashion, e.g. \"Are you pulling my plonker?\" (to express disbelief) (US var: \"Are you yanking my chain?\")",
"points":"(n.) mechanical crossover on a railway, (US: switch), hence the term \"points failure\" is a very common cause of delays on railways and the London Underground.",
"ponce":"(n.) (slang) someone with overly affected airs and graces; an effeminate posturing man; a pimp. Originates from Maltese slang. (related US: poncey); (v.) (slang) to act like a pimp; to cadge, to borrow with little or no intention of returning, often openly so (\"Can I ponce a ciggie off you, mate?\")",
"ponce about":"(v.) (slang) to act like a fop, to wander about aimlessly without achieving anything",
"ponce around":"(v.) (slang) to act like a fop, to wander about aimlessly without achieving anything",
"ponce off":"(v.) (slang) to mooch, to hit up, to leave in a pompous manner",
"pong":"(n.) (slang) a strong unpleasant smell; (v.) to give off a strong unpleasant smell; (adj.) pongy",
"poof, poofter":"(derogatory) a male homosexual (US equivalent: fag, faggot)",
"pouffe, poof, poove":"A small drum-shaped soft furnishing used as a foot rest (related US: hassock, Ottoman)",
"porky(ies)":"slang for a lie or lying, from rhyming slang \"pork pies\" = \"lies\"",
"postage and packing, P&P":"charge for said services (US: shipping and handling, S&H; the word postage is, however, used in both dialects)",
"postal order":"a money order designed to be sent through the post, issued by the UK Post Office (US: money order, or postal money order if the context is ambiguous)",
"postbox, post box":"box in the street for receiving outgoing mail (US: mailbox; drop box); see also letter box, pillar box",
"postcode":"alphanumeric code used to identify an address, part of a UK-wide scheme. (US equivalent: ZIP Code)",
"poste restante":"service whereby mail is retained at a post office for collection by the recipient (from French) (US: general delivery)",
"postie":"(informal) postman",
"pound shop":"(US: dollar store)",
"poxy":"(slang) something that is unsatisfactory or in generally bad condition.",
"prang":"(slang) to crash a motor vehicle with generally minor damage (US: fender bender)",
"pram, perambulator":"wheeled conveyance for babies (US: baby-carriage)",
"prat":"(slang) an incompetent or ineffectual person, a fool, an idiot",
"press-up":"a conditioning exercise in which one lies prone and then pushes oneself up by the arms (outside Britain: push-up)",
"pritt-stick":"glue stick, from the trademark of a common brand.",
"proper":"Real or very much something. \"He's a proper hero\" (US: \"He's a real hero\")",
"provisional licence, provisional driving licence":"a licence for a learner driver, who has not yet passed a driving test (US: learner's permit)",
"pub":"short for public house (US: bar)",
"publican":"the landlord of a public house.",
"pud":"(informal) short for \"pudding\", which may mean dessert or occasionally a savoury item such as Yorkshire pudding or black pudding; a fool (informal term usually used good-naturedly between family members). pulling his pud, means male masturbation.",
"pukka":"legitimate, the real thing, of good quality (usually Southeastern England term, recently more widely popularised by Jamie Oliver, but dating back to the 19th century). From Hindi-Urdu .",
"punch-up":"a fistfight",
"puncture":"(n.) A flat tire on a vehicle, as in \"I had a puncture on my bicycle\".",
"punnet":"small basket for fruit, usually strawberries",
"punter":"customer or user of services. Occasionally refers to a speculator, bettor, or gambler, or a customer of a prostitute.",
"pushbike":"(informal) bicycle (pre-dates modern safety bicycle q.v. velocipede)",
"pushchair":"forward-facing baby carriage (US: stroller)",
"quango":"quasi-autonomous non-governmental organisation. A semi-public (supposedly non-governmental) advisory or administrative body funded by the taxpayer, often having most of its members appointed by the government, and carrying out government policy.",
"quaver":"a musical note with the duration of one half-count in a time signature of 4/4 (US: eighth note). Also compound nouns semiquaver (US: sixteenth note), demisemiquaver (US: thirty-second note), hemidemisemiquaver (US: sixty-fourth note); see note value).",
"quids in":"(informal) a financially positive end to a transaction or venture \"After all that, we'll be quids in!\" (US: money ahead)",
"quieten":"used in the phrase \"quieten down\" (US: quiet down)",
"ranker":"an enlisted soldier or airman or (more rarely) a commissioned officer who has been promoted from enlisted status (\"the ranks\")",
"rashers":"cuts of bacon",
"rat-arsed":"(slang) extremely drunk (similar to US shit-faced)",
"recce":"(informal) reconnoître, reconnaissance (pronounced recky) (US: recon)",
"recorded delivery":"certified mail",
"Red top":"sensational tabloid newspaper",
"reel of cotton":"in the US is spool of thread",
"Register Office, Registry Office":"official office where births, marriages, civil partnerships and deaths are recorded; usu. refers to local Register Office (in each town or locality). General Register Office is the relevant government department. In England and Wales until 2001, almost all civil (non-church) marriages took place in the local Register Office; different laws apply in Scotland and N. Ireland. \"Register Office\" is the correct legal term, but \"registry office\" is in common informal use. (US: Office of Vital Statistics)",
"Release on Licence":"a term for parole in England and Wales",
"retail park":"an out-of-town shopping complex populated mainly by large format stores, one of which is typically a supermarket. (US: power center is roughly equivalent)",
"Return":"A ticket that is valid for travel to a destination and back. A round-trip ticket.",
"road-works":"upgrade or repairs of roads (US: construction; roadwork)",
"rock":"hard candy in cylindrical form often sold at holiday locations and made so that the location's name appears on the end even when broken. (US: no exact equivalent, but similar to a candy cane)",
"rodgering":"(vulgar) to engage in a sexual act, or suggest it. e.g.: \"I'd give her a good rodgering!\"",
"ropey":"(informal) chancy; of poor quality; uncertain (see dodgy). Can also mean unwell when used in the form to feel ropey",
"reverse charge call":"a telephone call for which the recipient pays (US and UK also: collect call); also v. to reverse charge , to make such a call (dated in US, used in the 1934 American film It Happened One Night – US usually: to call collect)",
"rota":"a roll call or roster of names, or round or rotation of duties",
"(the) rozzers":"(rare slang) Police (\"Quick, the rozzers! Scarper!\") – possibly from Robert Peel, who also gave his name to two other slang terms for the police: peelers (archaic) and bobbies (becoming old-fashioned).",
"rubbish":"worthless, unwanted material that is rejected or thrown out; debris; litter (US: trash, garbage)",
"rucksack":"a backpack.",
"rumpy pumpy":"sexual intercourse, used jokingly. (Popularised by its usage in The Black Adder and subsequent series; the suggestion of actor Alex Norton of a Scots term.)",
"sandwich cake or sandwich":"(US: layer cake)",
"sarky":"(informal) sarcastic (abbrev.) \"Why are you being so sarky?\" (US: snarky)",
"sarnie, sarny, sannie":"(informal) sandwich (abbrev.)",
"sat nav":"GPS, from satellite navigation",
"scouser":"a person from Liverpool, or the singular scouse to describe anything or anyone from either Liverpool or Merseyside.",
"screw":"a prison guard",
"scrubber":"a lower class, (usually young) woman of low morals",
"scrumpy":"cloudy cider, often high in alcoholic content",
"scrumping":"action of stealing apples from an orchard; also v. to scrump",
"self-raising flour":"self-rising flour",
"secateurs":"gardening tool for pruning plants (US:garden shears, pruners or clippers)",
"secondment":"(/sɪˈkɒndmənt/) the assignment of a person from his or her regular organisation to temporary assignment elsewhere. From v. second (/sɪˈkɒnd/)",
"selling-out shop":"A North English form of off-license (US liquor store)",
"Sellotape":"transparent adhesive tape, from the trademark Cellophane (US Scotch tape)",
"semibreve":"a musical note with the duration of four counts in a time signature of 4/4 (US: whole note; see Note value)",
"send to Coventry":"ostracize, shun (US: send to Siberia, vote off the island)",
"serviette":"(from French) table napkin. Regarded as a non-U word, but widely used by non-U people. Frequently encountered in Canada.",
"shafted":"broken beyond repair - can also be used to describe extreme exhaustion. Also cheated, ripped off: he got shafted",
"shandy":"a drink consisting of lager or beer mixed with a soft drink, originally ginger beer but now more usually lemonade, in near equal parts.",
"shanks's pony":"on foot, walking – as in \"The car's broken down, so it's shanks's pony I'm afraid\".",
"shan't":"A contraction of shall not, considered archaic in American English (US won't)",
"shite":"(vulgar) variant of shit",
"shopping trolley":"A cart supplied by a business for use by customers for transport of merchandise to the checkout counter during shopping. (US: shopping cart)",
"sixes and sevens":"crazy, muddled (usually in the phrase \"at sixes and sevens\"). From the London Livery Company order of precedence, in which position 6 is claimed by both the Worshipful Company of Merchant Taylors and the Worshipful Company of Skinners.",
"skew-whiff":"skewed, uneven, not straight",
"skint":"(informal) out of money (US: broke)",
"skirting board":"a wooden board covering the lowest part of an interior wall (US: baseboard)",
"slag off":"to badmouth; speak badly of someone, usually behind their back",
"slaphead":"(informal) bald man",
"slapper":"a promiscuous woman",
"sleeping partner":"a partner in business, often an investor, who is not visibly involved in running the enterprise (US: silent partner)",
"sleeping policeman":"mound built into a road to slow down vehicles (UK also: hump; US & UK also: speed bump)",
"slip road":"(US: entrance ramp/onramp or exit ramp/offramp)",
"slippy":"(slang) smooth, wet, with no friction or traction to grip something (US: slippery)",
"slowcoach":"(slang) a slow person (US: slowpoke)",
"smalls":"underclothing, underwear, particularly underpants",
"smart dress":"formal attire",
"smeghead":"(slang) idiot; a general term of abuse, from Red Dwarf.",
"snog":"(slang) a 'French kiss' or to kiss with tongues (US: deep kiss, not necessarily with tongues)",
"soap dodger":"one who is thought to lack personal hygiene",
"sod off":"(vulgar, moderately offensive) go away; get lost",
"spawny":"lucky",
"spiffing":"(informal) very good (old-fashioned, or consciously used as old-fashioned, associated stereotypically with upper-class people) (US: spiffy)",
"spiv":"a dealer in black market goods (during World War II). The term wide boy is also often used in the same sense",
"spliff":"(slang) a hand-rolled cigarette containing a mixture of marijuana and tobacco, also 'a joint.' (Also used in US, j or blunt more widely used)",
"spot on":"exactly (US: right on)",
"spotted dick":"an English steamed suet pudding containing dried fruit (usually currants) commonly served with custard.",
"squaddie":"(informal) a non-commissioned soldier (US: grunt)",
"squadron leader":"an Air Force officer rank (US: major)",
"squidgy":"(informal) soft and soggy (US: squishy)",
"squiffy":"(informal) intoxicated (popularly but probably erroneously said to be from British Prime Minister (Herbert) Asquith, a noted imbiber). The word can also be synonymous with skew-whiff.",
"squiz":"(rare) look, most often used in the form to have a squiz at...",
"stamp":"(slang) National Insurance payments (e.g.: I have not paid enough stamps to get my full state pension)",
"sticky-backed plastic":"large sheet of thin, soft, coloured plastic that is sticky on one side; generic term popularised by craft segments on the children's TV show Blue Peter (US similar: contact paper)",
"sticky wicket":"a difficult situation, originating from cricket",
"stockist":"a seller (as a retailer) that stocks merchandise of a particular type, usually a specified brand or model (US: dealer)",
"stone the crows":"exclamation of surprise (US holy cow, holy mother of pearl)",
"strop":"(informal) bad mood or temper",
"stroppy":"(informal) recalcitrant, in a bad mood or temper",
"sun cream":"sunscreen",
"suck it and see":"to undertake a course of action without knowing its full consequences (US: take your chances)",
"suss":"(informal) to figure out (from suspicion)",
"suspender belt":"a ladies' undergarment to hold up stockings (US: garter belt)",
"swot":"1. v. to study for an exam (US cram); 2. n. (derogatory) aloof and unpopular schoolchild or student who studies to excess",
"sweets":"the same term for candy in US",
"sweet FA":"(slang) nothing (from \"Sweet Fanny Adams\", alternative: \"Sweet Fuck All\"), \"I know sweet FA about cars!\" (US: jack shit)",
"swimming costume":"swimsuit or bathing suit; also cozzy for short.",
"ta":"(informal) thank you",
"Taff, Taffy":"nickname for a Welshman",
"takeaway":"food outlet where you can order food to go (or be delivered) (not usually applied to fast food chains). Usage: \"we had a takeaway for dinner\", \"we went to the local takeaway\".; (US: takeout)",
"take the piss":"(slang) to make fun of somebody or something; to act in a non-serious manner about something important. Can also mean to transgress beyond what are perceived as acceptable bounds, or to treat with perceived contempt",
"takings":"receipts of money",
"Tannoy":"loudspeaker (a proprietary brand name), public address system",
"tapping up":"in professional team sport, attempting to persuade a player contracted to one team to transfer to another team without the knowledge or permission of the player's current team (US: \"tampering\")",
"ta-ra!":"(informal, friendly) exclamation of farewell (similar to 'seeya!' and 'cheerio!' (above)). Originally from Merseyside (see Scouser, above)",
"telephone kiosk":"payphone, public phone. See also \"phone box\" (supra) (US: phone booth)",
"tea towel":"a cloth which is used to dry dishes, cutlery, etc., after they have been washed. (US: dish towel)",
"telerecording":"a recording of a live television broadcast made directly from a cathode ray tube onto motion picture film. The equivalent US term is kinescope.",
"telly":"(informal) television",
"tenner":"ten pound note",
"Territorial":"a member of the Territorial Army (US: Army Reserve)",
"tetchy":"irascible",
"the gods":"(informal) the highest level of seating in a theatre or auditorium, usually the \"Upper Circle\", as in \"we have a seat up in the gods\" (US: nosebleed section)",
"thickie":"person of low intelligence.",
"throw a wobbly":"(informal) to lose one's temper, throw a tantrum",
"thruppennies":"(rhyming slang) breasts/tits (from thrupenny bits, obsolete British coin)",
"tinned":"canned as in \"tinned soup\" or \"a tin of tuna\"",
"Tipp-Ex":"white tape or liquid used to make corrections of ink on paper (US: Wite-Out)",
"tipping down":"raining hard",
"titchy":"very small; tiny (from tich or titch a small person, from Little Tich, the stage name of Harry Relph (1867–1928), English actor noted for his small stature)",
"titfer":"(rhyming slang) hat (from tit-for-tat)",
"tits up":"(mildly vulgar) to suddenly go wrong (literally, to fall over. US: go belly up). cf pear-shaped (appears in the US mainly as military jargon, sometimes sanitized to \"tango uniform\")",
"toad-in-the-hole":"batter-baked sausages, sausages baked in Yorkshire Pudding",
"toff":"(slang) member of the upper classes",
"toffee apple":"a sugar-glazed apple on a stick eaten esp. on Guy Fawkes Night and Hallowe'en (US: caramel apple or candy apple)",
"toffee-nosed":"anti-social in a pretentious way, stuck up",
"Tommy Atkins, Tommy":"common term for a British soldier, particularly associated with World War I",
"tonk":"(informal) to hit hard, sometimes used in cricket to describe a substantial boundary shot: \"he tonked it for six\". In Southern England can also mean muscular. (US: ripped or buff).",
"tosspot":"(colloquial, archaic) a drunkard; also used in the sense of \"tosser\".",
"totty":"(informal, offensive to some) sexually alluring woman or women (more recently, also applied to males). Originally a term for a prostitute in the late 19th century.",
"Trading Standards":"local government departments responsible for enforcing laws regulating the conduct of businesses.",
"trainers":"training shoes, athletic shoes. (US: sneakers).",
"transit, transit van":"generic name for a full size panel van, based on the Ford vehicle of the same name, which in Britain dominates the market for such vehicles.",
"transport cafe":"roadside diner on a highway used primarily by truck drivers (US: truckstop)",
"truncheon":"a police officer's weapon (US: nightstick or billy)",
"tuppence":"two pence, also infantile euphemism for vagina. cf twopenn'orth",
"tuppenny-ha'penny":"cheap, substandard",
"turf accountant":"bookmaker for horse races (US and UK: bookie)",
"turn-indicator":"direction-indicator light on a vehicle (US: turn signal)",
"turning":"A place where you can turn off a road. Not generally used where the turn would take you onto a more major road or for a crossroads. (US: turn). \"drive past the post-office and you'll see a small turning to the right, which leads directly to our farm\"",
"turn-ups":"an arrangement at the bottom of trouser-legs whereby a deep hem is made, and the material is doubled-back to provide a trough around the external portion of the bottom of the leg. (US: cuffs)",
"twee":"excessively cute, quaint, or 'precious' (Similar to US cutesy)",
"twopenn'orth, tuppenn'orth, tup'en'oth":"one's opinion (tuppenn'orth is literally \"two pennies worth\" or \"two pence worth\", depending on usage); (US equivalent: two cents' worth, two cents). cf tuppence",
"uni":"short for university, used much like US college",
"up himself":"(informal) someone who is stand-offish, stuck-up, snobby. \"He's a bit up himself.\" Euphemistic variation of up his own arse. (US: snotty)",
"up sticks":"(US: pull up stakes)",
"veg":"shortened form of vegetable or vegetables.",
"verger (virger, in some churches)":"someone who carries the verge or other emblem of authority before a scholastic, legal, or religious dignitary in a procession; someone who takes care of the interior of a church and acts as an attendant during ceremonies.",
"verruca":"a wart which occurs on one's foot. (US: plantar wart)",
"WAG":"wives and girlfriends, typically in reference to the significant others of footballers (US soccer players).",
"wage packet":"weekly employee payment, usually cash (US paycheck)",
"wally":"(informal) a mild form of idiot or fool (US dummy)",
"wanker":"(offensive) a masturbator, used generally as a term of abuse in the fashion of the US jack off or jerk off.",
"WC":"a \"water closet\", a loo, a public or private toilet without a bath (US bathroom or restroom)",
"washing-up liquid":"liquid detergent used for washing dishes (US dishwashing detergent or liquid, dish soap)",
"wazzock":"an idiot, popularised (at least in Southern England) by the 1981 song \"Capstick Comes Home\" by Tony Capstick, originated and historically more common in Northern England",
"wellies":"Wellington boots, waterproof rubber boots named after the Duke of Wellington.",
"Wellingtons":"Wellington boots, waterproof rubber boots named after the Duke of Wellington.",
"welly":"(informal) effort (e.g.: \"Give it some welly\" to mean \"put a bit of effort into an attempt to do something\" US: elbow grease (also UK), oomph); also the singular of \"wellies\", for Wellington boots (US: gumboots, rubber boots)",
"What ho!":"(interj.) Hello! (warmly)",
"whilst":"A more restricted form of \"while\" which cannot be used as a noun, verb, or preposition. In the US, \"whilst\" is old-fashioned and pretentious to the point where it is now only appropriate for creating a dated effect, as in historical fiction.",
"whinge":"(informal) complain, whine, especially repeated complaining about minor things (e.g. \"Stop whingeing\" meaning \"stop complaining\"); cognate with whine, originated in Scottish and Northern English in the 12th century. Hence whinger (derogatory), someone who complains a lot.",
"whip-round":"an impromptu collection of money. (Uk and US: pass the hat round)",
"white coffee":"coffee with milk or cream.",
"white pudding":"oat and fat sausage often eaten at breakfast, common in Ireland and Scotland",
"wide boy":"see spiv, above",
"windbreaker":"a series of small connected screens designed to break the wind at the beach, staked into the sand by wooden poles usually with the aid of a rubber mallet",
"windscreen":"(US: windshield)",
"wing mirrors":"the external mirrors on a vehicle – though no longer normally attached to the 'wings' (US: fenders) but to the doors (US: sideview mirrors, side mirrors)",
"winkle":"(slang) childish term for a penis (US: winkie)",
"witter":"(informal) to continue to talk trivially about a subject long after the audience's interest has gone (assuming there was any interest in the first place). \"He wittered on.\"",
"wobbler, wobbly (to have or to throw)":"(informal) tantrum",
"write-off":"when cost of repair of a damaged asset (usually a car) is not feasible or exceeds its insurance value (US:total loss, totalled) Is also used formally in the context of accounting.",
"wog":"(offensive, term of abuse) member of an ethnic minority. The word can refer to a wide variety of non-Europeans, including Arabs, sub-Saharans (and those of sub-Saharan descent), Iranians, and Turks.",
"Y-fronts":"men's briefs with an inverted-Y-shaped frontal flap; originally a trademark (US: jockey shorts/briefs; US slang: tighty-whiteys)",
"yob":"lout, young troublemaker (origin: boy spelt backwards)",
"yobbo":"lout, young troublemaker (origin: boy spelt backwards)",
"yomp":"to move on foot across rough terrain carrying heavy amounts of equipment and supplies without mechanised support (Royal Marines slang popularised by the Falklands War of 1982, army equivalent is to tab). Also used informally for any walk across rough ground.",
"yonks":"a long time, ages. \"I've not seen her for yonks.\" (colloquial)",
"zed":"last letter of the alphabet, pronounced \"zee\" in United States",
"zebra crossing":"(US: crosswalk)",
"Zimmer":"a genericized trademark term for a walking frame, from the American firm Zimmer Holdings. (US, colloquially: walker)"
}