{
  "a&e": {
    "American English": "Arts & Entertainment (name of a television network)",
    "British English": "the accident and emergency (casualty) department of a hospital (US: emergency \nroom, ER)"
  },
  "aa": {
    "British English": "The Automobile Association (US: AAA)",
    "Common": "Alcoholics Anonymous"
  },
  "accumulator": {
    "British English": "rechargeable battery (technical)\n\na type of bet (US: parlay)",
    "Common": "one that accumulates, as a type of computer processor register or a hydraulic \naccumulator"
  },
  "ace": {
    "American English": "(v.) to perform outstandingly ; esp., to achieve an A (on a school exam)\n(n.) the best starting pitcher in a rotation on a baseball team",
    "British English": "good, excellent (informal)",
    "Common": "a one in a suit of playing cards\nsomeone who is very good at something\n(tennis) a winning serve in which the receiver does not touch the ball\nfighter pilot who has shot down at least 5 enemy aircraft"
  },
  "advert": {
    "British English": "(n.) a contraction of advertisement",
    "Common": "(v.) to turn the attention to or refer to something"
  },
  "advocate": {
    "British English": "Scottish also the Isle of Man, Channel Islands and South African lawyer who \nappears in higher courts (rest of UK: barrister)",
    "Common": "someone who supports or speaks for a particular position\ngeneric term for a lawyer\n(v.) to recommend or support"
  },
  "air marshal": {
    "British English": "a senior air force officer (equivalent to a USAF Lt. General)",
    "Common": "an undercover law enforcement officer on board a commercial aircraft, also \nknown as a sky marshal"
  },
  "à la mode": {
    "American English": "with ice cream (ex. Apple pie à la mode)",
    "Common": "fashionable"
  },
  "allotment": {
    "British English": "a parcel of land in a community garden",
    "Common": "the amount of something allocated to a particular person"
  },
  "alternate": {
    "American English": "(adj.) constituting an alternative, offering a choice (UK usu. & US also \nalternative) (\"use alternate routes\")\n\"alternative\", unconventional (\"alternate lifestyles\") \n\n(n.) an alternative ; a substitute",
    "Common": "(adj.) done or occurring by turns; every second, every other (\"on alternate \nweeks\")\n(n.) one that alternates with another"
  },
  "amber": {
    "British English": "orange-yellow traffic light (US: yellow light)",
    "Common": "orange-yellow colour\nfossilised resin\na material used in the construction of some tobacco pipes' stems\n\n(Amber) female given name\n(sealed in amber) state of being oblivious to changing circumstances"
  },
  "anchor": {
    "American English": "a type of radio or TV presenter (\"a news anchor\"). See news presenter for a \ndescription of the different roles of a newscaster, an American news \nanchor, and a British newsreader.\nA dowel or fastener, usually made of plastic, that enables a weight-bearing \nscrew to be attached to a wall (UK: wall plug; Rawlplug (trademark))",
    "Common": "a position in a tug of war team\ndevice for mooring ships by providing a firm fix to the seabed\n(anchorman/anchorwoman) the last member of a relay team to compete"
  },
  "anesthetist": {
    "American English": "a critical care experienced graduate level educated Registered Nurse who is \nnationally certified to induce anesthesia",
    "British English": "physician trained to induce anesthesia (US: anesthesiologist)",
    "Common": "someone who induces anesthesia."
  },
  "anorak": {
    "British English": "a parka\n(slang) a socially awkward person obsessively interested in something (syn. \nUS: geek, nerd; dweeb; etc.)",
    "Common": "hooded, rainproof outerwear that lacks a full-length zipper in the front \n(UK: cagoule)"
  },
  "anæsthetist": {
    "American English": "a critical care experienced graduate level educated Registered Nurse who is \nnationally certified to induce anesthesia",
    "British English": "physician trained to induce anesthesia (US: anesthesiologist)",
    "Common": "someone who induces anesthesia."
  },
  "apartment": {
    "American English": "usu. rented housing unit in a larger building (usu. flat in UK)– cf. s.v. \ncondominium",
    "British English": "suite of rooms set aside for a particular person (rare), usu. rented \nhousing unit in a larger building implying luxury (In other words, a \nnarrower definition than the US.) (Overlapping with the rare usage in \nreference to stately homes or historic properties which have been converted \ninto residential units.)"
  },
  "appropriate": {
    "American English": "to dispense (money), to budget",
    "British English": "to take (money) to oneself, to filch or misappropriate",
    "Common": "to take (money) (there is considerable overlap but difference of emphasis)"
  },
  "appropriation": {
    "American English": "to dispense (money), to budget",
    "British English": "to take (money) to oneself, to filch or misappropriate",
    "Common": "to take (money) (there is considerable overlap but difference of emphasis)"
  },
  "asian": {
    "American English": "originating from East Asia or continental Southeast Asia",
    "British English": "originating from India, Pakistan, Bangladesh or Sri Lanka (South Asian)",
    "Common": "originating from the continent of Asia"
  },
  "ass": {
    "American English": "(often vulgar) buttocks (UK: arse); also, by synecdoche, the person \n(\"your ass is dead\"); also (vulgar) anus (short for asshole)\n(vulgar) sex (\"get some ass\")\n(adv.) a postpositive intensive (i.e., to add emphasis to an adjective) \n(\"He drove a big-ass truck\")\nkick-ass: to beat up or beat, e.g. \"I am going to kick his ass\" or, more \npositively, something that beat (did better than) everything else, e.g. \n\"The opening band was kick-ass.\"\n(vulgar) someone acting inappropriately or offensively (\"That guy was an \nass!\")",
    "Common": "donkey\nslow-witted or stupid person, often in combination (dumb-ass)\nunpleasant or unthinking person (less common colloquially) (\"you ass\")"
  },
  "athletics": {
    "American English": "Athletic sports in general, (e.g. College athletics)",
    "British English": "Sport comprising the events in track and field, cross country running, road \nrunning and racewalking"
  },
  "attorney": {
    "American English": "(or attorney-at-law) a lawyer (UK: barrister (England, Northern \nIreland, Wales)/advocate (Scotland) or solicitor, depending on the \nactual profession)\n(District attorney, prosecuting attorney) local public official who \nrepresents the government in the prosecution of criminals (archaic in Br. \nEng. for lawyer)",
    "Common": "an agent or representative authorised to act on someone else's behalf \n(\"attorney-in-fact\", \"power of attorney\")\n(Attorney General) main legal advisor to the government"
  },
  "aubergine": {
    "British English": "the plant Solanum melongena, or the fruit thereof (US: eggplant)",
    "Common": "an aubergine-like colour (US also: eggplant)"
  },
  "backside": {
    "American English": "(as two words, back side) rear of anything",
    "Common": "posterior, buttocks"
  },
  "bang(s)": {
    "American English": "locks of hair on forehead (UK: fringe)",
    "Common": "small explosions or reports;\n(v.) have sexual intercourse with (vulgar slang)"
  },
  "banger": {
    "American English": "a particularly club-friendly beat or song\na gang member (gang-banger)",
    "British English": "a sausage, as in \"bangers and mash\"\nan old motorcar in a state of disrepair (US: beater or jalopy)",
    "Common": "a type of firework"
  },
  "banker": {
    "British English": "a railway locomotive that temporarily assists the train hauled by another \nup a gradient (US: helper)",
    "Common": "one who works in a bank"
  },
  "base": {
    "American English": "in baseball, one of the three places a runner can stand in safety; hence in \nmany fig. senses, off one's base (crazy), to get to first base (esp. in \nneg. constr., to get a first important result); more recently (slang), a \nmetaphor for one of three different stages in making out (q.v.) – see baseball \nmetaphors for sex; more s.v. home run",
    "Common": "foundation, starting point; many meanings in sciences, architecture, \npolitics, military installation, etc.; see base"
  },
  "bash": {
    "British English": "Have a go – to try to achieve something, as in \"have a bash at this \ncrossword",
    "Common": "to strike physically\nto attack verbally\na party or celebration \"they're having a little bash this weekend\" (orig. \nUS, but now probably more common in UK than US)"
  },
  "bath": {
    "American English": "(n.) a bathroom (esp. a half bath which has a sink and toilet but no \nshower stall or bathtub, or a 3/4 bath which has a sink, toilet, and \nshower stall, but no bathtub)",
    "British English": "(pl.) swimming pool\n(v.) to bathe, or give a bath to, example have a bath (US: take a bath \nmeaning bathe)",
    "Common": "(n.) plumbing fixture for bathing (US: bathtub)\n(n.) the act of bathing"
  },
  "bathroom": {
    "American English": "room, in a home or hotel room, containing a toilet, related washing \nfacilities, and often, but not necessarily, a shower or bathtub (Hence \n\"Going to the bathroom\" is a euphemism for going to the toilet even in a \nsetting where one would not expect to find a bath, e.g. a restaurant or \nshop ) (a room without shower or bathtub may also be known as a powder \nroom, but this usage may be considered dated)",
    "British English": "room containing a bath (US: bathtub) or shower, other washing facilities, \nand usu. (but not necessarily) a toilet"
  },
  "beaker": {
    "British English": "drinking vessel without a handle, or one (with or without handles) made of \nunbreakable plastic for the use of children (US: sippy cup)",
    "Common": "flat-bottomed vessel, with a lip, used as a laboratory container."
  },
  "beater": {
    "American English": "used car or bicycle in very poor condition (UK: banger)\n(slang) wifebeater (q.v.)\na sleeveless undershirt (from the stereotype that poor men who wear them \nbeat their wives, perhaps from Jackie Gleason in \"The Honeymooners\" TV \nseries (50s/60s U.S.) or more likely from the costume of the character Stanley \nKowalski in the play \"A Streetcar Named Desire\") (UK: vest)",
    "Common": "person who flushes game from concealment so it can be shot at by 'the guns'\nsomething or someone that beats"
  },
  "beaver": {
    "American English": "female vagina (slang)",
    "British English": "beard; a bearded man (archaic slang)",
    "Common": "aquatic rodent known for building dams\nwoman's undepilated external genitalia (obscene slang)"
  },
  "bender": {
    "American English": "A period of extensive drug use: \"He went on a 3 week heroin bender",
    "British English": "derogatory expression for a gay man, referring to the act of bending over \nto permit buggery.",
    "Common": "an expression for a binge drinking spree, referring to the act of bending \nover to vomit."
  },
  "bespoke": {
    "British English": "(esp. of apparel) made to the customer's specification (US: custom-made, \ntailor-made)",
    "Common": "pret. of bespeak"
  },
  "bill": {
    "American English": "a piece of paper money (UK: note/banknote)",
    "British English": "The bill=the police (slang, poss. from Old Bill)",
    "Common": "invoice; request for payment (also US: check, tab)\na proposed law before it is voted on by a legislature"
  },
  "billion": {
    "American English": 109,
    "British English": "(traditionally) a million millions (1012) (US: trillion)",
    "Common": "thousand million (109) (now most common in both UK and US) (traditional UK: \nmilliard) (see also Long and short scales)"
  },
  "bin": {
    "British English": "(v.) to throw away.\n(bread bin) container for storing bread (US: breadbox)",
    "Common": "(1) a waste container (2) a usu. large receptacle or container for storage \n(\"a grain bin\"; \"Scrooge McDuck's money bin\")"
  },
  "bird": {
    "American English": "insulting hand gesture involving shaking one's fist towards someone with \nknuckles pointing towards the person being insulted and the middle finger \nextended (used chiefly in \"flipping someone the bird\") (slang)",
    "British English": "one's girlfriend or any young female (slang; getting rarer and \nconsidered derogatory by some)\nprison sentence (slang)",
    "Common": "an animal with feathers\nan aircraft (aviation slang)"
  },
  "biscuit": {
    "American English": "type of quick bread served with savory foods (UK: similar to a savoury \nscone, or similar in consistency to a croissant)",
    "British English": "baked sweet or savoury cake-like item, usu. flat, which is hard when baked \nand softens over time (colloquially bikkies for sweet biscuits) (US: \ncookie (sweet biscuit), cracker savoury biscuit)\n(to take the biscuit) to be very surprising (US: take the cake)",
    "Common": "a piece of wood used in joinery to join two larger pieces together"
  },
  "blinder": {
    "American English": "either of two flaps on a horse's bridle to keep it from seeing objects at \nits sides (UK: blinker, also used in US) \n\n(wear blinders) (colloq.) state of being oblivious, unresponsive to \nchanging circumstances. Myopic, tunnel vision.",
    "British English": "excellent performance in a game or race (slang) \"e.g. he played a blinder"
  },
  "blinkers": {
    "American English": "lights on a car that indicate the direction about to be taken (UK: \nindicators)",
    "British English": "leather flaps on a bridle used to restrict a horse's lateral vision(US \nusu.: blinders)"
  },
  "block": {
    "American English": "in a city, the portion of a street between adjacent intersections or an \ninformal rough unit of distance derived from the length of the same. The \nusage to mean a single large building was common in the Western U.S. until \nthe early 20th century.",
    "British English": "a building (block of flats, office block)",
    "Common": "a solid piece of something\nto obstruct\n(basketball) a blocked shot, or (plural) in the low post position near the \nbasket, as in \"on the blocks"
  },
  "bloody": {
    "American English": "considered a euphemism for more emphatic swear words",
    "British English": "expletive attributive used to express anger (\"bloody car\") or shock \n(\"bloody hell\"), or for emphasis (\"not bloody likely\") (slang, today only \nmildly vulgar) (similar US: damn (\"damn car\"))",
    "Common": "having, covered with or accompanied by blood"
  },
  "blow off": {
    "American English": "to fail to turn up to meet somebody, to disavow or fail to meet an \nobligation (UK: blow out) (\"I'm just too busy, I'll have to blow you off \nfor this evening.\")",
    "British English": "to break wind",
    "Common": "to perform oral sex upon"
  },
  "bog": {
    "American English": "A plot of artificially floodable farmland used to grow cranberries\n(a cranberry bog)",
    "British English": "toilet (slightly vulgar slang)\n(bog off) go away (slightly vulgar slang, often jocular)",
    "Common": "wetland that accumulates appreciable peat deposits"
  },
  "bogey": {
    "American English": "an unidentified aircraft, often assumed to be that of an enemy\n\nalternate spelling of \"Bogie\" (nickname of Humphrey Bogart)",
    "British English": "dried nasal mucus usu. after extraction from the nose (US: booger) \n(informal)",
    "Common": "the score of one over par in golf"
  },
  "boiler": {
    "American English": "A car (1930s slang)",
    "British English": "1. an old fowl best cooked by boiling;\n 2. (derogatory) an ugly woman (usually in the phrase \"old boiler\")",
    "Common": "1. device (usu. oil or gas-fired) for heating water for central heating \n or hot water , \"central heating boiler\" (US furnace);\n 2. vessel in which steam is generated<"
  },
  "bomb": {
    "American English": "(v.) to be a failure (\"the show bombed\"); also as n.\n(n., used with the) something outstanding (\"that show was the bomb\"); \nsometimes spelled da bomb",
    "British English": "a striking success; used in the phrases \"go (like) a bomb\" and \"go down a \nbomb\"; Go like a bomb also means, when used of a vehicle, to go very fast",
    "Common": "an explosive weapon"
  },
  "bombardier": {
    "American English": "crew member of a bomber responsible for assisting the navigator in guiding \nthe plane to a bombing target and releasing the aircraft's bomb load – see Bombardier \n(air force) (UK: bomb aimer)",
    "British English": "corporal in the Royal Artillery – see Bombardier (rank)"
  },
  "bonk": {
    "British English": "act of sexual intercourse, or to have sexual intercourse (slightly vulgar \nslang) (US: boink)",
    "Common": "blow to the head\n(n. and v.) to suffer glycogen depletion in an endurance sporting event; \nsee hitting the wall"
  },
  "bonnet": {
    "British English": "hinged cover over the engine in a car (US: hood)",
    "Common": "hat tied under chin worn by a baby or (archaically) a woman"
  },
  "boob": {
    "American English": "stupid person",
    "British English": "a mistake (slang); (v.) to make a mistake (US: blooper)",
    "Common": "woman's breast (slightly vulgar slang)"
  },
  "boob tube": {
    "American English": "(the boob tube) television (slang)",
    "British English": "woman's shoulderless, strapless top (US: tube top)"
  },
  "boost": {
    "American English": "to (literally) lift up, especially a person: booster cushion, a cushion \nused to increase the height of a seat (esp. in a car)\nto steal, especially from a retail establishment (i.e., shoplift)",
    "Common": "to (figuratively) lift up; to improve, increase, revitalize."
  },
  "boot": {
    "American English": "(Denver boot, car boot) device used to render cars immobile (UK: wheel \nclamp)\nto expel (UK: give someone the boot )(\"I have been given the Order of \nthe Boot\", Winston Churchill)\nto vomit (slang)\nto shoot up (with intravenous drugs) (ex: to boot cocaine or heroin; slang)",
    "British English": "storage compartment of a car (US: trunk)",
    "Common": "footwear covering lower leg\nto kick something hard\nto start up a computer"
  },
  "booty": {
    "American English": "(Black American slang, but widely appropriated elsewhere), esp. female \nbuttocks as in \"Shake that booty\"\n(booty call) invitation to a sexual encounter (slang)",
    "Common": "treasure or the proceeds of looting"
  },
  "boss": {
    "American English": "cool, totally awesome (slang) e.g. \"That is a boss Zefron poster",
    "Common": "the person you report to at work"
  },
  "bottle": {
    "British English": "courage (\"he's got some bottle\") (slang) (US: moxie)\nto fail to do something through fear (\"he's bottled out\", \"he bottled it\") \n(slang)\nto attack somebody with a broken bottle (slang)",
    "Common": "container for liquids\n(the bottle) alcohol, heavy drinking (synecdochical slang)"
  },
  "box": {
    "American English": "any of various areas on a baseball diamond (as for the batter, or the \npitcher, the catcher, etc.)\nfemale genitalia (obscene slang) \n(box canyon) a canyon with vertical walls\n(boxcar) a type of enclosed railroad freight car (UK: goods van)\na three-ball \"frame\" for one player in candlepin bowling (New England)\nthe genital area (ex: kicked in the box; vulgar slang)",
    "British English": "a gift in a box, hence Boxing Day\ngenital protector used in cricket (US similar: protective cup)\n(the box) television set (slang) (US: idiot box, boob tube)\na box stall in a barn\nany of various box-like structures, such as:\nsignal box (US: switch/signal/interlocking tower)\ntelephone box (US & UK also: telephone booth), more at call box\nwitness box (US: witness stand)\neither one of the two marked areas adjacent to the goalmouth on an association \nfootball pitch (see here)\nsee also box junction",
    "Common": "(n.) rigid container\n(v.) to attack using one's fists\n(n.) general-purpose computer (e. g. \"this box needs its hard disk \nre-formatted\")"
  },
  "brace": {
    "American English": "leg supports (UK: callipers)\ntertiary enclosing punctuation: { } (UK: curly brackets)",
    "British English": "over-the-shoulder straps to support trousers (US usu. suspenders, q.v.)",
    "Common": "support that steadies or strengthens something else \n\ndevices for straightening teeth\na pair or couple of something, typically game birds or animals"
  },
  "bracers": {
    "American English": "leg supports (UK: callipers)\ntertiary enclosing punctuation: { } (UK: curly brackets)",
    "British English": "over-the-shoulder straps to support trousers (US usu. suspenders, q.v.)",
    "Common": "support that steadies or strengthens something else \n\ndevices for straightening teeth\na pair or couple of something, typically game birds or animals"
  },
  "braces": {
    "American English": "leg supports (UK: callipers)\ntertiary enclosing punctuation: { } (UK: curly brackets)",
    "British English": "over-the-shoulder straps to support trousers (US usu. suspenders, q.v.)",
    "Common": "support that steadies or strengthens something else \n\ndevices for straightening teeth\na pair or couple of something, typically game birds or animals"
  },
  "brackets": {
    "American English": "secondary enclosing punctuation: (UK: square brackets)",
    "British English": "enclosing punctuation: ( ) (US & UK also: parentheses); more at braces",
    "Common": "supports for shelves, etc. attached to a wall"
  },
  "brew": {
    "American English": "beer \n\ncoffee",
    "Common": "tea"
  },
  "brilliant": {
    "British English": "excellent, of the highest quality (rarely sarcastic)",
    "Common": "very bright (of a light or a brain)\nvery intelligent"
  },
  "bud": {
    "American English": "marijuana (slang)\nhand-rolled marijuana cigarette (slang), compare joint\nshortening of 'buddy', used to address strangers assuming a non-existent \nfamiliarity (UK: similar: mate)",
    "Common": "undeveloped shoot which normally occurs in the axil of a leaf or at the tip \nof a plant stem"
  },
  "buffet": {
    "American English": "a type of sideboard",
    "British English": "railway carriage containing a refreshment counter selling snacks and \ndrinks, esp. on a train on which a full restaurant car (US: dining car) \nservice is not provided",
    "Common": "refreshment counter or bar;\n\na meal set out on a table, etc. for diners to serve themselves"
  },
  "bug": {
    "American English": "any of various insects (nontechnical usage)\nan important person (\"a big bug\"); also, someone crazy (as in \"firebug\", a \npyromaniac)\nto go away, depart, also from a responsibility (used with out)\n(bug off) to go away (often as a command) (from UK bugger, q.v.)",
    "Common": "insect of the order Hemiptera\npathogen, bacteria, germ\ncovert listening device (orig. US)\ndefect in software (orig. in a machine) (orig. US)\nan enthusiast of something (orig. US)\nVolkswagen Beetle\n(v.) to apply a covert listening device (orig. US)\n(v.) to annoy (colloquial)"
  },
  "bugger": {
    "American English": "term of endearment, often used for children (slang)",
    "British English": "(buggered) 1. broken, not working (typically of mechanical devices, e.g. \n\"the engine's buggered\") (slang); 2. syn. for bothered (e.g. \"I didn't do \nit. I couldn't be buggered.\") (slang)\n(bugger up) to make a mess of something (slang)\n(bugger off) (imperative) go away, leave me alone (slang)",
    "Common": "(usually vulgar) to engage in, or someone who engages in, anal sex\n\na form of address for either a person or item, either jocular (\"he's a \ngenerous bugger\", \"I finally found the little bugger!\") or less so (\"he's a \nmean bugger\") (slang)"
  },
  "buggy": {
    "American English": "4-wheeled horse-drawn lightweight carriage\nbaby transport vehicle also called (US) baby carriage (UK: pram)\nregional (esp. South) for shopping cart (UK: trolley)\n(marsh/swamp buggy) a type of motor vehicle for marshland\n(slang) caboose\n(horse and buggy) something obsolete (as from before the invention of the \nautomobile)",
    "British English": "2-wheeled horse-drawn lightweight carriage\nbaby transport vehicle also called (UK) pushchair (US: stroller)\nany of various light cart or cars (\"a golf buggy\")",
    "Common": "(slang) an automobile (orig. US)\nsee baby transport for details\nsee also dune buggy"
  },
  "bum": {
    "American English": "hobo, homeless person\npoor quality (slang)\nto sadden (often used with \"out\")",
    "British English": "a person's bottom (buttocks) ISBN 0198604521> \n\nto engage in anal sex (vulgar slang)",
    "Common": "(1)to cadge (\"can I bum a cigarette off you?\") (slang) \n\n(2) buttocks (slang) (US: butt)"
  },
  "bumps": {
    "British English": "a type of rowing race\na method of marking someone's birthday (see Birthday customs and \ncelebrations)",
    "Common": "a set of small protuberances"
  },
  "bunk": {
    "American English": "group of plain beds used as no-frills lodging (UK: dormitory, q.v.); also \nused as a verb (\"I bunked with them in their room\"; \"The cabin could bunk \nabout 18\")",
    "British English": "to be absent without authorization:\n\nbunk off, to play truant from school (US: play hooky)\ndo a bunk, to abscond (US: go on the lam)",
    "Common": "type of bed, where two small beds are stacked on top of each other (UK bunk \n(up) with implies sharing a bed, rather than merely a room)\nnonsense as in \"History is bunk\" (from bunkum)"
  },
  "bureau": {
    "American English": "a type of chest of drawers",
    "British English": "a type of writing table",
    "Common": "a public office or government agency"
  },
  "burn": {
    "American English": "(n.) clearing (as in a forest) made by burning vegetation",
    "British English": "(Scotland and Northern England) narrow river, stream – more s.v. creek",
    "Common": "wound caused by heat, or chemical agents, etc."
  },
  "bus": {
    "American English": "to clear (as tables) in a restaurant; to work as a busboy",
    "Common": "to travel by bus\na system for carrying computer signals"
  },
  "butcher": {
    "American English": "to make a big mess of things; botch (\"butcher it up\"; \"I butchered the \nspelling\")",
    "British English": "(have a butcher's) to have a look (rhyming slang: butcher's hook=look)",
    "Common": "to kill and cut up an animal for meat\nto kill messily, or someone who does so\none who cuts and sells meat"
  },
  "butchery": {
    "American English": "a botch",
    "British English": "slaughterhouse, abattoir",
    "Common": "a cruel massacre\na butcher's trade"
  },
  "butt": {
    "American English": "(colloquial) buttocks (UK usu. bum); hence butthead \n(n.) (butt-in) one who butts in\n(v.) to cut off the end (of a log)\n(butt out) to stop interfering",
    "Common": "(n.) the (larger) end of anything, a stub; also, a cigarette\na sudden blow given by the head of an animal\na large wooden cask\na person mocked by a joke\n(v.) to strike bluntly (as with the head)\n(butt in) to interfere when uncalled for (orig. US)"
  },
  "buzzard": {
    "American English": "vulture (slang)",
    "British English": "a hawk of the genus Buteo"
  },
  "call for": {
    "American English": "to predict or anticipate (\"The forecast calls for rain\")",
    "Common": "to require or advocate"
  },
  "calipers": {
    "British English": "(n.) A metal support for a person's leg and/or ankle. (US: ankle braces, leg braces)",
    "Common": "(n.) An instrument for measuring external or internal dimensions, having two hinged legs resembling a pair of compasses and in-turned or out-turned points."
  },
  "callbox": {
    "American English": "roadside emergency telephone",
    "British English": "telephone booth (UK also telephone box)"
  },
  "campsite": {
    "American English": "spot for a particular person or group to camp, often within a campground \n(UK: pitch)",
    "British English": "area or park for people to camp in (US: campground)"
  },
  "can": {
    "American English": "(v.) to fire someone from a job (UK: sack)\n(n.) toilet (slang), jail\n(n.) buttocks",
    "Common": "(n.) small metal container\n(v.) to place in such a container\n(modal v.) to be able to"
  },
  "candy": {
    "American English": "(eye candy) (derog.) someone who is physically attractive (See also arm \ncandy.)",
    "British English": "(candy floss) heated sugar spun into thin threads and collected into a \nmass, usually on a stick; something pleasing but having little worth (US: cotton \ncandy for both senses)",
    "Common": "(v.) to sugarcoat, or boil with sugar (as fruit)\nto sweeten \n\nedible, sweet-tasting confection containing sugar, or sometimes artificial \nsweeteners, and often flavored with fruit, chocolate, nuts or artificial \nflavours; a piece of candy (UK: sweets, confectionery)"
  },
  "canfield": {
    "American English": "a patience (solitaire) card game (UK: Demon)",
    "British English": "a patience (solitaire) card game (US: Klondike)"
  },
  "canteen": {
    "British English": "basic food service location usually at a work place or institution (US: \ncafeteria)",
    "Common": "a box with compartments for storing eating utensils, silverware etc.\na military mess kit\nwater bottle, typically used for military or camping purposes."
  },
  "car": {
    "American English": "nonpowered unit in a railroad or railway train (\"railroad car\"; \"a \npassenger/freight/parlor/dining/baggage etc. car\") (see s.v. motor car, \ntrolley; UK: cf. s.v. carriage, coach, wagon)\nelevator (q.v.) cage",
    "British English": "railway vehicle, only in combination (e.g. \"restaurant car\", except London \nUnderground \"carriage\")\n\n(archaic) street tramway vehicle",
    "Common": "motorcar (n.) (UK, q.v.)/automobile"
  },
  "caravan": {
    "American English": "a type of minivan sold in the United States (see Dodge Caravan)",
    "British English": "towed recreational vehicle containing accommodation (US: travel trailer)\nto take such a vehicle on holiday",
    "Common": "overland trading convoy"
  },
  "caretaker": {
    "American English": "one who takes care of real estate in exchange for rent-free living \naccommodations ",
    "British English": "one who takes care of a building, usu. a state-owned building, i.e. school \n(US: janitor; cf. s.v. custodian)\none put in charge of a farm after eviction of tenant",
    "Common": "one who takes care of someone or something\nstopgap government or provisional government"
  },
  "carnival": {
    "American English": "(n.) a travelling circus or fair (UK: funfair) comprising amusement rides",
    "British English": "(n.) the festive days just preceding Lent (US: Mardi Gras)",
    "Common": "(adj.) suggesting a festive atmosphere"
  },
  "carousel": {
    "American English": "a rotating fairground ride (UK: merry-go-round, roundabout)",
    "Common": "a moving luggage/baggage display unit, most often at airports"
  },
  "carriage": {
    "American English": "(baby carriage) baby transport vehicle featuring the infant lying down \nfacing the pusher (UK: perambulator, pram) – more s.v. buggy\na shopping cart (primarily in North Atlantic states)",
    "British English": "railway coach (q.v.) designed for the conveyance of passengers\nthe conveying of goods or the price paid for it (\"carriage-paid\"); \n\"handling",
    "Common": "4-wheeled horse-drawn private passenger vehicle"
  },
  "carry on": {
    "American English": "luggage that can be carried aboard an aircraft, bus, or train (UK: hand \nluggage or baggage)",
    "British English": "(informal) have a love affair",
    "Common": "(colloquial) carrying-on, unruly behaviour\n(v.) continue (Keep Calm and Carry On)"
  },
  "carryon": {
    "American English": "luggage that can be carried aboard an aircraft, bus, or train (UK: hand \nluggage or baggage)",
    "British English": "(informal) have a love affair",
    "Common": "(colloquial) carrying-on, unruly behaviour\n(v.) continue (Keep Calm and Carry On)"
  },
  "cart": {
    "American English": "a lightweight wheeled vehicle, as for shopping, serving, carrying baggage, \netc. (UK: trolley)\ncartridge (primarily related to video games)",
    "Common": "usu. 2-wheeled one-horse vehicle (as that used in farming)"
  },
  "casket": {
    "American English": "The type of coffin with upholstery and a half-open lid, any coffin",
    "British English": "a small box, as for jewels, particularly an antique"
  },
  "casualty": {
    "American English": "often, someone who has been killed; see also casualty insurance",
    "British English": "often, someone who has been wounded; hence casualty department (US: emergency \nroom)",
    "Common": "generally, someone who has been injured or killed"
  },
  "catapult": {
    "American English": "(v.) rise quickly",
    "British English": "small Y-shaped handheld projectile weapon often used by children (US: \nslingshot)",
    "Common": "a type of medieval siege engine\nan aircraft catapult"
  },
  "chaps": {
    "American English": "leather leggings originally worn by cowboys and designed to protect the \nlegs against thorns (sometimes pronounced shaps), short for \"chaparajos\", \nor the similar items worn by motorcyclists as a form of leg protection",
    "British English": "men or boys (but increasingly used for people of either sex; in the \nsingular it still almost exclusively refers to a male, \"Guys\" has become a \nmore popular phrase in the UK) (US & UK: guys)\none's friends (\"the chaps\") (US & UK: the guys)\ncheeks – as in Bath Chaps – stewed pigs' cheeks, a delicacy"
  },
  "check": {
    "American English": "leave items in the care of someone else (e.g. at a cloakroom; hence \ncheckroom)\n(also check mark) mark used to denote 'correct' or indicate one's choice \n(UK: tick, q.v.)\nrequest for payment, especially at a restaurant; bill\nwritten order for a bank to pay money (UK: cheque)",
    "Common": "examine for a particular purpose\na pattern of coloured squares\na warning given in chess"
  },
  "checker": {
    "American English": "a store or shop cashier (almost always a grocery store)\n(checkers) a popular board game (UK: draughts)\nto mark with alternating colored squares (UK: chequer)",
    "Common": "one who checks (e.g. an inspector)"
  },
  "cheers": {
    "British English": "said to express gratitude in England, or on parting (slang). Also cheerio.",
    "Common": "used as a toast or valediction"
  },
  "chemist": {
    "British English": "pharmacist, pharmacy (US similar: druggist, drugstore)",
    "Common": "student or researcher of chemistry"
  },
  "chew": {
    "American English": "referring to or using chewing tobacco",
    "British English": "a chewy sweet (US: taffy)",
    "Common": "to break down food with the teeth, masticate\n(chew on something, chew something over) (colloquial) to consider or \ndiscuss"
  },
  "chip in": {
    "British English": "to express one's opinion (as in a conversation); to \"chime in",
    "Common": "to contribute (as money) (orig. US)"
  },
  "chippie": {
    "American English": "loose woman (dated slang);\nthe N. American bird Chipping sparrow",
    "British English": "carpenter (slang);\nfish-and-chip shop (slang) (Scot, Ire: chipper)",
    "Common": "(adj.; chippy only) aggressively belligerent, especially in sport"
  },
  "chippy": {
    "American English": "loose woman (dated slang);\nthe N. American bird Chipping sparrow",
    "British English": "carpenter (slang);\nfish-and-chip shop (slang) (Scot, Ire: chipper)",
    "Common": "(adj.; chippy only) aggressively belligerent, especially in sport"
  },
  "chips": {
    "American English": "thin slices of fried potato(UK: crisps)",
    "British English": "Long cuts of deep fried potato, usu. thick cut resembling American steak \nfries",
    "Common": "French fries, in (orig. UK) phrase fish and chips"
  },
  "chum": {
    "American English": "(n.) waste products from fish processing (heads, tails, blood etc.) often \nused for shark fishing\n\n(v.) to spread fish entrails etc. in the hope of luring sharks. \"We chummed \nthe water all morning, but never spotted any dorsal fins.\" Has some \ncross-over usage metaphorically in non-fishing situations.",
    "Common": "friend (sometimes sarcastic)"
  },
  "cider": {
    "American English": "unfiltered, unpasteurized, unfermented apple juice",
    "British English": "an alcoholic drink derived from apples (US: hard cider)"
  },
  "cinderella": {
    "American English": "a lowly sports team or individual which enjoys an unexpectedly good run in \na tournament",
    "British English": "a team which underachieves, or is overshadowed by successful neighbouring \nrivals",
    "Common": "fairy tale character"
  },
  "city": {
    "American English": "a usually large or important municipality governed under a charter granted \nby the state (however some smaller towns in the US are cities); an element \nof a standard mailing address (UK \"postal town\")",
    "British English": "a large town, in particular a town created a city by charter and containing \na cathedral\n\"The City\": the City of London, London's financial centre, hence financial \nmarkets and investment banking more generally (c.f. US Wall Street)"
  },
  "clerk": {
    "American English": "(or salesclerk) store or shop worker (UK: shop assistant)\nhotel employee at the reservation desk (US & UK: receptionist)",
    "Common": "administrative worker"
  },
  "closet": {
    "American English": "a cabinet or wardrobe, as for utensils or apparel; in the latter case \noftenest built-in; hence e.g. walk-in closet, linen closet, and skeleton \nin the closet (UK also: in the cupboard) ",
    "British English": "any small room (esp. Northern England, Scotland, & Ireland); hence water \ncloset, a room containing a flush toilet, later the toilet itself",
    "Common": "a private chamber for retirement\nin secret; (come out of the closet) to reveal what was secret (especially \nin relation to homosexuality)\n(closet queen) (colloq., disparaging) someone who keeps their \nhomosexuality secret"
  },
  "coach": {
    "American English": "extracurricular sports teacher at a school (UK: PE teacher)\nlowest class on a passenger aircraft (UK: economy)",
    "British English": "bus with of higher standard of comfort, usually chartered or used for \nlonger journeys\ntutor, usu. private, who prepares pupils for examinations \nrailway carriage ",
    "Common": "enclosed horse-drawn passenger carriage\nsports trainer"
  },
  "cob": {
    "British English": "(mainly Northern & Central Eng.) a type of bread roll (\"Chip cob\", \"ham \ncob\", \"pack of six cobs please\")\n(pl.) large globules of sweat (\"I'm sweating cobs\")",
    "Common": "The portion of a corn plant around which the kernels grow.\na building material\na type of horse\na male swan"
  },
  "cock": {
    "British English": "(n.) form of address to a man to gain attention or greet e.g. \"Wotcha cock!\"\na popular personage e.g. Cock o' the North\n(v.) (cock up) to make a mess of things; cock-up (n.) is the act or \nthe resulting state of affairs",
    "Common": "(n.) a male bird; esp., an adult male chicken (US oftenest rooster)\n(n.) penis (vulgar slang)\n(v.) to set the hammer or firing pin of a loaded firearm ready for firing; \nlikewise, to \"cock the shutter\" of an old, spring-activated camera\n(n.) A type of tap, faucet, or valve (e.g., a stopcock)."
  },
  "collect": {
    "American English": "(adj., adv.) charged to the receiver (\"to call collect\", to reverse the \ncharges) (\"a collect call\")",
    "British English": "To win a bet (from the idea of picking up the winnings)",
    "Common": "(v.) to gather together, to pick up; (orig. US) to pick up a person or thing\n(n.) short prayer read during the first part of a church service as \npractised by certain parts of the Christian faith; mainly Anglican and Roman \nCatholic."
  },
  "college": {
    "American English": "professional association which usu. grants some form of professional \nqualifications, mostly in the medical field (e.g. Royal College of Surgeons, \nAmerican College of Surgeons) \n\nan independent institution of higher education (as a small university or a \ndivision of a university) granting bachelor's degrees\ngeneric term for higher education, but only at the undergraduate level",
    "British English": "part of the name of some state secondary schools (US approx.: high school) \nand many independent schools (US approx.: prep school)\neducational institution between school and university (e.g. sixth form \ncollege, technical college, college of further education)\nvocational training institution",
    "Common": "constituent part of some larger universities, especially ancient \nuniversities"
  },
  "comforter": {
    "American English": "quilted bedspread (UK: duvet)",
    "British English": "a baby's dummy (q.v.)",
    "Common": "one who comforts"
  },
  "commissioner": {
    "American English": "A civilian public official in charge of a municipal governmental \ndepartment, and particularly of a police department\nmember of any commission",
    "British English": "professional head of the Metropolitan Police Service and City of London \nPolice (US: chief of police)"
  },
  "commode": {
    "American English": "normal toilet, in a bathroom (q.v.)",
    "British English": "small cabinet",
    "Common": "portable toilet for use in a room without plumbing"
  },
  "compensation": {
    "American English": "remuneration received by employees\n(unemployment compensation) compensation paid to an unemployed person (as \na laid-off worker), arising from government resources",
    "Common": "the act of compensating\ndamages awarded for a legal wrong\n(workers' compensation) payment to injured workers"
  },
  "concession": {
    "American English": "a lease or grant of premises or land for a particular use, or the so \ncontracted-out service, as in concession stand, i.e. a counter, stand or \narea at public entertainment venues where snacks or drinks are sold, often \nat inflated prices\na concession stand",
    "British English": "reduction in price (discount) for a certain category of person",
    "Common": "the action of conceding\nin politics, the action of a candidate yielding to another\nan area within one country that is administered by another"
  },
  "condominium": {
    "American English": "(also condo) a type of joint ownership of real property (as an apartment \nbuilding) in which portions of the property are commonly owned and other \nportions are individually owned; an apartment in a condominium",
    "Common": "a political territory (state or border area) in or over which two sovereign \npowers formally agree to share equally dominium (in the sense of \nsovereignty) and exercise their rights jointly"
  },
  "constable": {
    "American English": "peace officer in a township without an organised police department\nofficial who serves summonses (UK: bailiff or sheriff's officer)",
    "British English": "technically, a police officer of any rank, but usu. understood to mean a \npolice officer of the lowest rank (one who holds no other more specific \nrank) (US: officer or patrolman)"
  },
  "construction": {
    "American English": "road construction and maintenance work; roadwork (\"a construction \narea/zone\") (UK: roadworks)",
    "Common": "the act or process of building or constructing; a structure; the \nconstruction industry\nfrom construe: the assigning of meaning to ambiguous terms"
  },
  "cooker": {
    "American English": "a person who cooks (UK: cook)",
    "British English": "an appliance for cooking food (US: cookstove, stove, range)\na cooking apple, a large sour apple used in cooking",
    "Common": "a pot or utensil for cooking in (\"pressure cooker\", \"rice cooker\", \"slow \ncooker\")"
  },
  "cookie": {
    "American English": "a small, flat baked cake (UK usu. biscuit, q.v.)\nfellow, guy (\"a tough cookie\"); also, an attractive girl \n(that's the way the cookie crumbles) that's how things go\n(to toss one's cookies) to vomit\n(cookie-cutter) trite, banal\na cook or Culinary Specialist (Army and Navy slang)",
    "British English": "a bun (Scotland) \n\na biscuit of a particular variety, usually containing chocolate chips \n(often referred to as a \"chocolate chip cookie\")",
    "Common": "a small packet of information stored on users' computers by websites"
  },
  "cop": {
    "American English": "(cop a plea) (law, orig. slang) to plead guilty to a lesser offence to \nnot be tried for a graver charge; compare plea bargain\n(cop a squat) to take a seat (slang)",
    "British English": "to take (\"cop a look at this\", \"cop one of these\") (slang)\nto be blamed for, be caught (\"he'll cop it!\") (slang)",
    "Common": "police officer (short for \"copper\") (slang)\n(cop a feel) to grope (slang)"
  },
  "copper": {
    "British English": "low value coin, brown or 'copper' colored (currently 1p and 2p coins)\nlarge copper vessel used for heating water and washing clothes (archaic)",
    "Common": "the metallic element copper\npolice officer (slang, orig. UK)"
  },
  "coriander": {
    "British English": "the leaves of the coriander plant, used as a herb (US: cilantro or Chinese \nparsley)",
    "Common": "the plant Coriandrum sativum\ndried seeds of this plant"
  },
  "corn": {
    "American English": "Zea mays; originally known as Indian corn (q.v.; UK usu.: maize or \nsweetcorn); hence cornfield, cornstarch (UK: corn flour), \ncornbread, cornball, cornblade, etc.\nsomething corny , hence cornball",
    "British English": "wheat in England, oats in Scotland and Ireland \n\n\nany of various cereal plants or grains (US usu.: grain), also in \ncombination (e.g. cornfield, a field of any cereal)\n(see also US)",
    "Common": "in both dialects, the principal crop cultivated in a particular region\nIndian corn, in corn on the cob, corn flakes, popcorn\nhorny swelling on the foot"
  },
  "cot": {
    "British English": "infant bed; hence cot death (US: crib)",
    "Common": "camp bed"
  },
  "coulee": {
    "American English": "(chiefly Western, orig. Canadian) a deep steep-sided ravine formed by \nerosion, or a small valley or stream",
    "Common": "a (solidified) stream of lava"
  },
  "course": {
    "American English": "an individual subject a student takes at university",
    "British English": "the entire degree programme a student takes at university"
  },
  "court shoe": {
    "American English": "a type of athletic shoe used for sports played on an indoor court, such as \nvolleyball or squash (UK similar: plimsoll or regionally pump)",
    "British English": "a women's dress shoe with a heel (US: pump, q.v.)"
  },
  "cowboy": {
    "American English": "a cowhand working with livestock (UK: drover)",
    "British English": "an unscrupulous or unqualified tradesman",
    "Common": "a legendary archetype found in Wild West genre works \n\n(derog.) one who is reckless, uncontrollable."
  },
  "cracker": {
    "American English": "an unsophisticated, typically rural white person (also white cracker; \nderogatory slang, southeastern US)",
    "British English": "small parcel that makes an explosive report when pulled from both ends, \ntraditionally pulled at Christmas\nattractive woman (slang)\nanything good (\"the new product is a cracker\") (slang)",
    "Common": "thin, hard, unsweetened biscuit (formerly chiefly US, now common \neverywhere) \n\na person who commits illegal acts by exploiting security flaws in a \ncomputer system"
  },
  "creek": {
    "American English": "any inland stream of water smaller than a river (other terms: UK: rill, gill; \nN. Eng. & Scot.: burn; Eng. & New Eng.: brook; Midland US: run)",
    "British English": "tidal channel through a coastal marsh (orig. sense)"
  },
  "crew": {
    "American English": "rowing as a sport",
    "Common": "body of people manning a vehicle of any kind\ngang of manual workers (e.g. road crew)\ngroup of friends or colleagues (\"I saw him and his crew at the bar\")"
  },
  "crib": {
    "American English": "small enclosed bedstead for a child; hence crib death (UK: cot)\n(informal) one's house or apartment\na bin for storing maize\na structure of logs to be anchored with stones; used for docks, dams, etc.\n(orig. Canada) a small raft of timber",
    "British English": "nativity scene, crèche (q.v.) ",
    "Common": "a manger or rack, or stall for cattle\na plagiarism, as of a student (\"crib sheet\")\ncribbage"
  },
  "crisp": {
    "British English": "fried potato slices with salt, sometimes with flavour (US: potato chips)",
    "Common": "brittle, crunchy, dry, firm"
  },
  "crumpet": {
    "British English": "an attractive female (slang)",
    "Common": "A savoury waffle-like cake made from flour or potato and yeast"
  },
  "crèche": {
    "American English": "nativity scene, manger scene, crib (q.v.) ",
    "British English": "day care, day nursery"
  },
  "cubicle": {
    "British English": "A compartment in a bathroom with low walls that contains a toilet. (US: \nstall)",
    "Common": "A compartment in a larger area separated from similar adjoining \ncompartments by low walls, such as in an office area."
  },
  "cuffs": {
    "American English": "An arrangement at the bottom of trouser-legs, in which the material is \nfolded back upon itself to form a trough externally around the bottom of \nthe leg. (UK: turn-ups)",
    "Common": "The ends of a garment's sleeves, furthest from the wearer\nshort for handcuffs"
  },
  "cunt": {
    "American English": "offensive, obscene term usu. applied to women",
    "British English": "offensive (or sometimes indulgent) term often applied to men",
    "Common": "vagina (usu. obscene)"
  },
  "custodian": {
    "American English": "one who cleans and maintains a building; a building superintendent, a \njanitor",
    "British English": "an association football goalkeeper",
    "Common": "a keeper or guardian of a person or thing"
  },
  "daddy longlegs": {
    "American English": "Opiliones",
    "British English": "crane fly",
    "Common": "daddy long-legs spider"
  },
  "daddy-long-legs": {
    "American English": "Opiliones",
    "British English": "crane fly",
    "Common": "daddy long-legs spider"
  },
  "davenport": {
    "American English": "a type of couch, often convertible into a bed",
    "British English": "a type of writing table "
  },
  "dc": {
    "American English": "District of Columbia",
    "British English": "Detective Constable, a police officer who works in or with a branch of CID.",
    "Common": "direct current\n(see also other expansions)"
  },
  "dead": {
    "British English": "(of a cup, glass, bottle or cigarette) empty, finished with\nvery, extremely (\"dead good\", \"dead heavy\", \"dead rich\")",
    "Common": "deceased\ncompletely, perfectly (\"dead straight\", \"dead on\", \"dead right\")\nextremely quiet (e.g. business or nightlife)\n(dismissive usage) boring"
  },
  "deadbeat": {
    "American English": "an idler; someone who does not pay their debts, often in construction (\"deadbeat \ndad\") (slang)",
    "British English": "exhausted (slang) (US: dead tired)"
  },
  "deck": {
    "American English": "a wooden, raised platform adjoining a house, usu. enclosed by a railing\na packet of narcotics (slang)\n(v.) to pile up (logs) on a deck of logs or a skidway\n(on deck) in baseball, the hitter due up next (\"Albert is on deck, so \nthey must be careful to not walk this batter.\"). A general usage connotes \navailability, e.g. \"Who's on deck?\" (Who is available to do this?). \nOccasionally used to indicate who is next in line.",
    "Common": "(n.) the floor or level of a ship or other types of vehicles\nthe roadway of a bridge\na recording device\n(v.) to decorate for a festivity (\"deck the halls with boughs of holly\", \n\"decked out with flags\")\nto hit a person hard enough such that they fall to the floor (orig. US)\na pack of cards"
  },
  "deductible": {
    "American English": "an insurance excess",
    "Common English": "able to be deducted or allowable as a deduction, particularly of tax"
  },
  "dennis the menace": {
    "American English": "a character and comic strip developed by Hank Ketcham, debuted in March 1951",
    "British English": "a character and comic strip developed by Ian Chisholm and Davey Law, \ndebuted in March 1951 (US: Dennis)"
  },
  "depot": {
    "American English": "a railroad station or bus terminal or station; also, an air terminal\n(pronounced /ˈdiːpoʊ/)",
    "British English": "a location (large building or piece of land) where buses, trams or trains \nare stored when not in use and maintained\n(pronounced /ˈdɛpoʊ/)",
    "Common": "a storehouse or depository; a location for the storage of military or naval \nsupplies\n(pronounced /ˈdɛpoʊ/ in BrE, /ˈdiːpoʊ/ in AmE)\nA slow-release drug injection (usu. psychiatric)\n(pronounced /ˈdɛpoʊ/ in both dialects)"
  },
  "derby": {
    "American English": "a bowler hat",
    "British English": "rivalry between two sports teams of close proximity or that frequently meet, especially in football",
    "Common": "a type of horse race; by extension, any organised race"
  },
  "di": {
    "American English": "Drill instructor (military)",
    "British English": "Detective inspector (police)"
  },
  "diary": {
    "British English": "personal calendar (US: appointment book, appointment calendar, \ndatebook)",
    "Common": "personal journal"
  },
  "digital radio": {
    "American English": "a radio with a digital display",
    "Common": "any radio that receives a digital signal"
  },
  "dim": {
    "American English": "to lower a vehicle headlight's beam, typically when approaching vehicles \ntravelling in the opposite direction at night (UK: dip); hence dimmer \nswitch (UK: dip switch)",
    "Common": "to reduce the intensity of a domestic, industrial or other light; hence dimmer \n(switch)"
  },
  "dimmer": {
    "American English": "to lower a vehicle headlight's beam, typically when approaching vehicles \ntravelling in the opposite direction at night (UK: dip); hence dimmer \nswitch (UK: dip switch)",
    "Common": "to reduce the intensity of a domestic, industrial or other light; hence dimmer \n(switch)"
  },
  "diner": {
    "American English": "railroad dining car (UK: restaurant car)\na type of restaurant, traditionally but not necessarily often resembling a \ndining car",
    "Common": "one who dines"
  },
  "dip": {
    "American English": "to use smokeless tobacco",
    "British English": "to lower a vehicle headlight's beam, typically when approaching vehicles \ntravelling in the opposite direction at night (US: dim); hence dip \nswitch (distinguished from DIP switch) (US: dimmer switch)\n(n.) a pickpocket (slang)",
    "Common": "to lower into a liquid; esp., a sheep or dog in chemical solution; to lower \nand then raise"
  },
  "dip switch": {
    "American English": "to use smokeless tobacco",
    "British English": "to lower a vehicle headlight's beam, typically when approaching vehicles \ntravelling in the opposite direction at night (US: dim); hence dip \nswitch (distinguished from DIP switch) (US: dimmer switch)\n(n.) a pickpocket (slang)",
    "Common": "to lower into a liquid; esp., a sheep or dog in chemical solution; to lower \nand then raise"
  },
  "dirt": {
    "American English": "earth, soil ",
    "Common": "substance(s) rendering something unclean\nincriminating evidence (\"we've got the dirt on him now\")"
  },
  "diversion": {
    "British English": "circuitous route to avoid roadworks (US: detour)",
    "Common": "deviation; recreation; tactic used to draw attention away from the action"
  },
  "dock": {
    "American English": "constructed place to moor a boat or engage in water sports (largely \ninterchangeable with pier or wharf, although often with a modifier, \nsuch as \"ferry dock\", \"swimming dock\", etc.)",
    "British English": "water between or next to a pier or wharf (US: berth, also used in UK, or \nslip)\nsection of a courtroom where the accused sits during a trial ",
    "Common": "(v.) to reduce an employee's wages, usu. as discipline"
  },
  "docker": {
    "British English": "dockworker, stevedore (US: longshoreman)",
    "Common": "one who docks (as tails of animals)"
  },
  "dogging": {
    "American English": "insulting in a persistent fashion, often referring to the dozens\npursuing someone persistently",
    "British English": "various kinds of public sexual activity",
    "Common": "pursuing diligently as a dog would"
  },
  "dollar": {
    "British English": "5 shilling coin or equivalent amount (obsolete; used in slang until the \nearly 1970s, especially in \"half-dollar\"=half-crown, but some re-stamped \nSpanish dollar coins were used in the UK in the late 18th/early 19th \ncentury)",
    "Common": "major unit of currency of the USA"
  },
  "dorm": {
    "American English": "building with many small private rooms, as for housing the students of a \ncollege (UK: hall(s) of residence, hostel)\n\ndormitory car — railway sleeping car",
    "British English": "(n. or usu. adj.) (part of) a town where commuters live, usually dormitory \ntown (US: bedroom or bedroom community)",
    "Common": "(n.) large sleeping-room with many beds,typically in a boarding school \n(\"a sleeping dormitory\"; usu. abbreviated to dorm)"
  },
  "dormitory": {
    "American English": "building with many small private rooms, as for housing the students of a \ncollege (UK: hall(s) of residence, hostel)\n\ndormitory car — railway sleeping car",
    "British English": "(n. or usu. adj.) (part of) a town where commuters live, usually dormitory \ntown (US: bedroom or bedroom community)",
    "Common": "(n.) large sleeping-room with many beds,typically in a boarding school \n(\"a sleeping dormitory\"; usu. abbreviated to dorm)"
  },
  "drape": {
    "American English": "(n., usu. pl.) curtain",
    "Common": "(v.) to hang limply"
  },
  "draw": {
    "American English": "a ditch that draws water off an area of land\na shallow valley or gully",
    "British English": "cannabis (slang)",
    "Common": "an act of drawing, or something drawn\na game result in which no player/team wins (also tie)"
  },
  "dresser": {
    "American English": "a chest of drawers, usu. with a looking glass (mirror) (UK: dressing-table\n)",
    "British English": "a type of cupboard or sideboard esp. for kitchen utensils "
  },
  "drop of": {
    "British English": "several (fluid) ounces (\"just a drop of tea, please\") (meiotic usage)",
    "Common": "droplet (less than a milliliter)"
  },
  "duck": {
    "British English": "a score of zero by a batsman in cricket, supposedly derived from the \nzero-like shape of a duck's egg. Hence to \"break one's duck\": to score \none's first run. c.f. US: \"get the monkey off one's back\"\n\na term of endearment",
    "Common": "(n.) a bird of the family Anatidae\n\n(v.) to lower the head or body suddenly, to dodge\n(v.) to plunge under the surface of water\n(n.) a heavy cotton fabric"
  },
  "duff": {
    "American English": "vegetable matter on the forest floor",
    "British English": "of poor quality\nnon-functional\n(up the duff) pregnant (slang, originally Australian)",
    "Common": "a type of pudding\ncoal dust"
  },
  "dummy": {
    "British English": "rubber teat for babies (US: pacifier), a feint (esp. in association \nfootball)",
    "Common": "mannequin, especially for automobile crash tests\nfake, usu. legal\nidiot (slang)\nthe contract bridge player who faces his hand after the bidding/auction"
  },
  "dungarees": {
    "American English": "(slightly dated) jeans (blue denim jeans)",
    "Common": "sturdy protective bib trousers (cf. s.v. bib overall)"
  },
  "duplex": {
    "American English": "(or duplex house) an often vertically divided two-family dwelling \n(or duplex apartment) an apartment on two levels \n(duplex locomotive) a large steam locomotive with two sets of driving \nwheels",
    "Common": "composed of two parts\ntwo direction (electronical signalling)"
  },
  "earth": {
    "British English": "safety connection of an electrical circuit, or to connect (an electrical \ndevice) to this (US: ground)",
    "Common": "the planet Earth\nsoil\nthe burrow of some animals"
  },
  "efficiency": {
    "American English": "(or efficiency apartment) a minimal often furnished apartment, similar to \na studio apartment (UK: compare bedsit)",
    "Common": "the quality of being efficient"
  },
  "el": {
    "American English": "an elevated railway (as that of Chicago or the now-defunct Third Avenue El \nin New York City)",
    "British English": "(L) letter identifying a learner driver; see L-plate",
    "Common": "the letter L"
  },
  "elevator": {
    "American English": "platform or cage moved vertically in a shaft to transport people and goods \nto various floors in a building (UK: lift)\nbuilding for grain storage (in full grain elevator) (UK: silo)",
    "Common": "flap on the back of an aeroplane used to control pitch\nmoving belt to transport grain, hay bales, etc."
  },
  "elk": {
    "American English": "wapiti (Cervus canadensis), the second largest species of deer",
    "British English": "moose (Alces alces), the largest species of deer"
  },
  "engaged": {
    "British English": "in use – of a toilet/bathroom stall (US: occupied; but the opposite is \nvacant in both); of a telephone line (US & UK also: busy), hence engaged \ntone (US: busy signal)",
    "Common": "committed; involved in something\nbetrothed"
  },
  "engineer": {
    "American English": "one who operates an engine, esp. a locomotive (UK: engine driver)",
    "British English": "a technician or a person who mends and operates machinery",
    "Common": "one employed to design, build or repair equipment\npractitioner of engineering"
  },
  "english": {
    "American English": "(adj.) the foot-pound-second system of units (UK: \nImperial)\nEnglish (n.) spin placed on a ball in cue sports (UK: side)",
    "Common": "of or pertaining to England\nthe English language"
  },
  "entrée": {
    "American English": "main course of a meal",
    "British English": "starter (q.v.) of a meal (traditionally, the course served between the fish \nand the joint, but now used for any starter)",
    "Common": "(usu. \"the entrée\") right of entry, insider-type access"
  },
  "estate": {
    "British English": "any defined area of real property, as in housing estate (US: subdivision), \ncouncil estate (US: housing project) or trading estate (US: industrial \npark)\ncar with van-shaped body (US: station wagon)",
    "Common": "grounds of a large piece of real property which features a mansion and \nbeautiful landscaping\nproperty left by a deceased person"
  },
  "evergreen": {
    "American English": "(n.) branchlets or sprigs of an evergreen tree, usually a conifer such as \npine, spruce or fir, often used as a Christmas decoration wrapped around \nhuman-made structures",
    "Common": "non-deciduous, a non-deciduous plant\neternally youthful, new etc."
  },
  "expiration": {
    "American English": "(UK: expiry)",
    "Common": "the exhalation of breath"
  },
  "faculty": {
    "American English": "academic staff of a school, college or university",
    "Common": "division of a university, dealing with a specific group of disciplines \n(e.g. faculty of arts)"
  },
  "fag": {
    "American English": "In American English \"fag\" always has the pejorative meaning of male \nhomosexual. Use of the Americanism in the media has rendered it \ncontextually understood by Britons.",
    "British English": "cigarette (slang) \n(in England; obs.) young public schoolboy who acted as a servant for older \npupils\ndrudgery, chore (\"it is such a fag – I come back tired to death\" – J. \nAusten)",
    "Common": "male homosexual; vulgar slur (short for faggot)"
  },
  "faggot": {
    "British English": "kind of meatball (see faggot (food)), bundle of sticks, usu. for use as \nfirewood (old-fashioned; often spelled fagot), old musical instrument \nsimilar to the bassoon (often spelled faggott)",
    "Common": "male homosexual; vulgar slur (see faggot (slang))"
  },
  "fall": {
    "American English": "autumn",
    "British English": "to become pregnant. (Either as in 'I fell pregnant' or as in 'She fell for \na baby.');",
    "Common": "descend or tumble\nbecome sick, come down with an illness (\"he fell ill\") (uncommon in US)\nprove attractive (\"fall for someone\", \"fall in love\")"
  },
  "fancy": {
    "American English": "US colloq. equiv. of \"to fancy\" is \"to like\" something or someone (or \nregarding tastes and preferences, \"to love\"); \"fancy\" as a verb is now used \nin the US almost solely by UK ex-pats, but was once oft-used by Southern \ngentility (landed gentry)",
    "British English": "(v.) exhibit a fondness or preference for something; exhibit an interest in \nor willingness to: date/court someone, commit some act, or accept some item \nof trade"
  },
  "fancy dress": {
    "American English": "(colloq.) \"formal\" wear (usu. tuxedos for men and ball gowns for women.)",
    "British English": "a costume worn to impersonate a well-known character, animal etc., \ntypically at a fancy dress party (US: costume party)"
  },
  "fanny": {
    "American English": "buttocks (colloquial); hence fanny pack (UK: bum bag)",
    "British English": "vagina (slang), vulva (vulgar slang)\n(fanny about or fanny around, vulgar slang) to mess about or \nprocrastinate (\"Stop fannying about and hit it with the hammer\")"
  },
  "featherbed": {
    "American English": "quilt, or comforter, stuffed with feathers for use on top of the mattress \n(but underneath a sheet and the sleeping person) (UK: mattress topper)",
    "British English": "bed or mattress stuffed with feathers (usually 2 words)\n(v.) to pamper, to spoil",
    "Common": "to require that more workers are hired than are needed, often by agreement \nwith trade unions"
  },
  "fender": {
    "American English": "fender (vehicle): the part of an automobile, motorcycle or other vehicle \nbody that frames a wheel well (UK: mudguard or wing)\na frame fitted in front of a vehicle (locomotive or automobile) to absorb \nshock (UK: bumper – see Bumper (automobile))",
    "Common": "a fire screen\na cushioning device to protect the side of a boat, ship, or dock\na brand of electric guitar, from its manufacturer, the Fender Musical \nInstruments Corporation"
  },
  "fifth": {
    "American English": "bottle of spirits (\"a fifth of bourbon\"), traditionally 1/5 of a US gallon, \nnow the metric near-equivalent of 750 mL\n\nto \"plead the Fifth (Amendment)\", i.e. refuse to testify against oneself in \nan incriminating manner",
    "Common": "ordinal number 5\none of five equal parts into which something is divided"
  },
  "filth": {
    "British English": "(the filth) the police (derogatory slang)",
    "Common": "dirt, disgusting substance\nobscene material"
  },
  "first degree": {
    "American English": "the most serious category of a crime; of murder, carries a lifetime prison- \nor death-sentence (also informal murder one; see article)",
    "Common": "the least serious category of burn (see article)"
  },
  "first floor": {
    "American English": "the floor at ground level (often, but not always, the same floor as a \nbuilding's lobby) (UK: ground floor)",
    "British English": "the floor above ground level (US: second floor)"
  },
  "fit": {
    "British English": "(of a person) attractive, sexy (slang)",
    "Common": "(of a person) in good physical condition\nsuitable for some purpose (usu. followed by for or to)"
  },
  "fix": {
    "American English": "to adjust or prepare, esp. food or beverage (\"I'll fix you a sandwich\")\n(esp. South) to get ready (\"I'm fixing to retire\")\nto get even with (someone)\n(fix up) to provide",
    "British English": "to make firm, fasten, or attach (the original sense, no longer very common \nin US)\nto set or arrange (as a date) (\"A time has been fixed\")",
    "Common": "to repair (orig. US)\nto sterilise (an animal)\nto manipulate usually underhandedly (\"To fix a fight by paying a boxer to \ntake a dive.\")"
  },
  "flannel": {
    "British English": "a cloth for washing the face or body (US: washcloth)",
    "Common": "particular type of fabric/material used for the manufacture of trousers or \nsuits, but more commonly recognised in America as a fabric used in warm \nwinter night clothes and sheets"
  },
  "flapjack": {
    "American English": "pancake",
    "British English": "flat oat cake (US: granola bar)"
  },
  "flat": {
    "American English": "(n.) a flat tyre/tire \nan apartment that occupies the entire floor of a small building (upstate New \nYork and San Francisco); used also in phrases such as railroad flat",
    "British English": "(n.) self-contained housing unit (US: apartment)\n(adj., of a battery) discharged, exhausted, dead",
    "Common": "(adj.) level and smooth\nstructured at a single level, not hierarchical"
  },
  "flip-flop": {
    "American English": "an about-face or U-turn (UK also: about-turn), as in politics",
    "Common": "a type of footwear\na type of electronic circuit"
  },
  "fluid ounce": {
    "American English": "liquid measure equal to 29.57 milliliters",
    "British English": "liquid measure equal to 28.41 millilitres"
  },
  "flyover": {
    "American English": "ceremonial aircraft flight (UK: flypast)\nan elongated left-turn ramp passing over or under the whole highway \ninterchange\nFlyover country is a term for (unsophisticated, poor, rural) middle \nAmerica, as distinct from the 'coasts'.",
    "British English": "elevated road section (i.e. long road bridge, US: overpass)"
  },
  "football": {
    "American English": "American football",
    "British English": "(usually) Association football (US: soccer). Less frequently applies to \nRugby football (espec. Rugby union in English private schools)."
  },
  "footpath": {
    "British English": "a paved strip for pedestrian use, especially along the side of a road (US: sidewalk)",
    "Common": "a narrow trail suitable only for foot traffic"
  },
  "forty": {
    "American English": "a 40-acre (160,000 m2) parcel of land, specifically one sixteenth of a \nsection, constituting the smallest unit of agricultural land commonly \nsurveyed (\"back 40\", \"front 40\").\nan undeveloped plot of land (as on a farm, ranch, etc.) of unspecified size.\nin an urban or youth setting, \"a 40-ounce beer\".",
    "Common": "the number 40"
  },
  "fourth": {
    "American English": "one of four equal parts into which something is divided (UK & US sometimes \nalso quarter, q.v.).\n(proper noun, used with the) short for The Fourth of July (America's Independence \nDay)",
    "Common": "next after third (e.g. the fourth person, fourth floor) \n\nA musical interval"
  },
  "fringe": {
    "American English": "(rare vulgar; chiefly 1980s) vulva (\"He's gonna get some fringe.\") q.v., \nUS: trim",
    "British English": "arrangement of locks of hair on the forehead (US: bangs)",
    "Common": "the outer area of something\na decorative border e.g. on clothing\nholding an extreme political position (\"lunatic fringe\")"
  },
  "frock": {
    "British English": "(or smock-frock) outer garment formerly common in rural Europe, see also \noverall\n\n(also short frock) indoor garment for children and young girls \na woman's dress or gown (dated) ",
    "Common": "habit of monks and friars\n\n(also frock coat) a style of gentleman's jacket or coat, cut at knee \nlength, usually worn as an outer garment."
  },
  "frog": {
    "American English": "(Slang) A US Navy SEAL. Shortened from \"Frogman",
    "British English": "French person (insulting slang)",
    "Common": "an amphibian\npart of the mechanism of railway points/a railroad switch"
  },
  "full stop": {
    "American English": "the state of automobiles barely moving in heavy traffic (also, a \"dead \nstop\")",
    "British English": "punctuation mark used at the end of a sentence, sometimes used in speech \nfor emphasis (\"Whom does he support? Arsenal, full stop!\") (US: period, \nq.v.)"
  },
  "furnace": {
    "American English": "principal domestic heat source in central heating. (UK: boiler)",
    "Common": "large hearth or container for heating or melting metal, usually for an \nindustrial process"
  },
  "gagging": {
    "British English": "(especially as in gagging for it) desperate, especially for sex \n(colloquial)",
    "Common": "choking;\nfighting the urge to vomit (\"that was so disgusting, I was gagging\")"
  },
  "gallon": {
    "American English": "3.78541 litres (about 5/6 of UK gallon)",
    "British English": "4.54609 litres (about 6/5 of US gallon)"
  },
  "gangbanger": {
    "American English": "gang member; group rapist",
    "British English": "a participant in a \"gang bang\", a group sex activity"
  },
  "garage": {
    "American English": "(parking garage) building serving as a public parking facility (UK: multistorey \ncar park or just multistorey)",
    "British English": "fuel filling station, e.g. \"a Texaco garage\" (also petrol station, US: gas \nstation)\na genre of music",
    "Common": "place where vehicles are repaired;\nbuilding attached to or in the grounds of a residence for storing a car"
  },
  "garbage": {
    "American English": "household waste (UK \"rubbish\")",
    "Common": "piece of nonsensical prose, sequence of meaningless words"
  },
  "garden": {
    "American English": "area within a yard (land) for growing plants or vegetables (UK: vegetable \ngarden, vegetable patch)",
    "British English": "area around a residential structure (US: yard)"
  },
  "garnish": {
    "American English": "(v.) to take (as a debtor's wages) by legal authority",
    "Common": "(n. (v.)) (to add) decorative or savory touches to (food or drink)\n(v.)to furnish"
  },
  "gas": {
    "American English": "gasoline, hence gas station (UK: petrol)\ngas pedal (UK: accelerator)\nflatulence\nair trapped in the stomach or intestines (UK: wind)",
    "Common": "state of matter (see gas)\nnatural gas"
  },
  "geezer": {
    "American English": "old person (derogatory; UK: old geezer)",
    "British English": "gangster, man (esp. Cockney)"
  },
  "give way": {
    "British English": "to give the right of way (to vehicles, pedestrians, etc.); hence give \nway sign (US: yield sign)",
    "Common": "to retreat; to break down"
  },
  "glass": {
    "British English": "(v.) to hit someone with a broken bottle or drinking glass",
    "Common": "(n.) a brittle, hard, transparent substance usually made from sand heated \nwith soda or potash; (n.) drinking vessel made of glass"
  },
  "glaze": {
    "American English": "a slippery coating of ice (also known as sleet, q.v.); a stretch of ice",
    "Common": "general term for thin shiny coatings applied to food, painted surfaces, \nclayware, etc.; a glossy surface"
  },
  "go down": {
    "American English": "to go on, happen (often a major event, e.g. a drug bust \"it's going down \nright now!\" or \"it went down last week\". But also used as a greeting, \n\"What's going down?\")",
    "British English": "to leave a university (as Oxford)\nto come down (with an illness)",
    "Common": "to be accepted or remembered (e.g. go down in history)\nto fail, esp. of a computer\ngo down on, to engage in oral sex"
  },
  "gob": {
    "American English": "a large amount (\"gobs of\")\n(slang—little used since the 1940s) a sailor",
    "British English": "(n.) mouth; (v., slang) to spit",
    "Common": "lump"
  },
  "goods": {
    "British English": "items to be transported (as by railway) (\"a goods train\") (US & UK also: \nfreight)",
    "Common": "useful objects or services; products; merchandising; personal property\nincriminating evidence (\"we have the goods on him\")"
  },
  "gooseberry": {
    "British English": "supernumerary third person preventing a couple from courting (US: third \nwheel)",
    "Common": "a green hairy summer fruit\n(Ribes hirtellum in the USA),\n(Ribes grossularia in Europe)"
  },
  "government": {
    "American English": "the collective agency through which government is exercised (UK: the state\n)\nall such individual agencies (UK: the public sector)",
    "British English": "the cabinet or executive branch (US: the administration)\nthe political party supporting the cabinet in parliament",
    "Common": "the act or office of governing"
  },
  "governor": {
    "American English": "the top official in a US state",
    "British English": "boss (sometimes shortened to guv'nor), colloquial",
    "Common": "a local official"
  },
  "grade": {
    "American English": "1) (n.) slope, gradient, or elevation; also ground level (\"at grade\", \"over \ngrade\"); hence grade crossing (UK: level crossing)\n(v.) to level (as a roadbed), hence grader, construction machine for \ndoing this;\n 2) level or year of a student in elementary, middle, or high school (\"in 10th \ngrade\") (UK equiv.: year); hence grader, a student in a specified grade \n(\"a 10th grader\")\n(grade school, the grades) elementary school\nsee also Grade Point Average",
    "British English": "a level of music examination (\"Guitar grade 4\"). Usually refers to ABRSM or Trinity \nCollege London examinations.",
    "Common": "1) (n.) a rating, degree, or level; (v.) to lay out in grades;\n 2) (n. & v.) teacher's assessment of a student's work (UK also mark)"
  },
  "graduate": {
    "American English": "to finish studying at any educational institution by passing relevant \nexaminations\nrelating to a student taking a higher degree (UK equiv.: \"postgraduate\"), \ne.g. graduate school",
    "British English": "to finish university with a degree\nrelating to a student at the point of gaining, or who has recently \ncompleted, a degree",
    "Common": "to move from a lower to higher stage; to effect change in steps; to mark \nwith units of measurement or other divisions."
  },
  "graft": {
    "American English": "a form of political-economic corruption",
    "British English": "hard work",
    "Common": "to join or connect two separate but similar items (typically in biology, \nespecially medicine and horticulture)"
  },
  "grammar school": {
    "American English": "elementary school (less common today)",
    "British English": "a type of secondary school, normally a selective state funded school"
  },
  "grass": {
    "American English": "grazing; to feed (livestock) with grass (UK: at grass, to put out to \ngrass)",
    "British English": "an informant (often to the police)\n(to grass on) to tell on somebody (US: to squeal, narc)",
    "Common": "green ground cover\nmarijuana"
  },
  "grill": {
    "American English": "to cook over a gas or coal fire (UK and US: barbecue)\na flat cooking surface\na restaurant (freq. as \"bar and grill\")",
    "British English": "to cook directly under a dry heat source (US: broil)",
    "Common": "to question intensely (informal). \n\nto interrogate."
  },
  "ground floor": {
    "American English": "lower of two floors that are each at a different ground level due to \nsloping terrain (UK: lower ground floor)",
    "Common": "the floor at ground level (US usu.: first floor)"
  },
  "guard": {
    "American English": "military division used to help the country after a disaster\n\nin (American) football, one of two offensive positions on either side of \nthe center or a defensive position across from the center (nose-guard)",
    "British English": "the official in charge of a railway train (US & now UK also: conductor)",
    "Common": "to watch over for security\none who guards\na protective device\n\none of two positions in basketball, usually players who are the best \nball-handlers and shooters. Usually smaller than the forwards or center. \nMost common division is between point guards (playmakers) and shooting \nguards (more often score-first)."
  },
  "guff": {
    "American English": "nonsense, insolent talk, back talk",
    "British English": "extraneous or useless things, ideas, or paperwork/documentation; also to \nbreak wind (\"Have you guffed, Dr Watson?\")"
  },
  "gum": {
    "British English": "cement consisting of a sticky substance that is used as an adhesive (US \nusually: glue)",
    "Common": "a type of confectionery composed of chicle used for chewing\nthe soft tissue around the teeth, or to chew something with no teeth (also, \ngum at)"
  },
  "gutted": {
    "British English": "disappointed and upset (informal)",
    "Common": "past tense of gut: eviscerated; plundered; despoiled; made powerless or \nineffectual\n(of a building) stripped of interior structure, leaving only frame and \nexterior walls (e.g.by fire)"
  },
  "gyro": {
    "American English": "a sandwich, the Greek gyro, more familiar to Americans than the similar \nTurkish döner kebab, which is more common in Britain",
    "British English": "(see also giro)",
    "Common": "gyroscope"
  },
  "haberdasher": {
    "American English": "a dealer in men's apparel and accessories; hence haberdashery",
    "British English": "a dealer in small items and accessories, as for sewing; hence haberdashery \n(US: notions)"
  },
  "half": {
    "American English": "large bottle of spirits (\"a half of bourbon\"), traditionally 1/2 of a US gallon, now the metric near-equivalent of 1750 mL; also \"handle\" as such large bottles often have a handle",
    "British English": "half pint of beer, cider or lager a single measure of whisky or other distilled spirit (used mostly in Scotland, derived from the Scots word 'hauf')",
    "Common": "fifty percent/0.5 times"
  },
  "halfway house": {
    "American English": "a place for ex-convicts to live while readjusting to society.",
    "British English": "a place where victims of child abuse, orphans or teenage runaways can stay, \na shelter",
    "Common": "drug rehabilitation or sex offender centre. (Archaic) An inn halfway \nbetween two towns, still seen in many pub names."
  },
  "hamper": {
    "American English": "basket for clothes that need washing (UK: Linen basket or laundry basket\n)",
    "British English": "large basket for food (especially picnic hamper, Christmas hamper)",
    "Common": "to impede or hinder"
  },
  "hash": {
    "British English": "number sign, octothorpe (#) (US: pound sign). Also 'to make a hash' of \nsomething is to mess it up.",
    "Common": "hashish\nHash (food), beef and other ingredients mashed together into a coarse paste"
  },
  "herb": {
    "American English": "any herbaceous plant",
    "Common": "culinary or medicinal herb, leaves of plants used to flavour food or treat \nailments"
  },
  "highway": {
    "American English": "main road (as between cities)\n(divided or dual highway) a road with two roadways and at least four \nlanes (UK: dual carriageway, motorway)\n(highway post office) in the past, a bus transporting mail that was \nsorted en route",
    "British English": "(chiefly in official use) public road; see Highway Code",
    "Common": "(highway robbery) something too expensive; see also highwayman"
  },
  "hike": {
    "American English": "an increase in amount (as in wages) \n(to take a hike) to go away (also used as a command)",
    "Common": "a usu. recreational walk"
  },
  "hire": {
    "American English": "a person who is recruited",
    "British English": "to rent moveable property (e.g. a car) ; rental\n(hire purchase) a purchase carried out over time by making regular \npayments (US: installment plan)",
    "Common": "to employ, recruit "
  },
  "hob": {
    "British English": "the flat top surface of a cooking stove (US: cooktop)\na part of a fireplace\nan elf",
    "Common": "trouble (as in \"raising hob\" – chiefly US)\n (UK has less common \"playing hob\")"
  },
  "hock": {
    "American English": "pawn (n. & v.) (\"I can borrow a dime from the barber, an' I got enough junk \nto hock for a blowout\" – Jack London); prison (both from Dutch) \ndebt\nthe end of a smoked ham \nto hock-a-loogie, to spit (esp. mucus as opposed to saliva).",
    "British English": "a German wine (\"down their four-and-twenty throats went four-and-twenty \nimperial pints of such rare old hock\" – Charles Dickens) (US: Rhine wine)\nHocktide, an ancient holiday",
    "Common": "hock (zoology)"
  },
  "hockey": {
    "American English": "hockey played on ice with a puck (ice hockey) ",
    "British English": "hockey played with a ball on grass (field hockey) ",
    "Common": "hockey played on a hard surface (e.g. concrete) or indoors"
  },
  "hog": {
    "American English": "motorcycle, especially a large one such as a Harley-Davidson (derived from \nHarley Owners Group, a club for Harley-Davidson motorcycle owners.)",
    "British English": "(dialect, also hogg) a yearling sheep",
    "Common": "adult pig, esp. domesticated, castrated male reared for slaughter\nto take more than one's fair share of something\n(road hog) motorist who holds up other traffic by driving slowly or out \nof lane; any bad driver"
  },
  "hole-in-the-wall": {
    "American English": "a small, out-of-the-way place, as a restaurant, with a negative \nconnotation. However, often used to preface a compliment, e.g. \"just a \nhole-in-the-wall place you've never heard of, but they serve the best steak \nin the city.",
    "British English": "automated teller machine, cash machine (informal)"
  },
  "holiday": {
    "American English": "see Federal holidays in the United States\n(the Holidays) the days comprising Christmas and New Year's Day (and \nHanukkah), and often also Thanksgiving (used esp. in the phrase \"happy \nHolidays\") \n\n\nfestival, whether or not generally entailing a public holiday: \"Halloween \nis my favorite holiday",
    "British English": "see Bank holiday\n(often pl.) time taken off from work, school, etc., including the period \nbetween school terms (US: break, vacation)\nrecreational trip away from home (US: vacation)",
    "Common": "day when people are generally exempt from work, school, etc."
  },
  "home": {
    "American English": "In AmE widely used also to mean the physical structure and property, and \nreferences to them, e.g., \"home loans\", \"homeowners\", and \"tract homes\". \nThis usage is overwhelmingly predominant in commercial language and public \ndiscourse, e.g. \"the home mortgage crisis\".",
    "British English": "(noun): condition of domesticity, or one's permanent and regular shelter, \nbut not the physical structure or property."
  },
  "home run": {
    "American English": "(also homer) a four-base hit in baseball\n(slang) sexual intercourse; more s.v. base",
    "British English": "final part of a distance, final effort needed to finish (US: homestretch)",
    "Common": "a success (from baseball)"
  },
  "homely": {
    "American English": "(only used of a person) plain, ugly",
    "British English": "(of a house) comfortable, cozy, rustic (US: homey)\n(of a person) home-loving, domesticated, house-proud"
  },
  "hoo-ha": {
    "American English": "female genitalia",
    "British English": "argument"
  },
  "hood": {
    "American English": "hinged cover over the engine in a car (UK: bonnet)\na contraction of neighborhood, especially regarding a poor neighborhood\nshort for hoodlum, a tough, destructive young man, or generically any \ncriminal",
    "British English": "the folding fabric top on a convertible car (US: convertible top)",
    "Common": "head covering forming part of a garment\ncomponent of academic regalia"
  },
  "hooker": {
    "American English": "prostitute (informal) ",
    "British English": "in rugby football, the player position in the centre front of the scrum"
  },
  "hooter": {
    "American English": "(hooters) female breasts (vulgar slang)",
    "British English": "steam whistle or siren in a factory or other large workplace sounded as a \nsignal for beginning or ceasing work\ncar horn\nnose"
  },
  "hull": {
    "American English": "the seed-case of various edible plants (maize, nuts, etc.)\n(v.t.) to remove the seed-case from (a nut, etc.)\nhulled (adj.) (of a nut, etc.) having the seed-case removed (UK: shelled\n)",
    "British English": "(Hull) Kingston-upon-Hull, a large city in the north-east of England",
    "Common": "the outer skin of a ship, tank, aeroplane, etc."
  },
  "hump": {
    "American English": "(n. & v.) (to make) a vigorous effort (\"hump yourself\", \"to get a hump on\") \n(regional)\n(n.) a mountain barrier to be crossed (as by air)\n(hump day) Wednesday",
    "British English": "a state of depression (dated) (\"to be in a hump\")\na state of annoyance (\"to get the hump\")\na traffic calming tool (\"a speed hump\") (US & UK: speed bump)\nto move a heavy load by human effort a short distance",
    "Common": "a rounded mass sticking out from its surroundings\n(v., vulgar slang) engage in sexual intercourse, animals breeding or trying \nto breed\nsee also Glossary of rail terminology"
  },
  "icebox": {
    "American English": "refrigerator",
    "Common": "cabinet containing ice for food refrigeration"
  },
  "indian corn": {
    "American English": "A particular variety of maize/corn, with multicolored kernels, used for \ndecorations",
    "Common": "Zea mays (historical or technical; usually, UK maize or sweetcorn, US \ncorn, q.v.)"
  },
  "indicator": {
    "British English": "direction-indicator light on a vehicle (US: turn signal)",
    "Common": "one that indicates"
  },
  "inside lane": {
    "American English": "the part of the road nearest the vehicles going in the opposite direction, \nused especially by faster vehicles (UK: outside lane)",
    "British English": "the part of the road nearest the edge, used especially by slower-moving \nvehicles (US: outside lane)",
    "Common": "(in both cases the term applies to the lane in the direction concerned)"
  },
  "inspector": {
    "American English": "senior rank in some police departments (rough UK equivalent: \nsuperintendent)",
    "British English": "lowest supervisory rank above sergeant (rough US equivalent: lieutenant)"
  },
  "intern": {
    "American English": "(n.) one (as a graduate or college student) temporarily employed for \npractical training, e.g. in the science, engineering, or technology fields; \nesp., in the medical field, a physician (rough UK equivalent: houseman) \nin their first year of postgraduate training\n(v.) to work as an intern",
    "British English": "replacement",
    "Common": "(v.) to confine (as during a war, or to a hospital)\n(adj., archaic) internal"
  },
  "international": {
    "American English": "Foreign, not from the USA. (\"International version of software for country \nxxx\", in British English this is a contradiction in terms.)",
    "Common": "Pertaining to or common to more than one country."
  },
  "interval": {
    "American English": "(esp. New England, also spelled intervale) low-lying land, as near a \nriver (US also bottomland)",
    "British English": "break between two performances or sessions, as in theatre (US: \nintermission)",
    "Common": "a gap in space or time; see interval (music), interval (mathematics), interval \n(time)"
  },
  "inventory": {
    "American English": "the stock of an item on hand in a store or shop\nthe process of producing an inventory in a store or shop (UK: stocktaking)",
    "Common": "itemisation of goods or objects (of an estate, in a building, etc.)"
  },
  "ira": {
    "American English": "Individual Retirement Account",
    "British English": "Irish Republican Army"
  },
  "jab": {
    "British English": "an injection with a hypodermic needle, as in the case of an inoculation \n(US: shot)",
    "Common": "(informal) to stab, thrust, or penetrate. biting remark, sarcasm.\na straight punch used in various martial arts"
  },
  "janitor": {
    "American English": "a person employed to oversee the cleaning and security of a building (UK: \ncaretaker, especially for private residences; for schools etc. janitor \nis also used in the UK)",
    "British English": "an officer in a Masonic Chapter (specialist language)",
    "Common": "a person employed to oversee the cleaning and security of a public \nbuilding, e.g. a school."
  },
  "jelly": {
    "American English": "(occasionally) fruit preserve with fruit pieces (UK: Jam)",
    "British English": "a fruit flavoured dessert set with gelatin (US: Jell-O (trademark))\na type of condiment, e.g. mint jelly",
    "Common": "a clear or translucent preserve made from the liquid of fruits boiled in \nsugar and set with pectin, specifically without pieces of fruit (e.g. 'crab \napple jelly')"
  },
  "jersey": {
    "American English": "A colloquial term for the state of New Jersey.",
    "British English": "A British Crown dependency off the coast of France.\nAlso, a kind of buttonless, pullover shirt.",
    "Common": "An athlete's uniform shirt, also called a kit in British English. "
  },
  "jesse": {
    "British English": "(often as Big Jesse, derogatory insult for a man) Non-macho, effeminate, \nsometimes gay.",
    "Common": "A male name (uncommon in the UK).\nA shortening of the female name Jessica."
  },
  "jock": {
    "American English": "slang term for an athlete\nslang term for the undergarment called an athletic supporter or jockstrap",
    "British English": "a Scotsman (slang)\na Scottish private soldier (slang) (UK: squaddie)"
  },
  "joint": {
    "American English": "(slang) hand-rolled cigarette containing only cannabis\n(slang) prison (\"in the joint\")",
    "British English": "piece of meat for carving \n(slang) hand-rolled cigarette containing cannabis and tobacco",
    "Common": "connection between two objects or bones\nan establishment, especially a disreputable one (\"a gin joint\"; \"let's case \nthe joint\") (slang, orig. US)"
  },
  "jolly": {
    "British English": "very (informal) (as in jolly good)",
    "Common": "happy; jovial"
  },
  "jug": {
    "American English": "large container with a narrow mouth and handle for liquids (similar to UK \npitcher)",
    "British English": "any container with a handle and a mouth or spout for liquid (US: pitcher)",
    "Common": "(jugs) breasts (slang)"
  },
  "jumper": {
    "American English": "pinafore dress\njump suit",
    "British English": "a knitted upper body garment (US: sweater)",
    "Common": "jump shot in basketball\nNon-permanent electrical connection, especially on a PCB"
  },
  "kebab": {
    "British English": "commonly a döner kebab (sometimes doner or donner kebab), strips of meat \n(usu. lamb or chicken) grilled by being heated on a revolving device and \nserved stuffed in a pita bread (In the US, the Greek varieties souvlaki \nor gyro are better known than the Turkish döner)",
    "Common": "(often spelled \"kabob\" in the US) meat served on a skewer together with \nonions, tomatoes, etc. (e.g. shish kebab)"
  },
  "keen": {
    "American English": "desirable or just right, example: \"peachy keen\" – \"That's a pretty keen \noutfit you're wearing.\" (slang going out of common usage)",
    "British English": "eager or intent on, example: he is keen to get to work on time."
  },
  "keeper": {
    "American English": "a type of play in American football (\"Quarterback keeper\")\n\na person well-suited for a successful, usu. romantic, relationship. (Don't \nlet him go—he's a keeper)\nsomething of significance (\"that's a keeper\"). Can be used in many \ncontexts. Often used in sports fishing to refer to a fish not released.",
    "British English": "a curator or a goalkeeper",
    "Common": "one that keeps (as a gamekeeper or a warden)"
  },
  "kit": {
    "American English": "a group of person or objects (\"the whole kit and (ca) boodle/billing\")",
    "British English": "clothing, esp. a sports uniform (e.g. football kit)",
    "Common": "any of various sets of equipment or tools\na set of parts to be assembled, e.g. into a scale model"
  },
  "kitty": {
    "American English": "piggy bank\nvagina (vulgar slang) (\"Singin' 'hey diddle diddle' with your kitty in the \nmiddle\" – Aerosmith, Walk this Way)",
    "Common": "affectionate term for a housecat\n\ncollective source of funds (esp. for a group of people)"
  },
  "knickers": {
    "American English": "knickerbockers",
    "British English": "women's underwear (US: panties)"
  },
  "knob": {
    "British English": "The penis, or specifically the glans (slang, vulgar) (\"polishing the knob\" \n )",
    "Common": "a rounded door handle \n\nfool, idiot, dim-witted person"
  },
  "knock over": {
    "American English": "to rob (esp. a store, slang) (\"He knocked over a gas station.\")",
    "Common": "to tip over something \n\nto cause an object to fall over."
  },
  "knock up": {
    "British English": "to practise before tennis\nto awaken or summon by knocking",
    "Common": "to prepare quickly (\"Knock us up something to eat\" — L.M. Alcott)\nto impregnate, esp. unintentionally (slang, sometimes vulgar)"
  },
  "ladder": {
    "British English": "a run (vertical split) in the fabric of tights",
    "Common": "a vertical or inclined set of rungs or steps."
  },
  "lavatory": {
    "American English": "washbasin, place for washing",
    "British English": "toilet",
    "Common": "closet in passenger vehicles (e.g. trains) containing a toilet and \nwashbasin/sink."
  },
  "lay by": {
    "American English": "(n.) a last cultivating in the growing of a crop\n(v.) to cultivate (a crop) for the last time",
    "British English": "(n.) roadside parking or rest area for drivers",
    "Common": "(v.) to lay aside\nto stow"
  },
  "lay-by": {
    "American English": "(n.) a last cultivating in the growing of a crop\n(v.) to cultivate (a crop) for the last time",
    "British English": "(n.) roadside parking or rest area for drivers",
    "Common": "(v.) to lay aside\nto stow"
  },
  "lead": {
    "American English": "(n.) a clue or potential source of information (esp. in context of \njournalistic investigation) ",
    "British English": "(rhyming with \"speed\") a cable (US: cord), or a dog's leash",
    "Common": "to guide through"
  },
  "leader": {
    "American English": "a pipe for carrying water (\"rain water leader\")",
    "British English": "newspaper editorial\nmain violin in an orchestra (US: concertmaster)\nsee also Leader of the Opposition",
    "Common": "one who leads"
  },
  "lecturer": {
    "American English": "the entry-level academic rank at a university (below Assistant Professor, \nAssociate Professor, and Professor)",
    "British English": "the entry-level academic rank at a university (below Senior Lecturer, Reader, \nand Professor)",
    "Common": "someone who gives a lecture"
  },
  "lemonade": {
    "American English": "non-carbonated drink made by mixing lemon juice, sugar, and water (UK: traditional \nlemonade)",
    "British English": "clear, carbonated, lemon-flavoured drink similar to Sprite and 7 Up (lemon \nand lime flavoured)"
  },
  "let": {
    "American English": "(let out) to end (of school, meetings, etc.)",
    "British English": "to rent out (as real property, and denoting the transaction from the \nowner's perspective); Tenants \"take\" or \"rent\" the property being let. \n(\"rooms to let\")\n\n(n.) the act of renting; rented premises\n(let out) to reveal",
    "Common": "allow, give permission.\nleave (as in let him be or let it be)\nease (as in let up on the accelerator)\nindicate (as in don't let on)\na first bad serve which is allowed to be retaken, as in tennis, table \ntennis, and volleyball"
  },
  "levee": {
    "American English": "an embankment on a river (as the Mississippi River)\nthe steep bank of a river, or border of an irrigated field\n(esp. Southern & Western US) a landing place or quay",
    "British English": "an early afternoon assembly held by the King or Queen, to which only men \nwere admitted (Always levée, with accent)",
    "Common": "a reception in honour of a particular person"
  },
  "leverage": {
    "American English": "take advantage of a capability (business)\nthe use of debt finance (UK: gearing)\nknowledge not immediately revealed to be used to one's advantage ",
    "Common": "mechanical advantage of a lever"
  },
  "liberal (politics)": {
    "American English": "a person who advocates modern liberalism; see also Liberalism in the United \nStates for historic background",
    "British English": "a person who generally supports the ideas of the UK Liberal Democrats, a \ncentre left-party",
    "Common": "a person who holds the political ideals of Liberalism."
  },
  "life preserver": {
    "American English": "life vest, personal flotation device (UK: lifebelt or lifejacket)",
    "British English": "a type of weapon for self-defence (US: blackjack)"
  },
  "lift": {
    "American English": "an elevation in mood, \"I got a lift just talking with her.",
    "British English": "platform or cage moved vertically in a shaft to transport people and goods \nto various floors in a building (US: elevator)",
    "Common": "ride as a passenger in a vehicle (as in, to give someone a lift)\nitem placed in shoe to increase the height of the wearer, normally plural \n(lifts, elevator shoes)"
  },
  "line": {
    "American English": "a group of persons, usually waiting for something, arranged in order of \narrival (UK: queue)\na lie, short for a line of bull\na phrase used for hitting on women, short for pickup line\nto hit a line drive (a hard straight shot) in baseball",
    "British English": "(see also track)",
    "Common": "a breadthless length"
  },
  "liquor": {
    "American English": "a distilled beverage \n(hard liquor) strongly alcoholic beverage; spirits\n(liquor store) retail establishment selling liquor (usu. for consumption \noff the premises) (UK similar: off-licence) (\"I held up and robbed a hard \nliquor store\" – Paul Simon)\n(malt liquor) a type of beer with high alcohol content",
    "British English": "the broth resulting from the prolonged cooking of meat or vegetables. Green \nliquor is traditionally served with pie and mash in the East End of London"
  },
  "loaded": {
    "American English": "drunk or high",
    "Common": "the state of a firearm with bullets or shells in its firing chamber.\nbearing a load.\n(slang; of a person) rich"
  },
  "lolly": {
    "British English": "Frozen water-based dessert on a stick (US: popsicle).",
    "Common": "(short for lollipop) candy on a stick."
  },
  "lot": {
    "American English": "a measured plot of land; a portion of land set for a particular purpose (\"a \nbuilding lot\"), e.g. for parking (\"parking lot\") or selling (\"used car \nlot\") automotive vehicles. But also a \"vacant lot\"\na film studio",
    "Common": "(a lot) a great deal\na number of things (or, informal, people) taken collectively\nfate, fortune\na prize in a lottery\n(the lot) the whole thing"
  },
  "lounge": {
    "American English": "a bar",
    "British English": "a room for relaxation and entertainment in a house\n(lounge bar) part of a pub",
    "Common": "a room for relaxation in a public place"
  },
  "loveseat": {
    "American English": "a two-seater couch",
    "British English": "a seat which accommodates two people facing in opposite directions. Can be \nwooden or padded."
  },
  "lox": {
    "American English": "thin-sliced smoked salmon, commonly consumed on bagels; Yiddish from German \n'Lachs', salmon.",
    "Common": "liquid oxygen (engineering)"
  },
  "lugs": {
    "American English": "a lug nut fastens a wheel to the hub, (UK wheel nut).\na \"big lug\" is usually a term of endearment for a large shy, goofy man.",
    "British English": "ears (lugholes)",
    "Common": "a small projection (engineering)"
  },
  "lumber": {
    "American English": "(n.) timber that has been sawed and (partly) prepared for construction or \nwoodworking; hence lumberyard (UK: timberyard), lumber camp, \nlumberjack, lumberman, lumber wagon, lumber town, etc.\n(v.) to log and prepare timber\nto make a rolling sound (dated)",
    "British English": "(n.) disused items (as furniture); hence lumber room\n(v.) to encumber (as with such items) (\"I was lumbered with work\")",
    "Common": "(v.) to move awkwardly or heavily (\"he lumbered out the door\")"
  },
  "lush": {
    "American English": "an alcoholic especially female",
    "British English": "attractive (usu. used by women in reference to men – principally West \nCountry)",
    "Common": "luxuriant"
  },
  "mac": {
    "American English": "(Uncommon slang; proper n.) A term of informal address used with male \nstrangers; generally implies more unfriendliness or disapproval than \nthe more neutral 'pal' or 'buddy': \"Get your car out of my way, Mac!\" UK \ngenerally 'mate'. Cf. 'Jack.'\ntype of pasta (short form of macaroni) – as in 'mac and cheese'",
    "British English": "raincoat (short form of Mackintosh)",
    "Common": "(Mac) a brand of Apple Inc. computers (short form of Macintosh)"
  },
  "macintosh": {
    "British English": "raincoat (Mackintosh, often shortened to mac)",
    "Common": "Macintosh, a brand of Apple Inc. computers (often shortened to Mac)\n(wrongly) McIntosh Red, a type of apple"
  },
  "mackintosh": {
    "British English": "raincoat (Mackintosh, often shortened to mac)",
    "Common": "Macintosh, a brand of Apple Inc. computers (often shortened to Mac)\n(wrongly) McIntosh Red, a type of apple"
  },
  "mail": {
    "American English": "(v.) send a letter (UK: post or send); noun originated mail carrier & \nmailman (UK: postman), mailbox (UK: postbox; letter box), mail \nslot, mail drop, etc.",
    "British English": "(used in Royal Mail, the name of the British postal system; cf. postal)\n(Scot.) a payment (tax, rent, etc.)\n(Scot.) a travelling bag or pack",
    "Common": "(n.) the postal system of a nation\nletters, packages, etc. sent by post; as delivered to individual, orig. US, \nUK often post\n(n. & v.) e-mail, (n.) armour, as in \"chainmail"
  },
  "mailbox": {
    "American English": "an item of street furniture serving as a receptacle for outgoing mail (UK: post \nbox; letter box; pillar box); a receptacle for incoming paper mail \n(UK: letter box)",
    "Common": "a file for storing electronic mail (or related computing or voicemail usage)"
  },
  "main line": {
    "American English": "a railroad's primary track, or a primary artery, route, road, or connection\nPennsylvania Main Line\nmainline Protestant churches",
    "British English": "a major railway line (as the West Coast Main Line); compare trunk",
    "Common": "a major vein (as for drug injection purposes) (orig. 1930s US slang); also \nused as a v.; main line stars"
  },
  "mains": {
    "British English": "The domestic power supply",
    "Common": "water mains, the principal underground pipe for conveying water to \nresidential and business properties"
  },
  "major": {
    "American English": "(n.) a college/university student's main field of specialization (\"his major \nis physics\"); the student himself (\"he is a physics major\"); (v.) to pursue \na major (\"he majored in physics\") (compare minor; UK: compare read)\n(n.) rank between captain and Lieutenant Colonel in the air force (UK squadron \nleader) and in some police agencies (UK approx. superintendent).",
    "British English": "(in the past, in English public schools) used to denote the eldest of two \nor more pupils with the same surname (\"Bloggs major\") (US: Sr.)",
    "Common": "important or significant\n(n.) rank between captain and Lieutenant Colonel in the army and marines."
  },
  "majority": {
    "American English": "more than half of all votes, people, etc. (UK: absolute majority)",
    "British English": "the greatest number of votes\ndifference of votes between first and second place (US: plurality)"
  },
  "make out": {
    "American English": "to kiss (see Making out)\nto succeed or profit (\"She made out well on that deal.\") ",
    "Common": "to draw up, to seek to make it appear, to fabricate a story\nto see with difficulty; to understand the meaning of"
  },
  "marinara": {
    "American English": "a red sauce containing tomatoes and herbs, often with meat but never with \nseafood (UK: napolitana sauce)",
    "British English": "a sauce containing seafood, usu. in a tomato base"
  },
  "marquee": {
    "American English": "signage placed over the entrance to a hotel, theatre, or cinema\n(attrib.) the ability (of a show) to draw audience, \"box office\" (\"marquee \nvalue\")\na prominent celebrity or athlete (\"marquee player\")",
    "British English": "large, open-sided tent installed outdoors for temporary functions "
  },
  "mate": {
    "American English": "spouse or partner",
    "British English": "friend (US: pal or friend)\ninformal term of address (\"hello mate\")",
    "Common": "animal's sexual partner\ncheckmate, the winning of a game of chess\nan officer on a merchant ship"
  },
  "mcintosh": {
    "British English": "raincoat (Mackintosh, often shortened to mac)",
    "Common": "Macintosh, a brand of Apple Inc. computers (often shortened to Mac)\n(wrongly) McIntosh Red, a type of apple"
  },
  "mean": {
    "American English": "unpleasant, unkind, vicious ",
    "British English": "stingy, miserly, selfish",
    "Common": "of inferior quality, contemptible\na statistical average (see mean)"
  },
  "median": {
    "American English": "the portion of a divided highway used to separate opposing traffic (UK central \nreservation)",
    "Common": "a statistical average (see median)\ngeometric median\nmedian nerve"
  },
  "meet with": {
    "American English": "to have a meeting with (as people) (\"Vice president meets with Iraqi \nofficials\", CNN) (UK generally meet (transitive) or meet up with)",
    "Common": "to face (as a situation), experience (\"If you can meet with triumph and \ndisaster, and treat those two impostors just the same\" - Kipling); to \nencounter for the first time (How I Met Your Mother)"
  },
  "mezzanine": {
    "American English": "lowest balcony in a theatre, or the first few rows of seats thereof (UK \nusu. dress circle)",
    "Common": "intermediate floor between main floors of a building"
  },
  "mid-atlantic": {
    "American English": "middle of the Atlantic coast of the USA (exact definition of Mid-Atlantic \nStates may vary)",
    "British English": "in the middle of the Atlantic Ocean, half-way between UK & US; an \nEnglish-speaking accent with features of both British and American speakers"
  },
  "middle class": {
    "American English": "ordinary; not rich although not destitute, generally a positive term",
    "British English": "better off than 'working class', but not rich, i.e., a narrower term than \nin the U.S. and often negative"
  },
  "military": {
    "British English": "relating specifically to the British Army (dated)",
    "Common": "relating to armed forces in general"
  },
  "minor": {
    "American English": "(n.) secondary academic subject (compare major) (\"has a major in biology \nand a minor in English\"); (v.) to study as one's minor (\"she minored in \nEnglish\")\nminor league;",
    "British English": "(in the past, in English public schools) used to denote the youngest of two \nor more pupils with the same surname (\"Bloggs minor\") (US: Jr.)",
    "Common": "not very important\nsee minor (law), major and minor\n(n.) a person under the age of 18 years, generally, and for legal reasons \nmore specifically (as in \"the name of the defendant is withheld because he \nis a minor\"), or under an age legally required for certain behavior (such \nas purchasing alcohol), or under the age of consent."
  },
  "miss out": {
    "British English": "to omit",
    "Common": "to lose a chance; usu. used with on"
  },
  "mobile": {
    "British English": "mobile phone (US: cell phone)",
    "Common": "decorative structure suspended so as to turn freely in the air"
  },
  "mobile home": {
    "American English": "a type of manufactured dwelling transported to the home site using wheels \nattached to the structure",
    "British English": "a mobile, non-motorised piece of equipment with living facilities; a \ncaravan (q.v.)"
  },
  "momentarily": {
    "American English": "in a moment; very soon",
    "Common": "for a moment"
  },
  "mono": {
    "American English": "(n.) infectious mononucleosis, a disease caused by Epstein-Barr virus (UK: glandular \nfever)",
    "Common": "(adj.) monophonic (of reproduced sound, e.g. radio or CD player using a \nsingle speaker)\nmonochrome"
  },
  "moot": {
    "American English": "(adj.) irrelevant (\"a moot point\") (orig. legal, now in common use)",
    "British English": "(adj.) debatable (\"a moot point\")\n(v.) to bring up for debate\n\nsee also moot court"
  },
  "mortuary": {
    "American English": "funeral home, funeral parlour",
    "British English": "building or room (as in a hospital) for the storage of human remains (US: \nmorgue)"
  },
  "motor car": {
    "American English": "a self-propelled railway vehicle",
    "British English": "(formal) a car (motor vehicle) (US: automobile)"
  },
  "motorbike": {
    "American English": "a lightweighted, small motorcycle",
    "British English": "a motorcycle"
  },
  "motorcar": {
    "American English": "a self-propelled railway vehicle",
    "British English": "(formal) a car (motor vehicle) (US: automobile)"
  },
  "mp": {
    "American English": "Northern Mariana Islands (ISO 3166-1 alpha-2 country code and U.S. postal \nabbreviation MP)\nMissouri Pacific Railroad (reporting mark MP)",
    "British English": "Member of Parliament",
    "Common": "Military police\nother expansions"
  },
  "muffin": {
    "American English": "a confection similar to a cupcake but unfrosted and less sweet, sometimes \neven savory (e.g., corn muffin) (UK: American muffin)",
    "British English": "a thick round baked yeast roll, usually toasted and served with butter (US: English \nmuffin)"
  },
  "muffler": {
    "American English": "device to silence an automobile (UK: silencer) or gramophone",
    "British English": "a scarf"
  },
  "mum": {
    "American English": "chrysanthemum",
    "British English": "mother, as addressed or referred to by her child (US: mom)",
    "Common": "silent, as in \"keep mum"
  },
  "mummy": {
    "British English": "mother, as addressed or referred to by her child (US: mommy)",
    "Common": "Ancient Egyptian mummy, a chemically preserved corpse\nany preserved corpse (Mexican mumia)"
  },
  "mush": {
    "American English": "thick cornmeal porridge\ncommand to dogs to start pulling a sledge \n\n",
    "British English": "(informal) term of address, often hostile (possibly from Romany \"man\")\n\n\n(informal) face",
    "Common": "a soft wet mass"
  },
  "napkin": {
    "American English": "piece of paper used to protect garments, (typically sanitary napkin) \nabsorbent piece of material worn by a woman while menstruating (UK usu. sanitary \ntowel)",
    "British English": "nappy (q.v.), diaper (dated, not well known)",
    "Common": "piece of material used to protect garments from spilled food or to remove \nfood residues from around the mouth"
  },
  "nappy": {
    "American English": "twisted or kinked, considered insulting when applied to hair, esp. that of \npersons of African descent (also called napped)",
    "British English": "folded cloth or other absorbent material drawn up between the legs and \nfastened around the waist, usu. worn by infants to counter incontinence \n(US: diaper)"
  },
  "natter": {
    "American English": "(natter on) Constant, annoying chatter",
    "British English": "Idle, pleasant chatter (US: small talk, chitchat)"
  },
  "nervy": {
    "American English": "bold, presumptuous",
    "British English": "nervous, fidgety"
  },
  "nhs": {
    "American English": "The National Honor Society, an American scholastic organization open to \nhigh schoolers (in grades 10 - 12, see grade) who excel in academics, \nleadership skills, citizenship, and character.",
    "British English": "The National Health Service, a government-run health care plan funded by \nBritish taxpayers and available to all citizens."
  },
  "nick": {
    "British English": "prison or police station (slang)\nto steal (slang)\nto arrest (slang)",
    "Common": "small cut\n(computer jarg.) nickname\nthe nick of time = \"just in time"
  },
  "nickel": {
    "American English": "5 cent coin (also 'nickle')",
    "Common": "the metallic element (Ni)"
  },
  "nonce": {
    "British English": "a sex offender; in particular, a child molestor (slang)",
    "Common": "the present moment\na word used only once\na single-use token in a cryptographic protocol"
  },
  "nonplussed": {
    "American English": "unfazed",
    "Common": "bewildered, unsure how to respond"
  },
  "nor": {
    "British English": "neither (\"'She didn't come.' 'Nor did he.'\")\n(Scotland & Ireland) than (\"someone better nor me\")",
    "Common": "and not, or (not) (\"neither sad nor happy\"; \"he never eats, nor does he \never feel hungry\")"
  },
  "notion": {
    "American English": "small item, particularly of the type used in sewing",
    "Common": "an idea, impression, whim, theory or conception"
  },
  "oblique": {
    "British English": "slash symbol (/)",
    "Common": "a muscle neither parallel nor perpendicular to the long axis of a body or \nlimb"
  },
  "office": {
    "American English": "the place where a physician or dentist practices (UK: surgery)",
    "British English": "(cap.) a government department (\"Colonial Office\", \"Foreign and \nCommonwealth Office\")\n(pl.) the outbuildings and dependencies of a dwelling (as an estate)",
    "Common": "a place of business; a position or function\na particular division of an administrative unit (\"Patent Office\")"
  },
  "on the telephone": {
    "British English": "having a working telephone (now rare, since most people do)",
    "Common": "talking on the telephone"
  },
  "optician": {
    "American English": "professional who dispenses lenses and spectacles",
    "British English": "(dispensing optician) professional who dispenses lenses and spectacles\n(ophthalmic optician) professional who tests eyes and prescribes lenses \n(US: optometrist)"
  },
  "optometrist": {
    "American English": "in the U.S., optometrist and ophthalmologist are separate, opticians are \nthe same as UK dispensing opticians",
    "Common": "ophthalmic optician"
  },
  "oriental": {
    "American English": "a person from anywhere in Asia, other than Western Asia or Russia. \nConsidered pejorative. Polite US speakers use Asian instead, even for \npeople from China and Korea.",
    "British English": "a person from East/SouthEast Asia. Contrast 'Asian', meaning a person from \nSouth Asia.",
    "Common": "a thing from Asia e.g. \"Oriental carpet\"."
  },
  "ouster": {
    "American English": "the act of forcing the removal of someone from a position of influence or \npower",
    "British English": "a person who ousts"
  },
  "outhouse": {
    "American English": "outside toilet",
    "British English": "building outside but adjacent to or attached to a main dwelling e.g. a shed \nor barn"
  },
  "outside lane": {
    "American English": "the part of the road nearest the edge, used especially by slower-moving \nvehicles (UK: inside lane)",
    "British English": "the part of the road nearest the vehicles going in the opposite direction, \nused especially by faster vehicles (US: inside lane)",
    "Common": "(in both cases the term applies to the rightmost lane in the direction \nconcerned)"
  },
  "overalls": {
    "American English": "(in pl.) sturdy protective bib trousers; dungarees, bib overalls",
    "British English": "loose-fitting protective outer garment (US: coverall)"
  },
  "pacifier": {
    "American English": "rubber teat for babies (UK: dummy)",
    "Common": "something or somebody that brings peace"
  },
  "panda": {
    "British English": "(panda car) police car (slang) (US: zebra, black-and-white)",
    "Common": "Type of animal, e.g. giant panda, red panda"
  },
  "pantomime": {
    "American English": "silent acting, usu. without props, by mime artist (UK: mime)",
    "British English": "A form of comedic, usually family oriented musical stage production."
  },
  "pants": {
    "American English": "Outerwear from the waist to the ankles (trousers) \n\n(wear the pants in the family) be masculine, be the breadwinner, perform \nthe husband's role (derog.) (spoken esp. of a wife, usage becoming obsolete)",
    "British English": "underpants (also briefs or boxers)\nof poor quality (slang)\n(of a situation) bad, unfortunate (slang). Although refers to trousers in \nparts of Northern England."
  },
  "paraffin": {
    "American English": "a waxy fraction of petroleum commonly used to make candles (UK: paraffin \nwax)",
    "British English": "kerosene"
  },
  "paralytic": {
    "British English": "extremely drunk (slang)",
    "Common": "relating to or affected by paralysis"
  },
  "park": {
    "American English": "any of various areas designated for certain purposes , such as amusement \npark, theme park, industrial park, trailer park, memorial park (a \ncemetery)\n(sports) enclosed ground for ball games, oftenest the baseball park\na level valley among the mountains (as the Rocky Mountains); also, an area \nof open grassland, or one for cultivation, esp. if among the woods",
    "British English": "a tract of ground kept in its natural state, about or adjacent to a \nresidence, as for the preservation of game, for walking, riding, or the like\n(esp. Scotland) a pasture or field\narea for the parking of motor vehicles (\"a car park\")\n(sports) a soccer or rugby field\nsee also country park",
    "Common": "outdoor area for recreational uses (\"Central Park\", \"Hyde Park\")\nnational park (orig. US)"
  },
  "parking": {
    "American English": "To engage in romantic intimacy in a parked vehicle. \n(regional) turf strip between sidewalk and street (many \nregional synonyms exist; there is no standard name).",
    "Common": "the act of parking (a vehicle)"
  },
  "parkway": {
    "American English": "generally, an open landscaped limited-access highway (q.v.) (see article)\nregional term for parking (q.v.)",
    "British English": "a railway station with parking areas intended for commuters"
  },
  "pass out": {
    "British English": "to graduate from a training centre of a disciplined service (military, \npolice etc.)",
    "Common": "to become unconscious; to distribute"
  },
  "patience": {
    "British English": "any of a family of one-player card games (US: solitaire, q.v.)",
    "Common": "the quality of being patient"
  },
  "pavement": {
    "American English": "the road surface ",
    "British English": "a paved strip at the side of a road, reserved for pedestrians (US: \nsidewalk)"
  },
  "pc": {
    "British English": "police constable",
    "Common": "politically correct\npersonal computer\nother expansions"
  },
  "pecker": {
    "American English": "penis (slang)",
    "British English": "courage or pluck; literally, chin (slang, used in the phrase \"keep your \npecker up\", remain cheerful or, literally, \"keep your chin up\")"
  },
  "peckish": {
    "American English": "irritable or angry (rare)",
    "British English": "slightly hungry, snackish "
  },
  "peg": {
    "American English": "(n.) a throw (as in baseball)\n(v.) to identify or classify (someone as being something) ",
    "British English": "(n.) (often clothes peg) a wooden or plastic device for fastening laundry \non a clothesline (US: clothespin)\n(v.) to fasten (laundry) on a clothesline",
    "Common": "(n.) a cylindrical wooden, metal etc. object used to fasten or as a bearing \nbetween objects\n(v.) to fix or pin down\n(v.) to hit with a projectile"
  },
  "penny": {
    "American English": "(pl. pennies) a cent (esp. the coin)\n\n(penny-ante) trivial, small-time.",
    "British English": "(pl. pence, or, when referring to coins, pennies) 1/100 (formerly, \n1/240) of the pound sterling",
    "Common": "a small amount usu. in contrast to a larger one (\"penny wise, pound \nfoolish\", common phrase in both British and American usage)"
  },
  "period": {
    "American English": "punctuation mark used at the end of a sentence\n(interj.) used at the end of a statement to emphasise its finality (\"You \nare not going to that concert, period!\") (UK: full stop for both senses)",
    "Common": "section of time\nmenstruation\nrow of the periodic table"
  },
  "pint": {
    "American English": "16 US fluid ounces (about 473 ml, 16.65 imp fl oz or 5⁄6 imp pt)",
    "British English": "20 imperial fluid ounces (about 568 ml, 19.2 US fl oz or 6⁄5 US pt),\npint of beer, lager or cider (\"Pour us a pint\")"
  },
  "piss": {
    "British English": "(on the piss) drinking heavily, going out for the purpose of drinking \nheavily\n(to piss off) to go away",
    "Common": "urine (usu. vulgar)\nurinate (usu. vulgar)\nlow-quality beer (vulgar)\n(to piss off) to incite to anger, to enrage\n(to take the piss) to mock"
  },
  "pissed": {
    "American English": "angry, irritated",
    "British English": "intoxicated, drunk(often pissed as a newt; sometimes pissed up)",
    "Common": "urinated (usu. vulgar)\n(pissed off) angry, irritated"
  },
  "pitch": {
    "American English": "in baseball, the delivery of a baseball by a pitcher to a batter\n(slang) to dispose of, to throw away\na brief summary of a broader work or idea meant to be attractive to a third \nparty e.g. \"What's the pitch?",
    "British English": "outdoor site for a stall or some other business\nsite for a tent (US: campsite, q.v.)\nplaying field for a particular sport (football pitch, rugby pitch, cricket \npitch, etc.) (US: field)",
    "Common": "an attempt to persuade somebody to do something, usu. to accept a business \nproposal\na sticky black substance obtained from tar\nthe slope of a roof\nrotation on a lateral axis (as an aircraft or spacecraft)\nthe frequency of a sound\nto erect a tent\nto discard (in various card games, e.g., bridge)"
  },
  "pitcher": {
    "American English": "any container with a handle and lip or spout for liquids (UK: jug)\nbaseball player who pitches (throws) baseball towards the batter (UK: \nbowler)\n(LGBT slang, from baseball) a top or dominant partner",
    "British English": "a large container (often earthenware), usually round with a narrow neck, \nused for holding water or another liquid (US: jug)"
  },
  "pitman": {
    "American English": "a connecting rod (as in a sawmill)\n\na master barbecuer, the person responsible for managing a barbecue pit.",
    "British English": "a miner working in a pit",
    "Common": "the man that stands in a pit when sawing timber (with another man standing \nabove)"
  },
  "plant": {
    "British English": "machinery, industrial equipment",
    "Common": "a vegetable organism, a factory\nan undercover operative"
  },
  "plaster": {
    "British English": "an adhesive bandage placed on a minor cut or scrape (UK also: sticking/sticky \nplaster, Elastoplast; US: Band-Aid);\na cast of plaster of Paris (\"a leg in plaster\")",
    "Common": "a pastelike mixture that hardens when applied to walls and ceilings;\n(plastered) drunk"
  },
  "platform": {
    "British English": "when appended with a number signifies a specific platform in a station (US: \ntrack)",
    "Common": "a raised elongated structure along the side of a track in a railway \nstation; a raised level surface; a raised level surface from which a \nspeaker addresses an audience"
  },
  "plimsol": {
    "British English": "noun: a rubber-soled cloth shoe; a sneaker.",
    "Common": "waterline to show the level the water should reach when the ship is \nproperly loaded, named after Samuel Plimsoll"
  },
  "plimsole": {
    "British English": "noun: a rubber-soled cloth shoe; a sneaker.",
    "Common": "waterline to show the level the water should reach when the ship is \nproperly loaded, named after Samuel Plimsoll"
  },
  "plimsoll": {
    "British English": "noun: a rubber-soled cloth shoe; a sneaker.",
    "Common": "waterline to show the level the water should reach when the ship is \nproperly loaded, named after Samuel Plimsoll"
  },
  "point": {
    "American English": "piece of land jutting into any body of water, esp. a river (\"points and \nbends\"); a prominence or peak (of mountains, hills, rocks), also an \nextremity of woods or timber",
    "British English": "(pl.) railway turnout (US: switch)\n(power point) electrical socket (US: outlet)\ncape or promontory jutting into sea\n(full point) syn. with full stop (q.v.)",
    "Common": "Many, many uses; see Point (disambiguation)"
  },
  "pontoon": {
    "British English": "blackjack, twenty-one",
    "Common": "a buoyant device"
  },
  "pop": {
    "American English": "father (colloquial)\n(slang) to shoot; to kill, esp. with a gun\n(n.) a sudden increase (as in price) (orig. Stock exchange) ",
    "British English": "to place or put (\"I popped the book on the table\")",
    "Common": "a sharp explosive sound (noun and verb)\npop music\ncarbonated soft drink (U.S. usage is regional; also: soda, soda pop) \n\n(pop in) to arrive unexpectedly"
  },
  "porter": {
    "American English": "railway sleeping car attendant",
    "British English": "doorman, gatekeeper, or building maintenance worker ",
    "Common": "bearer of burdens\na style of beer"
  },
  "post": {
    "American English": "to announce (\"the company posted a first-quarter profit of $100 million\")\nto inform (\"keep me posted\") ",
    "British English": "to send a letter (US: mail)",
    "Common": "to display on a noticeboard or bulletin board, Internet forum, etc."
  },
  "postal": {
    "American English": "(used in the name of the United States Postal Service; see mail)\n(going postal) to commit a sudden, irrational burst of rage (slang)",
    "Common": "related to the paper mail system"
  },
  "pound sign": {
    "American English": "number sign, octothorpe (#) (UK: hash sign)",
    "Common": "symbol of the pound sterling (£) (GBP)"
  },
  "precinct": {
    "American English": "subdivision of a county, town, etc. for the purpose of conducting elections\nsection of a city patrolled by a police unit; the police station in such a \nsection",
    "British English": "a pedestrian zone in a city or town (\"a shopping precinct\")",
    "Common": "a space enclosed (as by walls)"
  },
  "prep school": {
    "American English": "fee-paying private senior school (which prepares students for college) (UK: public \nschool or independent school)",
    "British English": "(in England) fee-paying private junior school (which prepares students for public \nschool)"
  },
  "preparatory school": {
    "American English": "fee-paying private senior school (which prepares students for college) (UK: public \nschool or independent school)",
    "British English": "(in England) fee-paying private junior school (which prepares students for public \nschool)"
  },
  "pressman": {
    "American English": "one who operates a printing press",
    "British English": "a journalist employed by a newspaper (US: newspaperman/newspaperwoman \n(rare), or by specific job)"
  },
  "pressurise": {
    "British English": "insistently influence, or attempt to influence, someone else (\"The manager \npressurised his assistant to work late\") (US & UK also: pressure)",
    "Common": "subject a volume of gas or liquid to physical pressure, as the atmospheric \npressure within an aircraft (\"To protect the Aircraft's structure, the \nplane was pressurized to 8000 ft.\")"
  },
  "pressurize": {
    "British English": "insistently influence, or attempt to influence, someone else (\"The manager \npressurised his assistant to work late\") (US & UK also: pressure)",
    "Common": "subject a volume of gas or liquid to physical pressure, as the atmospheric \npressure within an aircraft (\"To protect the Aircraft's structure, the \nplane was pressurized to 8000 ft.\")"
  },
  "presswoman": {
    "American English": "one who operates a printing press",
    "British English": "a journalist employed by a newspaper (US: newspaperman/newspaperwoman \n(rare), or by specific job)"
  },
  "proctor": {
    "American English": "an examination supervisor (UK: invigilator)",
    "British English": "variant of the word procurator, is a person who takes charge or acts for \nanother."
  },
  "professor": {
    "American English": "academic faculty of all ranks: Assistant Professor, Associate Professor, \nand (Full) Professor (the latter being largely equivalent to the UK meaning)",
    "British English": "holder of a chair in a university, the highest academic rank (the usual \norder being Lecturer, Senior Lecturer, Reader, Professor)"
  },
  "projects": {
    "American English": "publicly subsidized, low-income housing development – see public housing \n(UK: cf. s.v. estate)",
    "Common": "plans; temporary endeavors undertaken to create a unique product or service"
  },
  "prom": {
    "American English": "dance/party held for pupils to celebrate the end of a school \nyear/graduation, a shortening of 'promenade', a formal parade ",
    "British English": "shortening of 'promenade concert', originally one of a series of concerts (The \nProms) held as part of a classical music festival that takes place in the \nlate summer based around the Royal Albert Hall in London, but now also used \nelsewhere\nshortening of 'promenade', a raised walk next to the beach in seaside \nresorts"
  },
  "protest": {
    "American English": "to campaign or demonstrate against: \"The prisoner's friends protested the \njudge's decision.\" (UK: protest against)",
    "British English": "to forcefully express an opinion, to advocate: \"The prisoner protested his \ninnocence."
  },
  "public school": {
    "American English": "tax-supported school controlled by a local governmental authority (UK: state \nschool) (also in Scotland & Northern Ireland)",
    "British English": "long-established and prestigious fee-paying independent school in England \nor Wales (note that not all private schools are classified as public \nschools) (US: prep school)"
  },
  "pudding": {
    "American English": "a creamy dessert (UK: blancmange)\nterm of affection",
    "British English": "dessert course of a meal\na heavy dessert or main course (e.g. steak and kidney pudding), often suet\n-based\nused in the name of some other savoury dishes (e.g. black pudding, pease \npudding)"
  },
  "pull": {
    "American English": "to carry out a task (esp. milit.) (\"to pull guard duty\") \n\nauthority, influence (\"He's got pull in that office.\") (pull rank) the \nact of a supervisor exercising authority over a subordinate.",
    "British English": "to persuade someone to be one's date or sex partner (slang)\n(on the pull) seeking a date or sex partner (slang)",
    "Common": "to move something towards oneself\nan injury to a muscle, tendon, or ligament, e.g. \"I've pulled my hamstring."
  },
  "pull off": {
    "British English": "(of a vehicle) to start moving",
    "Common": "to succeed in a task"
  },
  "punk": {
    "American English": "worthless person; from conventional societal perspective any young outlaw \nor tough; from perspective of outlaws and others valuing physical fighting, \na coward\nto play a prank or practical joke on someone",
    "Common": "follower of Punk rock"
  },
  "purse": {
    "American English": "handbag",
    "British English": "feminine money container or wallet (US: coin purse)",
    "Common": "in boxing etc., the money to be awarded in a prize fight"
  },
  "pussy": {
    "American English": "a coward (vulgar and highly derogatory)",
    "Common": "a cat (becoming less common in the U.S., due to the other meanings)\nSlang term for vagina"
  },
  "pylon": {
    "American English": "traffic cone; temporary traffic lane separator.\nsupport structure for suspension bridge or highway",
    "British English": "electricity pylon, part of an electric power transmission network (US: \nmast or transmission tower)",
    "Common": "A large architectural feature, usually found as one of a pair at the \nentrance to ancient Egyptian temples - see Pylon (architecture)"
  },
  "quart": {
    "American English": "1/4 (US) gallon or 2 (US) pints. Liquid measure equal to 0.946 litres (5/6 \nof a British quart).",
    "British English": "1/4 (UK) gallon or 2 (UK) pints. Liquid measure approximately 1.136 litres \n(6/5 of an American quart)."
  },
  "quarter": {
    "American English": "25 cents (a fourth of a dollar)",
    "Common": "one of four equal parts into which something is divided, as a quarter-hour \nor, especially for financial purposes, a quarter of a year; in generic \nusage (as in fractions), US usu. fourth"
  },
  "queue": {
    "British English": "a group of persons, usually waiting for something, arranged in order of \narrival (US: line)",
    "Common": "an ordered sequence of objects, from which the first one in is also the \nfirst one out (cf. Queue (data structure))"
  },
  "quid": {
    "British English": "colloquial term for pound sterling (plural is quid also; in Ireland it \nreferred to the punt and now refers to the euro) (related US: buck)",
    "Common": "a measure (mouthful) of chewing tobacco"
  },
  "quite": {
    "British English": "to some extent or degree, e.g. in the phrase \"quite good\" meaning \n\"mediocre, acceptable\" or \"good, well done\" (a meiotic usage, depending on \nvoice intonation) \n\nagreeing with a given statement, often expressing reluctant agreement or \ndisbelief (\"I'm innocent, and this document proves it!\" \"Quite.\") according \nto intonation)",
    "Common": "to the fullest extent or degree (\"All art is quite useless\" – Oscar Wilde)\nto a great extent or degree"
  },
  "rabbit": {
    "American English": "(rabbit ears) (slang) TV antenna (usage becoming obsolete)",
    "British English": "(v.) (slang) to talk at length, usually about trivial things; usually to \n'rabbit on' (Cockney rhyming slang Rabbit and pork = talk)",
    "Common": "(n.) the animal rabbit, a lagomorph"
  },
  "railroad": {
    "American English": "the general term for the system of mass transit using trains running on \nrails: see usage of the terms railroad and railway\n(v.) to work on the railroad\nto transport by railroad\nsee also at underground",
    "British English": "tramway (obsolete)",
    "Common": "(v.) to coerce\nto convict with undue haste or with insufficient evidence"
  },
  "railway": {
    "American English": "tramway",
    "British English": "the general term for the system of mass transit using trains running on \nrails: see usage of the terms railroad and railway"
  },
  "raisin": {
    "American English": "any dried grape",
    "British English": "(UK usage excludes currants and sultanas)",
    "Common": "a large dark grape, dried"
  },
  "rambler": {
    "American English": "a style of house, usu. a ranch-style house\n(see also Rambler (automobile), Nash Rambler)",
    "British English": "one that rambles (as a hiker), see Ramblers",
    "Common": "a type of rose\none who talks excessively, often without making cohesive points (to ramble \non)"
  },
  "randy": {
    "American English": "a male or female given name or nickname deriving from the names Randall, \nRandolph, or Miranda",
    "British English": "a slang term meaning sexually aroused (American horny)"
  },
  "range": {
    "American English": "a cooking stove with an oven and burners on the top surface\nan open area for the grazing of livestock\na series of townships (q.v.), a Public Land Survey System unit of land east \nor west from a Principal meridian",
    "British English": "a line, collection, etc. of products or merchandise, as in top of the \nrange (US: top of the line)\na type of kitchen stove like that featured on the TV programme The 1900 \nHouse",
    "Common": "a series of things in a line (as mountains)\n\na sequence or scale between limits\na place where shooting is practised and the distance a projectile will \ntravel, as in Maximum Effective Range.\nan area over which a species of animal or plant is found"
  },
  "raunchy": {
    "American English": "foul-smelling, dirty\n\nraunch (n.): stench, miasma",
    "Common": "Lewd, vulgar, sexually explicit"
  },
  "read": {
    "British English": "to study a subject at university (\"he is reading physics\") (roughly \napproximate US: major (in))",
    "Common": "to peruse written material"
  },
  "reader": {
    "American English": "a teaching assistant who reads and grades examination papers.",
    "British English": "the second highest academic rank at a university, below professor (US \nequivalent: associate professor)",
    "Common": "one who reads"
  },
  "receptionist": {
    "British English": "hotel reservation desk worker (US: clerk) see also concierge",
    "Common": "front desk employee in business establishments, organisations, or hospitals"
  },
  "recess": {
    "American English": "pause between classes at school (UK: break, playtime, Lunchtime)",
    "Common": "remission or suspension of business or procedure"
  },
  "redcap": {
    "American English": "a baggage porter (as at a train station)",
    "British English": "a military police officer"
  },
  "redundant": {
    "British English": "laid off from employment, usu. because no longer needed (\"The company made \n100 workers redundant\") (US: laid off)",
    "Common": "unnecessary; repetitive"
  },
  "regular": {
    "American English": "of an ordinary kind; also, nice or agreeable (\"a regular guy\")\n\nof an ordinary or medium size \nunmodified, especially non-dietary/sugar-free/fat-free \nnon-decaffeinated coffee\nlowest grade of gasoline (historically: leaded gasoline)",
    "Common": "normal, customary\nfollowing a uniform pattern in space or time\n(of a geometric shape) having equal sides and angles\nfrequent\none who frequents a place\na full-time professional member of a military organisation (see Structure \nof the British Army and Regular army) (US: active duty)"
  },
  "remit": {
    "British English": "(n.) set of responsibilities (\"within my remit\"; \"to have a remit\") \n(pronounced /ˈriːmɪt/)",
    "Common": "(v.) to defer; in law, to transfer a case to a lower court; to send money; \nto cancel. (pronounced /rɪˈmɪt/)"
  },
  "rent": {
    "American English": "to pay money in exchange for the right to use moveable property such as a \ncar (BrE \"hire\")",
    "Common": "to pay money in exchange for the right to use a house, land or other real \nproperty (BrE \"let\")"
  },
  "restroom": {
    "American English": "a room in a public place, containing a toilet",
    "British English": "a room for staff to take their breaks in; a staffroom (US: breakroom)"
  },
  "retainer": {
    "American English": "a device for straightening teeth (UK: brace)",
    "Common": "amount of money paid in order to retain the services of another, a person \nwho part of a retinue"
  },
  "retreat": {
    "American English": "a period of group withdrawal for study or instruction under a group leader",
    "Common": "(v.) to go backwards, especially (military) to move away from the enemy; to \nwithdraw\n(n.) a period of withdrawal from society for prayer or meditation"
  },
  "review": {
    "American English": "to study again (as in preparing for an examination) (UK: revise), hence \nreview (n.)",
    "Common": "to reassess, inspect, perform a subsequent reading\nto write a review"
  },
  "revise": {
    "British English": "to study again (as in preparing for an examination) (US: review), hence \nrevision",
    "Common": "to inspect, amend, correct, improve, esp. written material"
  },
  "rider": {
    "American English": "a person who travels on a train or bus (UK: passenger)",
    "Common": "a person who rides a horse, bicycle or motorcycle\nan addition or amendment to a document or law\na condition or proviso"
  },
  "ring": {
    "American English": "(ring up) to total up a customer's purchases on a cash register",
    "British English": "to call (someone) by telephone",
    "Common": "to sound a bell"
  },
  "rise": {
    "British English": "an increase in wages (US: raise)",
    "Common": "an increase in amount, value, price, etc."
  },
  "roach": {
    "American English": "Cockroach (colloquial).\nThe extinguished remnants of a marijuana joint",
    "British English": "The assembled filter tip of a marijuana joint",
    "Common": "Fish including members of the family Cyprinidae"
  },
  "roast": {
    "American English": "(n.) an event where an individual is ridiculed for the sake of comedy; (v.) \nto host or perform such an event",
    "British English": "(colloquial) to reprimand severely.",
    "Common": "(v.) to cook in an oven; (n.) meat so cooked"
  },
  "rock": {
    "British English": "hard candy in cylindrical form often sold at holiday locations and made so that the location's name appears on the end even when broken. (US: no exact equivalent, but similar to a candy cane"
  },
  "rocket": {
    "British English": "An edible salad green, called arugula in American English.",
    "Common": "A vehicle that obtains thrust from a rocket engine"
  },
  "roommate": {
    "American English": "(also roomie) a person with whom one shares a house or apartment (UK: \nhousemate or flatmate)",
    "Common": "a person with whom one shares a bedroom"
  },
  "rotary": {
    "American English": "a circular road intersection (US also traffic circle, UK usu. roundabout; \nsee articles)",
    "Common": "a machine acting by rotation\n(cap.) organisation whose members comprise Rotary Clubs"
  },
  "roundabout": {
    "American English": "a type of men's jacket used in the past (see e.g. Mark Twain)",
    "British English": "a merry-go-round",
    "Common": "a detour or circuitous path\na circular road intersection"
  },
  "row": {
    "American English": "a series of prison cells (\"death row\")\na particular street or area of a town (as in skid row, dilapidated \nneighbourhood haunted by vagrants, misfits, etc.)\na series of row houses\n(row house) town house, q.v.",
    "British English": "(Pronounced /ˈraʊ/, to rhyme with \"cow\")\na noisy quarrel ; a continual loud noise (\"Who's making that row?\")",
    "Common": "(Pronounced /ˈroʊ/, to rhyme with \"toe\")\na line of objects, often regularly spaced (as seats in a theatre, vegetable \nplants in a garden etc.)\n\na line of entries in a table, etc. (as opposed to a column)\nan instance of rowing (as in a boat)"
  },
  "rubber": {
    "American English": "condom\n\n(rubbers) waterproof boots (UK: wellingtons, wellies)",
    "British English": "pencil eraser",
    "Common": "the duration of a match in certain games (e.g., bridge)"
  },
  "rug": {
    "British English": "a (usually thick) piece of fabric used for warmth (especially on a bed); \nblanket",
    "Common": "a small covering for a floor\n(slang) a wig; hairpiece"
  },
  "run": {
    "American English": "(v.) to propose (someone) as a candidate\nto drive past (\"to run a red light\")\nto hunt (as the buffalo or the deer)\n(n.) an instance of running for office\na creek (q.v.)",
    "British English": "(n.) a leisure drive or ride (\"a run in the car\")",
    "Common": "(v.) senses orig. US and now common are: to be a candidate in an election \n(UK also stand); to manage or provide for (a business, a family, etc.); \nthe idioms run scared, run into. More s.v. home run; see wiktionary \nfor additional meanings, a type of cage which is made so that animals (e.g. \nhamsters, rabbits, guinea pigs, etc.) can run around in it."
  },
  "run-in": {
    "American English": "an argument or altercation \na chance meeting (negative connotation)",
    "British English": "the final part of a race; approach to something, also run-up (q.v.)"
  },
  "run-up": {
    "American English": "a sudden increase (as in price) (orig. Stock exchange) ",
    "British English": "the period preceding an event (as an election) ",
    "Common": "the act of running up"
  },
  "rundown": {
    "American English": "a type of play in baseball\ntired, depressed.",
    "British English": "a reduction (as of an establishment)",
    "Common": "a detailed summary (orig. US slang)"
  },
  "runner": {
    "British English": "to do a runner is to leave suddenly without notice, typically from a taxi \nor restaurant without payment",
    "Common": "a competitor in a race"
  },
  "saloon": {
    "American English": "bar, especially in the American Old West\n\nbar that serves only spirits and no food\na room in a house used for receiving guests; a salon",
    "British English": "closed car having two or (usu.) four doors, a front and rear seat and a \nseparate boot/trunk (US: sedan)\n(saloon bar) posh bar within a pub or hotel\npassengers' lounge on a liner or luxury train (US approx.: parlor car)",
    "Common": "officers' dining room on a merchant ship"
  },
  "scalp": {
    "American English": "to resell (as tickets) at higher prices (UK: tout)\n\nto trade (as stocks) for quick profits",
    "Common": "to cut the scalp off; to take something away \n\n(n.) trophy, spoils of victory (informal)"
  },
  "scheme": {
    "British English": "official systematic plan (as of the government) (\"a pension scheme\")\n(Scotland) Low-cost public housing (US: project)",
    "Common": "a plan, often secret or devious; a plot (\"criminal scheme\")"
  },
  "school": {
    "American English": "any educational institution; in school: state of being a pupil in any \nschool normally serving minor children of any age, or in a college or \nuniversity at any level; at school: usually, physically present on \ncampus. (UK: at school for both)",
    "British English": "place of primary or secondary education",
    "Common": "grouping of departments or large department within a university faculty \n(among other meanings, e.g., a group of experts sharing perspective or \nmethods, or a group of fish)"
  },
  "scrappy": {
    "American English": "bellicose or fightingly determined\n\na scrappy player is one who compensates for a lack of size or speed with \ngrit and determination.",
    "British English": "not neatly organised or poor\n\na scrappy player is one who sometimes plays well, but often plays badly.",
    "Common": "fragmentary"
  },
  "second": {
    "British English": "to transfer temporarily to alternative employment (pronounced /sɨˈkɒnd/, to \nrhyme with \"beyond\")",
    "Common": "to endorse, support, or bring reinforcements"
  },
  "section": {
    "British English": "to detain under the Mental Health Act 1983\nOn section, detained in a mental hospital.",
    "Common": "to cut or slice into sections"
  },
  "sedan": {
    "American English": "a common car body style (UK: saloon, q.v.)",
    "Common": "a chair or windowed cabin, carried by at least two porters in front and \nbehind"
  },
  "seeded": {
    "American English": "having had the seeds removed (uncommon usage) (also seedless, used in UK)",
    "British English": "with the seeds left in"
  },
  "semi": {
    "American English": "semi-trailer truck (UK: articulated lorry)",
    "British English": "semi-detached house (US: duplex), semi-erection (vulgar)"
  },
  "series": {
    "American English": "all of the episodes of a particular television program",
    "British English": "a single batch of episodes of a television programme (US: season)",
    "Common": "a complete production, i.e. the programme itself"
  },
  "set square": {
    "American English": "a T-square (also used in technical drawing)",
    "British English": "a triangular object used in technical drawing (US: triangle)"
  },
  "shade": {
    "American English": "window blind \n\na sneer, or derisive remark (slang, especially as in \"throw shade\")",
    "Common": "penumbra, partial obscurity; nuance\n(pl.) sunglasses (orig. US); reminder of the past"
  },
  "shag": {
    "American English": "(v.) to chase after; to chase and fetch (as a fly ball in baseball)\na style of long hair with numerous layers (not matted or untidy)\na kind of a dance, associated with \"beach music,\" esp. from the Carolinas \n(orig. US)",
    "British English": "to copulate, or copulate with",
    "Common": "a seabird (various members of the cormorant family)\na kind of fabric with a thick, long strands; often used in carpets\nlong, matted hair (cf. Shaggy from the Scooby-Doo cartoon)\na type of shredded coarse tobacco"
  },
  "shattered": {
    "British English": "exhausted",
    "Common": "broken into many small pieces.\ndevastated emotionally"
  },
  "sherbet": {
    "American English": "a type of frozen dessert (also spelled sherbert; UK similar: sorbet)",
    "British English": "a fizzy powdered confectionery"
  },
  "sheriff": {
    "American English": "elected chief legal officer of a county, usu. also in charge of the \ncounty's law enforcement service; elsewhere any member of a county (vs. \nstate or local) police",
    "British English": "chief royal peace officer of a county, now (as high sheriff) largely only \na ceremonial role (England and Wales)\nlocal judge, in full sheriff-depute or sheriff-substitute (Scotland)"
  },
  "shingle": {
    "American English": "sign proclaiming one's name and calling (\"hang a shingle out\")\nto cover something like a shingled roof",
    "British English": "pebbles, particularly those on the seashore ",
    "Common": "to cut a woman's hair in an overlapping style\n(shingles) a painful disease of the skin, caused by the chickenpox virus\nwooden roof tile\nto cover a roof with wooden tiles"
  },
  "shipping": {
    "American English": "To transport goods, movement of goods\nShipping & handling, standard form of charge for delivery of goods (UK: Postage \n& packing)",
    "Common": "To transport goods by sea, movement of goods by sea\nRelationship (fandom)"
  },
  "shop": {
    "American English": "small or specialized consumer retail establishment (e.g. coffee shop, dress \nshop)\nworkshop; practical class at school taught in a workshop; US auto shop = \nBr. garage, car mechanic.",
    "British English": "consumer retail establishment of any size (US: store); hence shopfront \n(US: storefront), shop-soiled (US: shopworn), shop assistant (US: (sales) \nclerk)\nworkshop, only in combination (\"machine shop\")"
  },
  "shorts": {
    "American English": "underpants, boxers \n\n(take it in one's shorts) endure a painful situation (\"He really took it \nin the shorts that time.\")",
    "British English": "strong alcoholic drinks served in multiples of 25 ml, sometimes with mixers \n(US & UK also: shots)",
    "Common": "short trousers (US: short pants)"
  },
  "shot": {
    "American English": "an injection with a hypodermic needle, as in the case of an inoculation \n(UK: jab)",
    "Common": "many meanings"
  },
  "shower": {
    "American English": "a celebratory party where gifts are given to an individual e.g. a baby \nshower to celebrate an imminent birth",
    "Common": "spray of water used to wash oneself\n\na short period of rain"
  },
  "sic": {
    "American English": "pronunciation spelling of \"seek\" used as a dog command, and by extension as \na verb meaning to set (as a dog, etc.) to attack someone (\"I'll sic my \nattorney on you\")",
    "Common": "Latin for \"Thus\", \"just so\" — states that the preceding quoted material \nappears exactly that way in the source, usu. despite errors of spelling, \ngrammar, usage, or fact."
  },
  "sick": {
    "American English": "(to be sick) nauseous\n(out sick) not at work because of illness",
    "British English": "(to be sick) to vomit\n(off sick) not at work because of illness\n(n.) vomit (\"a puddle of sick\")",
    "Common": "unwell, not in good health (except with \"to be\" in UK English)\n(slang) disgusting (corruption of sickening)\n(slang) cool, good, interesting"
  },
  "sideboard": {
    "British English": "(pl.) sideburns, side-whiskers",
    "Common": "an item of furniture also known as buffet"
  },
  "siding": {
    "American English": "a short section of railroad track connected by switches with a main track, \nenabling trains on the same line to pass (UK: loop)\nexternal wall covering, cladding, weatherboarding",
    "Common": "a dead-end railway track leading off the main line and used to store \nrolling-stock"
  },
  "silencer": {
    "British English": "device to silence a car/automobile (US: muffler)",
    "Common": "device to silence a firearm"
  },
  "silk": {
    "American English": "the silky, pistillate flower of corn (maize)\na parachute (orig. slang of the United States Air Force)",
    "British English": "a Queen's Counsel",
    "Common": "material made from unwound silkworm cocoons \n\n(silky) smooth, having the texture of silk (cf., silky words)"
  },
  "silverware": {
    "American English": "eating implements (spoon, fork, knife) (UK: cutlery; US also flatware)",
    "British English": "things made from silver, including bowls, spoons, etc. Also trophies won by \na sports team (i.e. FA Cup, Challenge Cup...)"
  },
  "sketchy": {
    "American English": "questionable, disreputable",
    "Common": "lacking detail or substance"
  },
  "skillet": {
    "American English": "a frying pan, often cast iron\na long-handled stewing pan or saucepan, often having short legs or feet",
    "British English": "(regional dialect) a frying pan\na type of stir-fried food item"
  },
  "skip": {
    "American English": "one who disappears without paying their debts (\"finding a good skip tracer \nis harder than finding your debtors\") (UK: Gone Away)",
    "British English": "large rubbish container (US approx: Dumpster)",
    "Common": "an act of leaping or omitting; see skip (radio), skip (in audio playback)"
  },
  "skive": {
    "British English": "to avoid work or school (play truant)",
    "Common": "v. to cut or pare leather/rubber; n. an indentation made from skiving"
  },
  "skivvy": {
    "American English": "(pl.) men's underwear (colloquial)",
    "British English": "a scullery maid or lowest servant doing menial work, somebody at the bottom \nof the pecking order"
  },
  "slag": {
    "British English": "(derogatory) promiscuous woman (US & UK also: slut)\na general insult directed at someone of either sex",
    "Common": "A product from the iron-smelting blast furnace; mainly used in tarmac \nproduction"
  },
  "slash": {
    "American English": "an open tract in a forest strewn with debris, especially from logging\na swampy area",
    "British English": "(colloq.) an act of urinating (\"to have a slash\")",
    "Common": "to cut drastically \n\nthe symbol '/' (orig. US) (also virgule, solidus; UK also: oblique, \nstroke)\nshort for slash fiction, a genre of fan fiction that explores romantic or \nsexual relationships between same-sex characters"
  },
  "slate": {
    "American English": "(v.) to schedule (\"slated for demolition\")\nto designate (a candidate, as for political office)\n(n.) a list of candidates",
    "British English": "(v.) to disparage (\"many critics have slated the film\"), hence slating",
    "Common": "(n.) a type of rock; a greyish colour\n(v.) to cover with slate"
  },
  "sleeper": {
    "American English": "Sleeper (automobile), an automobile modified for high performance but with \na normal-looking exterior (UK: Q-car)",
    "British English": "A horizontal member which lies beneath, and binds together, the rails of a \nrailway. (US: railroad tie, crosstie)",
    "Common": "A railway vehicle providing sleeping accommodation (a sleeping car).\nSleeper agent - A deep cover secret agent"
  },
  "sleet": {
    "American English": "(partially) frozen raindrops, ice pellets; a mixture of rain and snow or \nhail; also, glaze (q.v.)",
    "British English": "snow that has partially thawed on its fall to the ground"
  },
  "slough": {
    "American English": "a secondary channel; a small backwater; a pond (usu. pronounced /ˈsluː/ and \noften spelled slew)",
    "British English": "(usu. pronounced /ˈslaʊ/, to rhyme with \"plough\")",
    "Common": "a marshy area, a swamp"
  },
  "smarties": {
    "American English": "a fruit-flavored tablet candy produced by Ce De Candy, Inc",
    "British English": "a sugar-coated chocolate confectionery manufactured by Nestlé (similar to \nUS M&M's)"
  },
  "smashed": {
    "American English": "Exceedingly drunk",
    "Common": "beaten, destroyed as in \"it was smashed"
  },
  "smokestack": {
    "American English": "(attrib.) heavy industry, manufacturing industry (\"smokestack industries\", \n\"smokestack stocks\")",
    "Common": "a system (as a pipe) for venting hot gases and smoke: such a system on \nbuildings, locomotives (UK primarily: chimney or funnel), and ships (UK \n& US also: funnel)"
  },
  "smudge": {
    "American English": "a smouldering mass placed on the windward side to protect from frost or \nkeep insects away (as in smudge pot)",
    "Common": "a blurry spot or streak"
  },
  "snout": {
    "British English": "police informant\ntobacco (slang)",
    "Common": "pig's nose\nnose (slang)"
  },
  "sod": {
    "American English": "turf",
    "British English": "unpleasant person, originally short for sodomite (\"He's a sod, isn't he?\")\nunfortunate person when prefixed by 'poor' (\"The poor sod's had his wallet \nnicked.\") or 'silly' (\"The silly sod really got it knackered.\"); also an \nexclamation of frustration, esp. as an abbreviation for sodomy: \"Sod it!",
    "Common": "layer of grass and earth (in UK in a formal/literary sense), cf. 'sodden'"
  },
  "soda": {
    "American English": "(regional) carbonated soft drink, usu. one sold ready-mixed (also 'pop,' \n'soda pop') (UK: fizzy drink or colloquially (fizzy) pop)",
    "British English": "carbonated water, or any non-alcoholic drink made with it, but not usu. one \nsold ready-mixed",
    "Common": "any of various chemical compounds containing sodium (as sodium bicarbonate \nor sodium carbonate), carbonated water"
  },
  "solicitor": {
    "American English": "one that solicits (e.g. contributions to charity), an advertiser, a \nsalesperson, a promoter; often annoying\n\nchief law officer of a city, town, or government department",
    "British English": "lawyer who advises clients, represents them in the lower courts, and \nprepares cases for barristers to try in higher courts (considered overly \nformal in US)"
  },
  "solitaire": {
    "American English": "any of a family of one-player card games (see solitaire) (UK: patience)",
    "British English": "peg-jumping puzzle game (see peg solitaire)"
  },
  "sort": {
    "British English": "to deal with; hence sorted as expression of appreciation; (slang) to be \nadequately supplied with narcotics\n\nall used with out:\nto arrange or take care of (something) \nto solve an esp. difficult situation (also reflexive) \n(informal) to set (someone) straight, or to get even with (someone)\nsorted, to have or get fixed, have problems worked out, so things are \nworking correctly (\"He's really got it sorted now.\")",
    "Common": "to arrange or classify; often used with out"
  },
  "spanner": {
    "American English": "a wrench with holes or pins at its end for meshing with the object to be \nturned (UK: C spanner)",
    "British English": "general term for a tool used for turning nuts, bolts, etc. (US: wrench, \nq.v.)\nsomething interfering (US: (monkey) wrench)"
  },
  "spaz": {
    "American English": "uncoordinated, hyperactive, messing something up. Can be used \nself-referentially. Has less offensive connotations in American usage.",
    "British English": "(offensive) Incompetent, useless, disabled person (from spastic, person \nwith cerebral palsy)"
  },
  "spigot": {
    "American English": "a tap or faucet",
    "Common": "a spile in a cask"
  },
  "spook": {
    "American English": "a black person (insulting)",
    "Common": "a ghost; a spy, government undercover agent (both orig. US)"
  },
  "spotty": {
    "American English": "of inhomogeneous quality (\"a spotty record\")",
    "British English": "pimply (\"a spotty teenager\")"
  },
  "sprouts": {
    "American English": "alfalfa sprouts",
    "British English": "brussels sprouts"
  },
  "spunk": {
    "British English": "(vulgar) seminal fluid (US: cum)",
    "Common": "courage, daring, or enthusiasm"
  },
  "squash": {
    "American English": "vegetable (squash (plant))(UK also gourd)",
    "British English": "fruit cordial drink (squash (drink))",
    "Common": "sport (squash (sport))"
  },
  "squat": {
    "American English": "(n.) nothing (slang; short for diddly-squat)\n(more at cop)",
    "Common": "(n.) premises occupied by squatters (v.)\nto occupy (as premises) illegally\nto bend deeply at the knees while resting on one's feet\n(n.) the act of squatting\nan exercise in weightlifting"
  },
  "stabiliser": {
    "British English": "(pl.) additional wheels to help learner cyclists (US: training wheels)",
    "Common": "something that stabilises, as stabilizer (aircraft) or stabilizer \n(chemistry)"
  },
  "stabilizer": {
    "British English": "(pl.) additional wheels to help learner cyclists (US: training wheels)",
    "Common": "something that stabilises, as stabilizer (aircraft) or stabilizer \n(chemistry)"
  },
  "stall": {
    "American English": "compartment containing a shower or toilet (UK: cubicle)\na marked-off parking space\nenclosure for a locomotive in a roundhouse\n(box stall) compartment in a barn where an animal can move untethered \n(UK: loose box)",
    "British English": "(pl.) front seats in a theatre (US: orchestra)",
    "Common": "compartment for an animal in a barn\na booth or counter (as in a marketplace)\nseat in a church's choir"
  },
  "stand": {
    "British English": "to be a candidate in an election (US: run)",
    "Common": "to be vertical; to remain stationary; to buy (someone) (something)"
  },
  "starter": {
    "American English": "transportation dispatcher or elevator (q.v.) dispatcher\nstarting pitcher (baseball)\nthe official who starts a track race.",
    "British English": "first course of a meal (US usu. appetizer); more s.v. entree",
    "Common": "one that starts (as a device to start an engine)"
  },
  "stash": {
    "American English": "(n.) a hiding place, or something (esp. drug or liquor) stored away",
    "British English": "(v.) to quit, put an end to (\"to stash it\")",
    "Common": "(v.) to store away"
  },
  "stick": {
    "British English": "abuse, insult, or denigration (\"to give stick\")",
    "Common": "a long, thin piece of wood"
  },
  "stone": {
    "British English": "(pl. usu. stone) 14 pounds in weight (14 lb), normally used when \nspecifying a person's weight (\"My weight is twelve stone four\", meaning 12 \nstone and 4 pounds; US \"172 pounds\")",
    "Common": "a small rock"
  },
  "stood": {
    "British English": "(colloquial, mainly Northern English) standing (\"I've been stood here for \nan hour\")",
    "Common": "past tense and participle of stand"
  },
  "stoop": {
    "American English": "raised porch or entrance veranda (orig. Dutch; esp. Northeast). Also refers \nto the external stairs leading up to a row house, \"Sitting on the stoop.",
    "British English": "A post or pillar, especially a gatepost. (Rare except in dialect).",
    "Common": "forwards bend of the spine bringing the shoulders in front of the hips\ndive of a predatory bird towards its prey"
  },
  "store": {
    "American English": "consumer retail establishment of any size (UK: shop), e.g. grocery store, \nhardware store, convenience store, dime store; hence storefront \n(UK: shopfront), storekeeper (UK: shopkeeper)",
    "British English": "place for storage of items not needed for immediate use",
    "Common": "large consumer retail establishment (as department store or superstore)"
  },
  "story": {
    "American English": "a floor of a building (UK: storey)",
    "Common": "an account of events, usu. fictional but sometimes factual"
  },
  "stove": {
    "American English": "(or cookstove) appliance for cooking food – compare range (UK usu. \ncooker)\nsee also Franklin stove",
    "British English": "a hothouse or greenhouse for plants\nthe grate of a fireplace",
    "Common": "wood- or coal-burning room-heating appliance (but in AmE this usage almost \nalways limited to historical contexts, e.g. \"one-room schoolhouses usually \nhad potbelly stoves for warmth.\")"
  },
  "straight away": {
    "American English": "(solid) a straight (in a road, racecourse, etc.)",
    "British English": "(usu. spaced) immediately, right away "
  },
  "straightaway": {
    "American English": "(solid) a straight (in a road, racecourse, etc.)",
    "British English": "(usu. spaced) immediately, right away "
  },
  "strike": {
    "American English": "to miss, as to miss the ball with the bat in baseball,\n(strike three, three strikes) (colloq., from baseball) gone, fired, \nejected; said of someone especially after they've been given three chances \nto improve their (presumably) bad behavior (\"Strike three, he's out!\")",
    "British English": "a good solid shot, as in scoring a goal in soccer\n(Strike off) to remove a professional's license (e.g., for attorneys: US \ndisbar) (\"What do you call a priest who's been stricken off?\" – Dick \nFrancis)",
    "Common": "to temporarily stop working (often as part of a union)\nknock down all pins in bowling\nto ignite a match"
  },
  "stroke": {
    "British English": "slash symbol (/)",
    "Common": "cerebrovascular accident\n\nstroke (rowing), various meanings in the sport of rowing\nstroke play, a scoring system used in golf\nswimming stroke, a swimming style\na scuba diver not following the rules of Doing It Right\nstroke (engine), a single action of some engines\nthe recognition, attention or responsiveness that one person gives another \nin transactional analysis"
  },
  "student": {
    "American English": "person studying at any educational institution ",
    "Common": "person studying at a post-secondary educational institution"
  },
  "stuff": {
    "British English": "to have sex - often used as a milder form of \"fuck\", e.g. \"Get stuffed!\" \n(for \"Fuck off!\"), \"Our team got stuffed in the match\", etc.",
    "Common": "to pack tightly with, especially with food: \"I'm stuffed\"=\"I've eaten too \nmuch\"."
  },
  "stuffed animal": {
    "American English": "soft toy, plush toy",
    "British English": "the result of taxidermy on what was once a live animal"
  },
  "sub": {
    "American English": "substitute teacher (UK: supply teacher)\nto teach in place of the normal teacher\n(regional) submarine sandwich",
    "British English": "to subsidise (pay for something in place of someone else - often used for \nany sort of informal loan)\n(in newspaper publishing) edit copy for length or house style (in full: \nsub-edit)\n\nsubscription (UK: membership dues, as in an association or club)\nsub-lieutenant (Royal Navy rank)\nsubaltern (British Army second lieutenant or lieutenant)",
    "Common": "subscription: a purchase by prepayment for a certain number of issues, as \nof a periodical\nsubmarine\n(n. & v.) substitute (usu. in sport)\n(sexual) submissive"
  },
  "subdivision": {
    "American English": "the division of a tract of land into lots (q.v.) for the purpose of sale, \nor the tract of land so divided. (UK: estate, development)",
    "Common": "the process or an instance of subdividing"
  },
  "subway": {
    "American English": "underground commuter railway (UK: underground or tube)",
    "British English": "pedestrian underpass\nGlasgow subterranean railway",
    "Common": "(Subway) restaurant chain for submarine sandwiches"
  },
  "sucker": {
    "American English": "A lollipop\nany person or thing (used either humorously or in annoyance)",
    "Common": "One who sucks (lit. and fig.): fool, dupe, gullible person\nSecondary shoot produced from the roots of a plant"
  },
  "suds": {
    "American English": "(v.) to form suds; hence sudser (a soap opera) and adj. sudsy (in both \nlit. & fig. senses)\n(n.) beer, less commonly root beer",
    "Common": "(n.) froth, lather; (v.) to lather"
  },
  "superintendent": {
    "American English": "person in charge of a building (UK: caretaker)\nthe head of a school district or a State Department of Education\nsometimes, the head of a police department\n(dated) a train conductor",
    "British English": "senior police rank (US approx.: deputy inspector)",
    "Common": "senior official in various undertakings (railways, public works, etc.)"
  },
  "surgery": {
    "British English": "the place where a physician or dentist practises (US: (doctor's) office)",
    "Common": "act of performing a medical operation"
  },
  "suspenders": {
    "American English": "elasticated support for trousers (UK: braces, q.v.)",
    "British English": "elasticated support for stockings (US: garter)"
  },
  "swede": {
    "British English": "Swedish (yellow) turnip (US: rutabaga)",
    "Common": "(Swede) a person from Sweden"
  },
  "sweet": {
    "American English": "(n.) Short for sweetheart. Also, to be sweet on someone is to have a crush \non them.\n(adj.) used to describe something as good (\"That car is sweet!\")",
    "British English": "(n.) An after-meal dessert, more s.v. candy",
    "Common": "(adj.) Sweet-tasting; (adj.) to describe someone who is kind, gentle, or \ngiving"
  },
  "switch": {
    "American English": "(n.) mechanism that allows a railway vehicle to change tracks (UK: points); \nhence switch engine or switcher (UK: shunter), switchyard (UK: marshalling \nyard), switch tower (UK: signal box)\n(v.) to change tracks by means of a switch\nsee also bait and switch",
    "Common": "(n.) see switch, telephone switch, network switch\n(v.) to operate a switch\nto exchange, swap, make a shift"
  },
  "switchback": {
    "American English": "a zigzagging road or railway, usu. in the mountains; also, a hairpin turn \nin a road or trail",
    "British English": "a road or railway that alternately ascends and descends\na roller coaster"
  },
  "tab": {
    "American English": "a formal account for services at a restaurant or bar (\"May I have the \ntab?\", \"Pick up the tab\") (UK always bill in this context)\nA brand of soft drink\n(keep tabs on) monitor the activity of a person or thing",
    "British English": "a cigarette (Geordie)\nto run; often used in the military to refer to double-time or quick-time \nmarching. From the abbreviation Tactical Advance to Battle.",
    "Common": "a small projection, flap, etc.\nan informal credit account, usu. at a bar (\"Put it on my tab\")\nThe tab key,"
  },
  "taffy": {
    "American English": "a type of sweet or candy (UK: chew)",
    "British English": "(capitalised) derogatory term for a Welsh person"
  },
  "tailback": {
    "American English": "offensive backfield position in American football",
    "British English": "queue of vehicles, traffic jam (US: gridlock, backup)"
  },
  "tank top": {
    "American English": "sleeveless T-shirt (UK: vest, q.v.) (also see wifebeater) ",
    "British English": "jumper (US: sweater) without sleeves"
  },
  "tanner": {
    "British English": "slang for a pre-decimalisation sixpence coin or sixpence value",
    "Common": "one who tans"
  },
  "tap": {
    "American English": "to select, designate; esp. to publicly select for a special honour from \none's peers as in the (possibly apocryphal) American Indian ceremony (\"She \nwas tapped for the position of CEO\") and as in being designated a college \nfraternity pledge.\nvulgar slang for \"have sex with",
    "British English": "valve through which liquid is drawn and dispensed (US usu.: faucet, \nspigot)\n(tap up) to covertly enter negotiations (\"The manager accused the other \nteam of tapping up his player\") (US: tampering)",
    "Common": "a spile or spigot in a cask; a device for dispensing beer from a keg\n(phone tap) a device for listening to other people's telephone calls\n(tap dance) A type of dance e.g. \"I go to tap every Saturday"
  },
  "tart": {
    "British English": "female prostitute\n(In US, generally understood but not generally used except in pop tart \n)",
    "Common": "(adj) sour-flavoured, sarcastic\n(n) any of several forms of sweet dessert or snack consisting of filling \n(usually fruit) in a pastry shell\n\nsaucy, promiscuous woman (derog.)"
  },
  "tea": {
    "American English": "Iced tea sometimes taken with lemon or sugar",
    "British English": "afternoon snack (US: late lunch)\nevening meal (sometimes called high tea)",
    "Common": "a hot beverage made by infusing Camellia sinensis leaves (hot tea);\n\nHerb tea a tea-like beverage made from herbs (UK infusion (archaic))"
  },
  "teller": {
    "American English": "a bank clerk or cashier who receives and pays out money ; hence automated \nteller machine",
    "Common": "one that tells (as stories)\na person who counts the votes in an election"
  },
  "terrace": {
    "American English": "(regional) parking (q.v.)",
    "British English": "row of identical or mirror-image houses sharing side walls (US: row house, \ntownhouse)",
    "Common": "a type of veranda or walkway or area close to a building\nsee also terrace (agriculture), terrace garden, fluvial terrace"
  },
  "terrier": {
    "British English": "member of the Territorial Army (slang). Also, record of land ownership \n(e.g. by local authority).",
    "Common": "one of various smallish breeds of dog"
  },
  "theater": {
    "American English": "cinema (\"movie/motion picture theater\")",
    "British English": "(or operating theatre) hospital room for surgical operations (US: operating \nroom)",
    "Common": "a place where stage plays are performed; the dramatic art in general (\"He \ngot his training in theatre.\")\na principle region of conflict in a war"
  },
  "theatre": {
    "American English": "cinema (\"movie/motion picture theater\")",
    "British English": "(or operating theatre) hospital room for surgical operations (US: operating \nroom)",
    "Common": "a place where stage plays are performed; the dramatic art in general (\"He \ngot his training in theatre.\")\na principle region of conflict in a war"
  },
  "through": {
    "American English": "Up to, until. The shop is open through lunch means it closes at lunch \ntime, whereas in British English it would mean it is open including at \nlunch time.",
    "British English": "For a period of time, during. For example, it is open through the night \nmeans it is open during the night time. More usual in British English is to \nsay \"Open until 6pm Monday\"."
  },
  "tick": {
    "British English": "the symbol ✓ (US: check mark)\na moment (\"just a tick\")\ncredit (\"on tick\")",
    "Common": "blood-sucking arachnid (see tick)\nsound of an analogue clock"
  },
  "tick off": {
    "American English": "to annoy \n\nto keep a record of tasks (\"He ticked off a list of things that needed to \nbe done beforehand.\")",
    "British English": "to admonish"
  },
  "tie": {
    "American English": "a horizontal member, which lies beneath, and binds together, the rails of a \nrailroad (also crosstie) (UK: sleeper)",
    "British English": "a game between two teams e.g. Manchester won the tie against London",
    "Common": "an article of clothing worn around the neck\na game result in which neither player/team wins (also draw)"
  },
  "tights": {
    "American English": "skin-tight, often opaque, trousers (UK: leggings) or one-piece trousers \nand top (UK: unitard), such as worn by gymnasts",
    "British English": "nylons, usu. sheer, which also cover the groin (US: pantyhose if sheer)"
  },
  "tip": {
    "American English": "(tip one's hand, from Poker) to disclose one's intentions or opinions",
    "British English": "(n.) a place where rubbish is disposed (US: dump (also UK), landfill)\n(v.) to pour",
    "Common": "(n.) pointed or narrow end\nadvice\nvoluntary gratuity paid (as at a restaurant)\n(v.) (tip off) to advise\n(v.) to (cause to) lean to one side"
  },
  "tit": {
    "British English": "various species of small bird of the genus Parus (US: chickadee, \ntitmouse)\nidiot (slang)",
    "Common": "woman's breast (vulgar slang)"
  },
  "to table": {
    "American English": "(also lay on the table or to cause to lie on the \ntable) to suspend from consideration, to shelve (in Congress, the meaning \nof \"to table a bill\" is to kill it), to postpone indefinitely or postpone \nto a certain time (usually intended as one of those two motions in Robert's \nRules of Order)",
    "British English": "(also lay on the table or to cause to lie on the \ntable) to raise for consideration, to schedule for consideration after a \ndelay of \"lying on the table",
    "Common": "Both dialects have the sense of \"to table\" as to lay on the \ntable or to cause to lie on the table. The difference is in \nthe intent of how long the topic is to stay on the table. The British \nmeaning has the sense of anticipation that the topic will foreseeably be \ncalled off the table for discussion and vote; the American sense is to \ndispose the topic by sending it to the table and leaving it there."
  },
  "toasted": {
    "American English": "somewhat drunk\n(related toast) in trouble (\"When the boss catches him, he's toast!\" \"Oh \nman, we're toast!\")",
    "Common": "lightly cooked on both sides (e.g. of a slice of bread)"
  },
  "toilet": {
    "British English": "room containing a toilet (US: restroom)\n\"I left my comb in the toilet,\" is perfectly acceptable in UK but likely to \nprovoke a visual in American English",
    "Common": "apparatus for excretion"
  },
  "tom": {
    "British English": "prostitute\n-- hence tomming (pp.), the activity of prostitution\na private in the Parachute Regiment (slang)",
    "Common": "unneutered male cat"
  },
  "torch": {
    "American English": "(v.) commit an act of arson. (n.) an arsonist.",
    "British English": "handheld device that emits light (US: flashlight)",
    "Common": "flaming club used as a light source"
  },
  "tosser": {
    "American English": "not a hoarder; someone who gets rid of things i.e. \"are you a keeper or \ntosser?",
    "British English": "idiot (literally, someone who masturbates, a derogatory term similar to \nwanker)",
    "Common": "one that tosses"
  },
  "tough": {
    "American English": "that's unfortunate (short for \"tough luck\")",
    "Common": "I don't care"
  },
  "tout": {
    "American English": "(v.) to promote, recommend (\"the movie was touted as a masterpiece\")",
    "British English": "(v.) to resell tickets at higher prices (US: scalp)\nto get and sell information on racehorses\n(n.) one who resells tickets (US: scalper)\none who gets and sells information on racehorses\n(n.) a police informer (mainly used in Northern Ireland and the Republic of \nIreland) (US: stool pigeon, England: grass)",
    "Common": "(v.) to importune, solicit, or canvass\n(n.) one who does this"
  },
  "tower": {
    "American English": "power line transmission structure (UK usu. & US occas. pylon, q.v.);\nrailroad building containing levers for working switches (q.v.) and \nsignals (\"an interlocking tower\") (UK: signal box)\nhence towerman, person in charge of any such tower (UK, for a signal box: \nsignalman)",
    "British English": "a fortified keep, too small to be named a \"castle\", e.g. along the \nEnglish/Scottish Border (\"a peel tower\"), along the English coast & \nelsewhere (inc. occas. U.S. Eastern Seaboard) (\"a Martello tower\"), around \nthe Jersey (Channel Islands) coast (\"a Jersey tower\");\n\ntower block — a high-rise block (q.v.) of flats",
    "Common": "man-made structure, taller than it is wide (see control tower, watchtower, water \ntower)"
  },
  "tower block": {
    "American English": "power line transmission structure (UK usu. & US occas. pylon, q.v.);\nrailroad building containing levers for working switches (q.v.) and \nsignals (\"an interlocking tower\") (UK: signal box)\nhence towerman, person in charge of any such tower (UK, for a signal box: \nsignalman)",
    "British English": "a fortified keep, too small to be named a \"castle\", e.g. along the \nEnglish/Scottish Border (\"a peel tower\"), along the English coast & \nelsewhere (inc. occas. U.S. Eastern Seaboard) (\"a Martello tower\"), around \nthe Jersey (Channel Islands) coast (\"a Jersey tower\");\n\ntower block — a high-rise block (q.v.) of flats",
    "Common": "man-made structure, taller than it is wide (see control tower, watchtower, water \ntower)"
  },
  "town house": {
    "American English": "one of two or more single-family houses of uniform design and joined by \ncommon sidewalls (US also rowhouse, UK usu. terraced house for more \nthan two, or semi(-detached) for two joined houses)",
    "British English": "historically, residence of a peer or member of the aristocracy in the \ncapital or major city\n(Scots) town hall\n(modern usage) a fashionable urban house, usu. terraced",
    "Common": "a house in town (as opposed to one in the country)"
  },
  "townhouse": {
    "American English": "one of two or more single-family houses of uniform design and joined by \ncommon sidewalls (US also rowhouse, UK usu. terraced house for more \nthan two, or semi(-detached) for two joined houses)",
    "British English": "historically, residence of a peer or member of the aristocracy in the \ncapital or major city\n(Scots) town hall\n(modern usage) a fashionable urban house, usu. terraced",
    "Common": "a house in town (as opposed to one in the country)"
  },
  "township": {
    "American English": "an approx. 36-square-mile (93 km2) division of land comprising 36 sections\na unit of local government, see civil township",
    "British English": "in the past, a subdivision used to administer a large parish\n(Scotland) a very small agricultural community"
  },
  "track": {
    "American English": "used in railway stations (as with following number) to denote the place \nwhere a train arrives at and departs from (\"Is that the Chattanooga choo \nchoo, track 29?\") (UK: platform)\ntrack and field, athletics, esp. the sports performed on the running track \n\n\ncategorisation of students according to their needs",
    "Common": "a trail\na footprint\nawareness (\"keep/lose track\")\nrecorded material\ndistance between wheels of a vehicle\na racetrack or racecourse\nthe rails of a railway (UK often: line)"
  },
  "trainer": {
    "British English": "a padded sport shoe (US similar: sneaker)",
    "Common": "one who trains"
  },
  "tramp": {
    "American English": "loose or promiscuous woman (see also tramp stamp); prostitute ",
    "Common": "homeless person who moves (tramps) from town to town (US also: hobo)"
  },
  "transit": {
    "American English": "means of public transportation (q.v.) (esp. of people) (\"mass transit\", \"rapid \ntransit\", \"public transit\") – see Public transport",
    "Common": "act or instance of passing\nsee astronomical transit, navigational transit, transit (surveying)"
  },
  "transport": {
    "British English": "the system or the business of transporting goods or passengers or the \nvehicles used in such a system (\"public transport\") ",
    "Common": "the act of transporting\nan emotion (\"transports of delight\")"
  },
  "transportation": {
    "American English": "the system or the business of transporting goods or passengers or the \nvehicles used in such a system ",
    "Common": "the act of transporting\npenal transportation"
  },
  "trapezium": {
    "American English": "a quadrilateral with no parallel sides",
    "British English": "a quadrilateral with one pair of parallel sides"
  },
  "trapezoid": {
    "American English": "a quadrilateral with one pair of parallel sides ",
    "British English": "a quadrilateral with no parallel sides",
    "Common": "in anatomy, the trapezoid bone and trapezoid ligament"
  },
  "treacle": {
    "British English": "molasses",
    "Common": "cloying, overly sentimental"
  },
  "triangle": {
    "American English": "a triangular object used in technical drawing (UK: set square)",
    "Common": "any three-sided figure"
  },
  "trick": {
    "American English": "(n.) what a prostitute does for a client\n(adj.) unstable (of a joint of the body) ",
    "Common": "(n.) an action intended to deceive\nan effective way of doing something\na single round of some card games, in which every player plays one card"
  },
  "trillion": {
    "British English": "(traditionally) million million million (1018) (US & modern UK: \nquintillion)",
    "Common": "million million (1012) (traditional UK: billion, now rare)"
  },
  "trim": {
    "American English": "woodwork, frameworks etc. in a house\nstorefront or shopfront display\n(slang, somewhat offensive) Female genitalia (usu. as \"Get some trim\")",
    "Common": "good condition (\"in trim\")\nclothing, decoration\na finishing haircut\nadjustment (as of sails on a vessel or airfoils on an aircraft)\nan automobile interior ornamentation or upholstery (orig. US)"
  },
  "triplex": {
    "American English": "a 3-storey apartment or 3-apartment dwelling (see duplex)\n\na large steam locomotive with three sets of driving wheels",
    "Common": "composed of three parts, as a type of cardboard, a cinema, etc."
  },
  "trolley": {
    "American English": "(or trolley car) a streetcar (UK: tram) electrically powered by means \nof a trolley; hence trolley line, trolley road, and trackless trolley \n(a trolleybus)",
    "British English": "cart or wheeled stand used for conveying something (as food or books) (\"a \nsupermarket trolley\"; \"a tea trolley\") (US: see s.v. cart, wagon)\n(off one's trolley) insane\n(trolleyed) very drunk",
    "Common": "a mechanism that rolls along a suspended rail or track"
  },
  "troop": {
    "British English": "to carry (the flag or colors) in a ceremonial way before troops",
    "Common": "a group of persons, particularly in a military or scouting context. \nGenerally, a group of two or more platoons and headquarters staff.\n(pl.) soldiers, members of the military (we sent 3000 troops)"
  },
  "trooper": {
    "American English": "state police officer (\"state trooper\")\n(slang) a heroic person that prevails against the odds or takes on a \ndifficult labor without complaint (originally 'trouper')",
    "British English": "cavalry horse troopship (obs.)\nrank held by a private in the Household Cavalry, Royal Armoured Corps or SAS"
  },
  "truck": {
    "American English": "motor vehicle for carrying heavy cargo (UK usu. lorry); see also garbage \ntruck (UK: dustcart), truck stop (UK: transport cafe)\nproduce grown for the market; hence truck farm (UK: market garden)\na hand truck (UK: trolley)\nin a railroad car, the undercarriage assembly incorporating wheels, \nsuspension, and brakes (UK: bogie)\n(v.) to transport by or drive a truck; to move around carelessly",
    "British English": "railway vehicle for carrying goods; can be open (\"a coal truck\") or covered \n(\"a cattle truck\") – cf. s.v. wagon",
    "Common": "any of various vehicles for carrying esp. things or animals, as a forklift \ntruck or a pickup truck"
  },
  "trunk": {
    "American English": "storage compartment of a car (UK: boot)\n(trunk line) a main railway line (as from Chicago to New York City) (UK: main \nline)",
    "British English": "primary road (trunk road)\n(trunk call) long-distance telephone call (dated)",
    "Common": "the human torso\nthe main stem of a tree\nlarge (person-sized) container (also travelling chest)\nproboscis, particularly that of an elephant"
  },
  "tube": {
    "American English": "television",
    "British English": "(often cap.) the London subterranean railway system (\"the London Underground\"); \n(sometimes incorrectly applied to that of other cities, e.g. \"the Berlin \ntube\")",
    "Common": "a cylindrical structure or device"
  },
  "turning": {
    "British English": "A place where you can turn off a road. Not generally used where the turn would take you onto a more major road or for a crossroads. (US: turn). \"drive past the post-office and you'll see a small turning to the right, which leads directly to our farm\""
  },
  "turnout": {
    "American English": "a place along a highway for slower cars to pull over, in order to let \nothers pass, or for brief parking (UK: layby)",
    "British English": "strike, walkout",
    "Common": "number of people taking part in an event (\"voter turnout\")\na railroad switch or point\nequipment\noutput"
  },
  "turnover": {
    "American English": "the rate at which employees in a place of work leave and are replaced ",
    "British English": "revenue, gross sales ",
    "Common": "a pastry with fruit filling"
  },
  "twat": {
    "American English": "(chiefly late 1970s, early 1980s) a jerk; someone acting inappropriately; \nan ass (q.v.)",
    "British English": "someone who is being stupid (offensive; considered vulgar by some)\nto hit someone or something hard (\"say that again and I'll twat you!\"\n(pronounced /ˈtwæt/)",
    "Common": "vulva (vulgar)\n(pronounced /ˈtwɒt/)"
  },
  "twister": {
    "American English": "a tornado",
    "Common": "something that twists; see also Twister (game)"
  },
  "tyke": {
    "American English": "a young animal",
    "British English": "someone from Yorkshire (informal, sometimes disparaging)",
    "Common": "term of endearment for a child, like \"little rascal"
  },
  "undercoat": {
    "American English": "a rustproofing treatment applied to the underneath of an automobile (UK: \nunderseal)",
    "British English": "a coat of paint applied prior to the top coat (US: primer)",
    "Common": "a layer of fine hair close to the skin of a mammal"
  },
  "underground": {
    "American English": "(Underground Railroad or Railway) (before 1863) the network of \nclandestine routes by which slaves were helped to escape to free states and \nCanada. More generally, any secret resistance organization, as in Weather \nUnderground and French underground.",
    "British English": "(often cap.) subterranean railway system, esp. the ones in London & Glasgow \n(US: subway or metro) -- see also tube",
    "Common": "subterranean\nillicit\na subterranean space or channel\ngrapevine (in the sense of an informal communication network)"
  },
  "vacation": {
    "American English": "(n.) time off from work or school\nrecreational trip away from home\n(UK: holiday for both senses) (v.) to take a vacation",
    "British English": "(UK also: vac)",
    "Common": "period between university terms"
  },
  "valve": {
    "British English": "Vacuum tube, as in pre-1960 electronics",
    "Common": "a device to control the flow of liquids or gases"
  },
  "vanity": {
    "American English": "a sink-unit in a bathroom",
    "Common": "pride in one's appearance"
  },
  "vest": {
    "American English": "sleeveless garment worn over a shirt (UK: waistcoat) (e.g. ballistic vest \n)",
    "British English": "garment, usu. sleeveless, worn under a shirt (US: undershirt or beater)\nsleeveless garment worn as an only visible top"
  },
  "vet": {
    "American English": "war veteran or a person who has served honorably in the military",
    "Common": "(n.) veterinarian\n(v.) to appraise or verify for accuracy or validity"
  },
  "veterinary": {
    "British English": "(n.) veterinarian",
    "Common": "(a.) pertaining to the medical science of caring of animals"
  },
  "vine": {
    "American English": "any climbing or twining plant (UK \"climber\")",
    "British English": "grapevine"
  },
  "visit": {
    "American English": "(intrans.) to pay a visit, stay as a guest, or be engaged in informal \nconversation (\"visiting together\", \"visit with a friend\")",
    "Common": "(trans.) to go and see (a person or place)"
  },
  "waffle": {
    "American English": "(v.) to equivocate, waver, speak evasively",
    "British English": "(v.) to speak to no purpose; ramble",
    "Common": "A type of pancake with a pattern of square dents in it, made in a waffle \niron."
  },
  "wagon": {
    "American English": "small wheeled food service table (UK: trolley); see also paddy wagon \n(used in the UK, but non PC), station wagon, chuckwagon, wagon train",
    "British English": "railway vehicle for transporting goods (US: freight car)",
    "Common": "4-wheeled orig. animal-drawn vehicle (UK also spelled waggon esp. in the \npast);\nstate of abstaining from alcohol (orig. US slang)\na delivery van (\"the milk wagon\")"
  },
  "walk out": {
    "American English": "(adj.) (of a room in a building) featuring outdoor access; (n.) such an \naccess (\"full walkout basement\", \"walkout to the deck\")\n(n.) one who goes out of a store or shop without buying anything",
    "British English": "(v.) \"walk out with\", to be romantically involved with (archaic)",
    "Common": "(v.) to leave a meeting in protest\nto strike (orig. US)\nto abandon someone, or to drop out (\"she walked out on me\") (orig. US)\n(n.) a kind of strike action (orig. US)\nthe act of leaving a meeting in protest"
  },
  "walking stick": {
    "American English": "(n.) a type of insect (UK : stick insect)",
    "Common": "(n.) a stick to aid with walking"
  },
  "walkout": {
    "American English": "(adj.) (of a room in a building) featuring outdoor access; (n.) such an \naccess (\"full walkout basement\", \"walkout to the deck\")\n(n.) one who goes out of a store or shop without buying anything",
    "British English": "(v.) \"walk out with\", to be romantically involved with (archaic)",
    "Common": "(v.) to leave a meeting in protest\nto strike (orig. US)\nto abandon someone, or to drop out (\"she walked out on me\") (orig. US)\n(n.) a kind of strike action (orig. US)\nthe act of leaving a meeting in protest"
  },
  "warden": {
    "American English": "official in charge of a prison (UK usu. governor)\nin compounds: fire warden",
    "British English": "any of various officials (a \"traffic warden\")\nan official in certain universities",
    "Common": "gener., one in charge of something"
  },
  "wash up": {
    "American English": "to wash one's hands and face; to clean before eating food",
    "British English": "to wash the dishes; to clean after eating food, hence washing-up liquid \n(US dish soap)"
  },
  "watershed": {
    "American English": "a drainage basin/water catchment area (shift from orig. sense) ",
    "British English": "(orig. sense, now nontech.) a ridge of hills (which \"sheds water\") \nseparating two river drainage basins; water parting (old-fashioned or \nnontechnical in US; US usu. divide)\nthe time of day before which programme content of an adult nature, or of a \nspecific or implied kind, may not be screened and after which it is \npermissible (US: safe harbor)",
    "Common": "(fig.) a turning point"
  },
  "well": {
    "British English": "really (colloquial, used for emphasis) (\"that was well funny\")",
    "Common": "adverb of good\nhealthy, in good form\npit sunk to obtain water or oil"
  },
  "wicked": {
    "American English": "(adverb) very (esp. New England) (\"Wicked good\")",
    "British English": "(interjection) used for something very good, astounding or interesting \n(\"Wicked!\")",
    "Common": "(adj.) evil; fierce; roguish; vile"
  },
  "wife-beater": {
    "American English": "a sleeveless shirt (such as that worn by Marlon Brando in \"A Streetcar \nNamed Desire\") (also Scotland)",
    "British English": "(slang) the beer Stella Artois (perh. also related to \"A Streetcar Named \nDesire\")",
    "Common": "(wife beater) one who beats up his wife"
  },
  "wifebeater": {
    "American English": "a sleeveless shirt (such as that worn by Marlon Brando in \"A Streetcar \nNamed Desire\") (also Scotland)",
    "British English": "(slang) the beer Stella Artois (perh. also related to \"A Streetcar Named \nDesire\")",
    "Common": "(wife beater) one who beats up his wife"
  },
  "wing": {
    "British English": "panel of a car that encloses the wheel area (US: fender)",
    "Common": "apparatus used to create lift in aeronautics\na type of spoiler (on racecars)\nthe act of carrying out an activity with little or no planning, To wing \nsomething, \"Let's wing it!\" (slang)"
  },
  "wing commander": {
    "American English": "a duty title for an air force officer, typically a full colonel or a \nbrigadier general, who commands a wing (Note American wings are larger \nformations than British wings)",
    "British English": "air force officer rank (US equivalent: lieutenant colonel)"
  },
  "wingnut": {
    "American English": "(n.) (mild) a crazy or strange person\n\nWingnut (politics), an uncomplimentary term for someone of right-wing or \nconservative views",
    "British English": "(n.) derogatory term for a person with prominent, sticking out, ears",
    "Common": "(n.) a nut with projections to allow application of greater torque with the \nfingers\na type of tree"
  },
  "wink": {
    "British English": "(n.) \"winker\", slang term for a turn indicator (US: see blinker)",
    "Common": "(n. & v.) the closing of one eye"
  },
  "wrangle": {
    "American English": "(esp. West) to herd horses or other livestock; back-formation from \nwrangler\nto achieve through contrivance; to wangle",
    "Common": "to bicker or quarrel angrily and noisily"
  },
  "wreck": {
    "American English": "a usu. major road, rail, or air accident or collision",
    "Common": "shipwreck\nthat which remains of something wrecked\nsomeone who is unwell or out of sorts (e.g. \"nervous wreck\")"
  },
  "wrench": {
    "American English": "a tool used for tightening nuts and bolts (used in UK chiefly in \ncombination, e.g. torque wrench)\nsomething disrupting (often monkey wrench) (\"that will throw a monkey \nwrench into my plans\")\n(UK usu. spanner for both senses)",
    "Common": "a sudden pull or twist\nemotional distress"
  },
  "xerox": {
    "American English": "(n.) A photocopied document \n(v.) To photocopy ",
    "Common": "the Xerox Corporation"
  },
  "yank": {
    "American English": "(n.)1. A patriot from the American Revolution;\n2. a New Englander; in the South, someone from the Northern US (often \ndisparaging). A Minnesotan would not consider himself a Yankee or use the \nword regularly, but would consider someone from Connecticut to be a yankee; \na Texan would consider both yankees, but not himself, and would be much \nmore likely to use the word;\n3. a player for the New York Yankees baseball team",
    "British English": "(sometimes disparaging, esp. when shortened to yank)",
    "Common": "someone from the U.S."
  },
  "yankee": {
    "American English": "(n.)1. A patriot from the American Revolution;\n2. a New Englander; in the South, someone from the Northern US (often \ndisparaging). A Minnesotan would not consider himself a Yankee or use the \nword regularly, but would consider someone from Connecticut to be a yankee; \na Texan would consider both yankees, but not himself, and would be much \nmore likely to use the word;\n3. a player for the New York Yankees baseball team",
    "British English": "(sometimes disparaging, esp. when shortened to yank)",
    "Common": "someone from the U.S."
  },
  "yard": {
    "American English": "enclosed area of land surrounding a dwelling, usu. comprising lawn and play \narea (UK usu.: garden)\n(yard sale) see garage sale\na campus (e.g. Harvard Yard)\na place (as in a forest) where deer gather in winter\n100 dollars (slang)\na billion (slang, finance)\ngo yard, to hit a home run",
    "Common": "a courtyard\nan enclosed space used for a particular activity (as a railway service \narea, a lumberyard or timber yard, a junkyard, etc.)\na unit of length"
  },
  "z": {
    "American English": "(pronounced /ˈziː/)\na nap (\"to catch some z's\")\nzero or no (\"I have z cash right now.\")",
    "British English": "(pronounced /ˈzɛd/)",
    "Common": "the last letter of the alphabet"
  },
  "zebra": {
    "American English": "a referee (as in American football) (from their striped uniforms)\n(pronounced /ˈziːbrə/) \n\npolice car (slang)",
    "British English": "(zebra crossing) a type of pedestrian crossing\n(pronounced /ˈzɛbrə/) ",
    "Common": "an African equine mammal"
  },
  "zip": {
    "American English": "zero (often in scores, similar to the UK's nil)\n(often all cap.) the ZIP code (from Zone Improvement Plan), the postal \ncode used by the USPS",
    "British English": "(short for zip fastener) a fastening device (US: zipper)",
    "Common": "a sharp, hissing sound\nimpetus\nfile format for compressed files (\"archive.zip\")"
  },
  "à la mode": {
    "American English": "with ice cream (ex. Apple pie à la mode)",
    "Common": "fashionable"
  }
}
